
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Sandbox/did_interactions.do
>  ../../../All/m_2203820020_4/intermediate ../output/ month 2011 11 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args coming from the python script*/
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. /* *args: year_completed   = `4' */
. /* *args: month_completed  = `5' */
. 
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_2203820020_4/intermediate

. log using `2'/did_stata_int_`3', text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_2203820020_4/intermediate/.
> ./output//did_stata_int_month.log
  log type:  text
 opened on:   6 Jan 2021, 12:35:02

. 
. import delimited "stata_did_`3'.csv", encoding(ISO-8859-1)
(23 vars, 561,687 obs)

. 
. /*Install Packages*/
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /* Fixed Effects */
. egen entity_effects = group(upc dma_code)

. 
. /* WEIGHTING SCHEMES */
. gen pre_vol = volume * (1 - post_merger)

. gen weights_0 = 1 /*to add weights that won't change things*/

. egen weights_1 = total(pre_vol), by(upc)

. egen weights_2 = total(pre_vol), by(dma_code)

. egen weights_3 = total(pre_vol), by(upc dma_code)

. replace weights_1 = round(weights_1)
(450,433 real changes made)

. replace weights_2 = round(weights_2)
(511,616 real changes made)

. replace weights_3 = round(weights_3)
(523,366 real changes made)

. 
. /*Naive Variables*/
. gen np_dhhi = post_merger*dhhi

. gen np_HHI = post_merger*post_hhi

. 
. /*One Year Post*/
. gen month_date = ym(year, month)

. tabstat month_date if (month==`5' & year==`4'), save

    variable |      mean
-------------+----------
  month_date |       622
------------------------

. matrix cutoff=r(StatTotal)

. local cutoff=cutoff[1,1]

. gen after = 0

. replace after = 1 if month_date >= `cutoff' + 12
(115,821 real changes made)

. gen post_merger_1y = post_merger * after

. gen post_merger_merging_1y = post_merger_merging * after

. 
. /*Coarse HHI Bins*/
. gen HHI_bins = 0

. replace HHI_bins = 1 if (post_hhi*10000>1500 & post_hhi*10000<2500)
(98,510 real changes made)

. replace HHI_bins = 2 if (post_hhi*10000>2500 & !missing(post_hhi))
(463,177 real changes made)

. 
. /*Coarse DHHI Bins*/
. gen DHHI_bins = 0

. replace DHHI_bins = 1 if (dhhi*10000>100 & dhhi*10000<200)
(80,848 real changes made)

. replace DHHI_bins = 2 if (dhhi*10000>200 & !missing(dhhi))
(99,566 real changes made)

. 
. /*Finer HHI Bins*/
. gen HHI_binsf = 0

. replace HHI_binsf = 1 if (post_hhi*10000>=375 & post_hhi*10000<750)
(0 real changes made)

. replace HHI_binsf = 2 if (post_hhi*10000>=750 & post_hhi*10000<1125)
(0 real changes made)

. replace HHI_binsf = 3 if (post_hhi*10000>=1125 & post_hhi*10000<1500)
(0 real changes made)

. replace HHI_binsf = 4 if (post_hhi*10000>=1500 & post_hhi*10000<1750)
(6,848 real changes made)

. replace HHI_binsf = 5 if (post_hhi*10000>=1750 & post_hhi*10000<2000)
(16,782 real changes made)

. replace HHI_binsf = 6 if (post_hhi*10000>=2000 & post_hhi*10000<2250)
(31,698 real changes made)

. replace HHI_binsf = 7 if (post_hhi*10000>=2250 & post_hhi*10000<2500)
(43,182 real changes made)

. replace HHI_binsf = 8 if (post_hhi*10000>=2500 & !missing(post_hhi))
(463,177 real changes made)

. 
. /*Finer DHHI Bins*/
. gen DHHI_binsf = 0

. replace DHHI_binsf = 1 if (dhhi*10000>=25 & dhhi*10000<50)
(46,316 real changes made)

. replace DHHI_binsf = 2 if (dhhi*10000>=50 & dhhi*10000<75)
(29,400 real changes made)

. replace DHHI_binsf = 3 if (dhhi*10000>=75 & dhhi*10000<100)
(27,282 real changes made)

. replace DHHI_binsf = 4 if (dhhi*10000>=100 & dhhi*10000<125)
(24,428 real changes made)

. replace DHHI_binsf = 5 if (dhhi*10000>=125 & dhhi*10000<150)
(14,470 real changes made)

. replace DHHI_binsf = 6 if (dhhi*10000>=150 & dhhi*10000<175)
(21,380 real changes made)

. replace DHHI_binsf = 7 if (dhhi*10000>175 & dhhi*10000<200)
(20,570 real changes made)

. replace DHHI_binsf = 8 if (dhhi*10000>=200 & !missing(dhhi))
(99,566 real changes made)

. 
. /*HHI and DHHI Bins*/
. gen DHHI_HHI = 0

. replace DHHI_HHI = 1 if (dhhi*10000>=25 & dhhi*10000<50 & post_hhi*10000>=375
>  & post_hhi*10000<750)
(0 real changes made)

. replace DHHI_HHI = 2 if (dhhi*10000>=50 & dhhi*10000<75 & post_hhi*10000>=750
>  & post_hhi*10000<1125)
(0 real changes made)

. replace DHHI_HHI = 3 if (dhhi*10000>=75 & dhhi*10000<100 & post_hhi*10000>=11
> 25 & post_hhi*10000<1500)
(0 real changes made)

. replace DHHI_HHI = 4 if (dhhi*10000>=100 & dhhi*10000<125 & post_hhi*10000>=1
> 500 & post_hhi*10000<1750)
(2,272 real changes made)

. replace DHHI_HHI = 5 if (dhhi*10000>=125 & dhhi*10000<150 & post_hhi*10000>=1
> 750 & post_hhi*10000<2000)
(1,840 real changes made)

. replace DHHI_HHI = 6 if (dhhi*10000>=150 & dhhi*10000<175 & post_hhi*10000>=2
> 000 & post_hhi*10000<2250)
(0 real changes made)

. replace DHHI_HHI = 7 if (dhhi*10000>=175 & dhhi*10000<200 & post_hhi*10000>=2
> 250 & post_hhi*10000<2500)
(3,255 real changes made)

. replace DHHI_HHI = 8 if (dhhi*10000>=200 & !missing(dhhi) & post_hhi*10000>=2
> 500 & !missing(post_hhi))
(88,184 real changes made)

. 
. /*Nocke & Whinston Bins*/
. gen DHHI_HHI_NW = 0

. replace DHHI_HHI_NW = 1 if (dhhi*10000>=100 & dhhi*10000<200 & post_hhi*10000
> >=1500 & post_hhi*10000<2500)
(18,477 real changes made)

. replace DHHI_HHI_NW = 2 if (dhhi*10000>=200 & !missing(dhhi) & post_hhi*10000
> >2500 & !missing(post_hhi))
(88,184 real changes made)

. 
. /*Main Routine*/
. forval x = 0/3 {
  2. 
. * 1y After
. reghdfe lprice post_merger_merging post_merger post_merger_1y post_merger_mer
> ging_1y trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
  3. est sto after_`x'
  4. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("1
> y After") replace
  5. 
. * HHI Coarse
. reghdfe lprice post_merger_merging#i.HHI_bins post_merger#i.HHI_bins i.HHI_bi
> ns trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
  6. est sto HHIc_`x'
  7. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("H
> HI bins") append
  8. 
. * DHHI Coarse
. reghdfe lprice post_merger_merging#i.DHHI_bins post_merger#i.DHHI_bins i.DHHI
> _bins trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
  9. est sto DHHIc_`x'
 10. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("D
> HHI bins") append
 11. 
. * HHI Fine
. reghdfe lprice post_merger_merging#i.HHI_binsf post_merger#i.HHI_binsf i.HHI_
> binsf trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 12. est sto HHIf_`x'
 13. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("H
> HI bins") append
 14. 
. * DHHI Fine
. reghdfe lprice post_merger_merging#i.DHHI_binsf post_merger#i.DHHI_binsf i.DH
> HI_binsf trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 15. est sto DHHIf_`x'
 16. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("D
> HHI bins") append
 17. 
. * DHHI & HHI Bins
. reghdfe lprice post_merger_merging#i.DHHI_HHI post_merger#i.DHHI_HHI i.DHHI_H
> HI trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 18. est sto DHHI_HHI_`x'
 19. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("D
> HHI & HHI bins") append
 20. 
. * Nocke & Whinston Regions
. reghdfe lprice post_merger_merging#i.DHHI_HHI_NW post_merger#i.DHHI_HHI_NW i.
> DHHI_HHI_NW trend [aw = weights_`x'], abs(entity_effects) vce(cluster dma_cod
> e)
 21. est sto DHHI_HHI_NW_`x'
 22. outreg2 using `2'/did_stata_int_`3'_`x'.txt, stats(coef se pval) ctitle("N
> W bins") append
 23. 
. est clear
 24. 
. }
(dropped 273 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   5,    204) =     256.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9029
                                                  Adj R-squared   =     0.9003
                                                  Within R-sq.    =     0.0234
Number of clusters (dma_code) =        205        Root MSE        =     0.1234

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0058476   .0031245    -1.87   0.063     -.012008    .0003129
 post_merger |   .0354799   .0014971    23.70   0.000      .032528    .0384318
post_me~r_1y |   .0366533   .0017446    21.01   0.000     .0332135     .040093
post_me~g_1y |  -.0146648   .0045633    -3.21   0.002     -.023662   -.0056676
       trend |   -.002206   .0000736   -29.99   0.000     -.002351   -.0020609
       _cons |   2.100616   .0018498  1135.58   0.000     2.096969    2.104264
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 2bn.HHI_bins is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 2.HHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   5,    204) =     171.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9024
                                                  Adj R-squared   =     0.8997
                                                  Within R-sq.    =     0.0181
Number of clusters (dma_code) =        205        Root MSE        =     0.1237

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    HHI_bins |
        1 1  |  -.0384712   .0078173    -4.92   0.000    -.0538842   -.0230582
        1 2  |  -.0062347   .0032639    -1.91   0.058      -.01267    .0002007
             |
 post_merger#|
    HHI_bins |
        1 1  |   .0383026    .003302    11.60   0.000     .0317922    .0448129
        1 2  |   .0369681   .0017232    21.45   0.000     .0335706    .0403656
             |
  2.HHI_bins |          0  (omitted)
       trend |  -.0016985   .0000648   -26.21   0.000    -.0018262   -.0015707
       _cons |    2.09183   .0016805  1244.79   0.000     2.088517    2.095143
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 1bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_bins omitted because of collinearity
note: 2.DHHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   7,    204) =     141.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9024
                                                  Adj R-squared   =     0.8998
                                                  Within R-sq.    =     0.0188
Number of clusters (dma_code) =        205        Root MSE        =     0.1237

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   DHHI_bins |
        1 0  |  -.0221997   .0035283    -6.29   0.000    -.0291563   -.0152432
        1 1  |   .0038038   .0065917     0.58   0.565    -.0091928    .0168005
        1 2  |    .017682   .0076346     2.32   0.022     .0026292    .0327349
             |
 post_merger#|
   DHHI_bins |
        1 0  |   .0383075   .0019358    19.79   0.000     .0344909    .0421242
        1 1  |   .0275256   .0037041     7.43   0.000     .0202223    .0348288
        1 2  |    .041075   .0047453     8.66   0.000     .0317188    .0504312
             |
   DHHI_bins |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0016983   .0000648   -26.22   0.000    -.0018259   -.0015706
       _cons |   2.091852    .001686  1240.75   0.000     2.088528    2.095176
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 5bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 6bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 7bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 8bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 5.HHI_binsf omitted because of collinearity
note: 6.HHI_binsf omitted because of collinearity
note: 7.HHI_binsf omitted because of collinearity
note: 8.HHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(  11,    204) =      80.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9024
                                                  Adj R-squared   =     0.8997
                                                  Within R-sq.    =     0.0181
Number of clusters (dma_code) =        205        Root MSE        =     0.1237

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   HHI_binsf |
        1 4  |   -.036407   .0328608    -1.11   0.269    -.1011974    .0283834
        1 5  |  -.0477326   .0133036    -3.59   0.000    -.0739628   -.0215024
        1 6  |  -.0344254   .0169799    -2.03   0.044     -.067904   -.0009468
        1 7  |  -.0383771   .0102826    -3.73   0.000    -.0586509   -.0181032
        1 8  |  -.0062348   .0032639    -1.91   0.058    -.0126701    .0002006
             |
 post_merger#|
   HHI_binsf |
        1 4  |   .0327331   .0118147     2.77   0.006     .0094385    .0560278
        1 5  |   .0430135   .0046805     9.19   0.000     .0337852    .0522418
        1 6  |   .0355536    .005688     6.25   0.000     .0243388    .0467685
        1 7  |   .0394461   .0054661     7.22   0.000     .0286688    .0502235
        1 8  |   .0369658   .0017226    21.46   0.000     .0335694    .0403623
             |
   HHI_binsf |
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0016984   .0000648   -26.22   0.000    -.0018261   -.0015707
       _cons |    2.09183   .0016792  1245.76   0.000     2.088519     2.09514
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 1bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 3bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 4bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 6bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_binsf omitted because of collinearity
note: 2.DHHI_binsf omitted because of collinearity
note: 3.DHHI_binsf omitted because of collinearity
note: 4.DHHI_binsf omitted because of collinearity
note: 5.DHHI_binsf omitted because of collinearity
note: 6.DHHI_binsf omitted because of collinearity
note: 7.DHHI_binsf omitted because of collinearity
note: 8.DHHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(  19,    204) =      61.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9025
                                                  Adj R-squared   =     0.8998
                                                  Within R-sq.    =     0.0190
Number of clusters (dma_code) =        205        Root MSE        =     0.1236

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
  DHHI_binsf |
        1 0  |  -.0192598   .0043064    -4.47   0.000    -.0277506    -.010769
        1 1  |  -.0305947   .0086439    -3.54   0.000    -.0476375   -.0135519
        1 2  |  -.0364851    .007717    -4.73   0.000    -.0517004   -.0212699
        1 3  |  -.0235016   .0108417    -2.17   0.031    -.0448777   -.0021255
        1 4  |   .0045651   .0151663     0.30   0.764    -.0253377     .034468
        1 5  |  -.0094684   .0201242    -0.47   0.639    -.0491465    .0302097
        1 6  |   .0083705   .0113661     0.74   0.462    -.0140396    .0307807
        1 7  |   .0082802   .0070765     1.17   0.243    -.0056722    .0222327
        1 8  |   .0176829   .0076347     2.32   0.022     .0026299    .0327358
             |
 post_merger#|
  DHHI_binsf |
        1 0  |   .0368614   .0022763    16.19   0.000     .0323733    .0413494
        1 1  |   .0433479   .0043142    10.05   0.000     .0348418    .0518541
        1 2  |   .0386342   .0037736    10.24   0.000      .031194    .0460744
        1 3  |    .043566   .0052788     8.25   0.000     .0331579     .053974
        1 4  |   .0334125   .0078489     4.26   0.000     .0179372    .0488878
        1 5  |   .0249279   .0095981     2.60   0.010     .0060038     .043852
        1 6  |   .0320931   .0042473     7.56   0.000     .0237189    .0404673
        1 7  |   .0173709   .0072491     2.40   0.017     .0030781    .0316636
        1 8  |   .0410942   .0047447     8.66   0.000     .0317393    .0504492
             |
  DHHI_binsf |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0016989   .0000647   -26.26   0.000    -.0018265   -.0015714
       _cons |   2.091885   .0016712  1251.74   0.000      2.08859     2.09518
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 4bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: 4.DHHI_HHI omitted because of collinearity
note: 5.DHHI_HHI omitted because of collinearity
note: 7.DHHI_HHI omitted because of collinearity
note: 8.DHHI_HHI omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(  11,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9024
                                                  Adj R-squared   =     0.8998
                                                  Within R-sq.    =     0.0186
Number of clusters (dma_code) =        205        Root MSE        =     0.1237

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    DHHI_HHI |
        1 0  |  -.0164452   .0032795    -5.01   0.000    -.0229113   -.0099791
        1 4  |  -.0502788   .0001435  -350.44   0.000    -.0505617   -.0499959
        1 5  |  -.2098305   .0003356  -625.25   0.000    -.2104922   -.2091689
        1 7  |  -.0160043    .000184   -86.96   0.000    -.0163672   -.0156415
        1 8  |   .0175863   .0078396     2.24   0.026     .0021292    .0330433
             |
 post_merger#|
    DHHI_HHI |
        1 0  |   .0362584   .0017576    20.63   0.000      .032793    .0397237
        1 4  |   .0489922   .0017558    27.90   0.000     .0455304    .0524539
        1 5  |   .0625188   .0017231    36.28   0.000     .0591215    .0659161
        1 7  |   .0449309   .0017159    26.18   0.000     .0415477    .0483141
        1 8  |   .0412162    .005139     8.02   0.000     .0310838    .0513486
             |
    DHHI_HHI |
          4  |          0  (omitted)
          5  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0016996   .0000648   -26.22   0.000    -.0018274   -.0015718
       _cons |   2.091903   .0016871  1239.97   0.000     2.088577    2.095229
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 1bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_HHI_NW omitted because of collinearity
note: 2.DHHI_HHI_NW omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   7,    204) =     142.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9024
                                                  Adj R-squared   =     0.8998
                                                  Within R-sq.    =     0.0184
Number of clusters (dma_code) =        205        Root MSE        =     0.1237

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
 DHHI_HHI_NW |
        1 0  |   -.016911   .0033144    -5.10   0.000    -.0234458   -.0103762
        1 1  |  -.0175005    .017262    -1.01   0.312    -.0515352    .0165342
        1 2  |   .0175853   .0078396     2.24   0.026     .0021282    .0330424
             |
 post_merger#|
 DHHI_HHI_NW |
        1 0  |   .0365354   .0017746    20.59   0.000     .0330364    .0400344
        1 1  |   .0341801   .0092764     3.68   0.000     .0158901      .05247
        1 2  |   .0411926   .0051392     8.02   0.000     .0310598    .0513255
             |
 DHHI_HHI_NW |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0016988   .0000648   -26.20   0.000    -.0018266    -.001571
       _cons |   2.091863   .0016887  1238.71   0.000     2.088533    2.095192
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(   5,    204) =      75.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8813
                                                  Adj R-squared   =     0.8782
                                                  Within R-sq.    =     0.0253
Number of clusters (dma_code) =        205        Root MSE        =     0.1254

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0094816   .0042878    -2.21   0.028    -.0179356   -.0010275
 post_merger |   .0368906    .003649    10.11   0.000      .029696    .0440852
post_me~r_1y |   .0486336   .0047294    10.28   0.000     .0393088    .0579583
post_me~g_1y |  -.0306313   .0079687    -3.84   0.000    -.0463428   -.0149198
       trend |   -.002051   .0001284   -15.98   0.000    -.0023041   -.0017979
       _cons |   2.029755   .0028582   710.16   0.000      2.02412    2.035391
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
note: 2bn.HHI_bins is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 2.HHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(   5,    204) =      70.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8813
                                                  Adj R-squared   =     0.8782
                                                  Within R-sq.    =     0.0253
Number of clusters (dma_code) =        205        Root MSE        =     0.1254

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    HHI_bins |
        1 1  |  -.0745499   .0082517    -9.03   0.000    -.0908195   -.0582804
        1 2  |  -.0113552    .004554    -2.49   0.013    -.0203341   -.0023762
             |
 post_merger#|
    HHI_bins |
        1 1  |   .0514629    .006453     7.97   0.000     .0387397    .0641861
        1 2  |   .0469857   .0033943    13.84   0.000     .0402933    .0536781
             |
  2.HHI_bins |          0  (omitted)
       trend |  -.0016527   .0001051   -15.73   0.000    -.0018598   -.0014455
       _cons |   2.022896   .0023934   845.19   0.000     2.018177    2.027615
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
note: 1bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_bins omitted because of collinearity
note: 2.DHHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(   7,    204) =      47.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8809
                                                  Adj R-squared   =     0.8778
                                                  Within R-sq.    =     0.0219
Number of clusters (dma_code) =        205        Root MSE        =     0.1257

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   DHHI_bins |
        1 0  |  -.0371173   .0045036    -8.24   0.000    -.0459969   -.0282377
        1 1  |  -.0031649   .0118484    -0.27   0.790    -.0265259     .020196
        1 2  |   .0160933   .0114848     1.40   0.163    -.0065508    .0387374
             |
 post_merger#|
   DHHI_bins |
        1 0  |   .0550272   .0033782    16.29   0.000     .0483666    .0616879
        1 1  |    .031582   .0074856     4.22   0.000      .016823    .0463411
        1 2  |   .0313522   .0081469     3.85   0.000     .0152893    .0474151
             |
   DHHI_bins |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0016431    .000105   -15.65   0.000    -.0018501   -.0014361
       _cons |   2.022631   .0025251   801.01   0.000     2.017652    2.027609
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
note: 5bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 6bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 7bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 8bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 5.HHI_binsf omitted because of collinearity
note: 6.HHI_binsf omitted because of collinearity
note: 7.HHI_binsf omitted because of collinearity
note: 8.HHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(  11,    204) =     120.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8814
                                                  Adj R-squared   =     0.8783
                                                  Within R-sq.    =     0.0261
Number of clusters (dma_code) =        205        Root MSE        =     0.1254

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   HHI_binsf |
        1 4  |  -.0645863    .018534    -3.48   0.001     -.101129   -.0280436
        1 5  |  -.1135116   .0191303    -5.93   0.000    -.1512299   -.0757932
        1 6  |  -.0654624   .0150319    -4.35   0.000    -.0951001   -.0358246
        1 7  |  -.0675773   .0111434    -6.06   0.000    -.0895483   -.0456062
        1 8  |  -.0113536    .004554    -2.49   0.013    -.0203325   -.0023747
             |
 post_merger#|
   HHI_binsf |
        1 4  |   .0176135   .0139995     1.26   0.210    -.0099888    .0452158
        1 5  |   .0512882    .013707     3.74   0.000     .0242626    .0783138
        1 6  |   .0569343    .012454     4.57   0.000     .0323793    .0814893
        1 7  |   .0525702    .008638     6.09   0.000      .035539    .0696015
        1 8  |   .0470441   .0033928    13.87   0.000     .0403546    .0537336
             |
   HHI_binsf |
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0016546    .000105   -15.76   0.000    -.0018617   -.0014476
       _cons |   2.022948   .0023761   851.36   0.000     2.018263    2.027633
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
note: 1bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 3bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 4bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 6bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_binsf omitted because of collinearity
note: 2.DHHI_binsf omitted because of collinearity
note: 3.DHHI_binsf omitted because of collinearity
note: 4.DHHI_binsf omitted because of collinearity
note: 5.DHHI_binsf omitted because of collinearity
note: 6.DHHI_binsf omitted because of collinearity
note: 7.DHHI_binsf omitted because of collinearity
note: 8.DHHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(  19,    204) =      18.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8810
                                                  Adj R-squared   =     0.8779
                                                  Within R-sq.    =     0.0228
Number of clusters (dma_code) =        205        Root MSE        =     0.1256

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
  DHHI_binsf |
        1 0  |  -.0346582   .0053929    -6.43   0.000    -.0452911   -.0240252
        1 1  |  -.0424886   .0118577    -3.58   0.000     -.065868   -.0191092
        1 2  |  -.0508133   .0136491    -3.72   0.000    -.0777247    -.023902
        1 3  |  -.0423158   .0150057    -2.82   0.005     -.071902   -.0127296
        1 4  |  -.0047089    .023771    -0.20   0.843    -.0515772    .0421595
        1 5  |  -.0383965   .0238936    -1.61   0.110    -.0855065    .0087135
        1 6  |   .0015214   .0041569     0.37   0.715    -.0066745    .0097174
        1 7  |   .0213797   .0297707     0.72   0.473     -.037318    .0800774
        1 8  |   .0160972   .0114848     1.40   0.163    -.0065469    .0387414
             |
 post_merger#|
  DHHI_binsf |
        1 0  |   .0567065   .0038762    14.63   0.000     .0490639    .0643491
        1 1  |   .0558375   .0070633     7.91   0.000     .0419111    .0697638
        1 2  |   .0434695   .0082594     5.26   0.000     .0271849    .0597542
        1 3  |    .050936   .0082861     6.15   0.000     .0345987    .0672733
        1 4  |   .0331494   .0124086     2.67   0.008     .0086838     .057615
        1 5  |   .0368486   .0132351     2.78   0.006     .0107535    .0629437
        1 6  |   .0421583   .0090435     4.66   0.000     .0243277     .059989
        1 7  |   .0140663   .0200781     0.70   0.484    -.0255209    .0536534
        1 8  |   .0314684    .008145     3.86   0.000     .0154092    .0475277
             |
  DHHI_binsf |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0016471   .0001048   -15.71   0.000    -.0018537   -.0014404
       _cons |   2.022737   .0024746   817.39   0.000     2.017858    2.027616
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
note: 4bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: 4.DHHI_HHI omitted because of collinearity
note: 5.DHHI_HHI omitted because of collinearity
note: 7.DHHI_HHI omitted because of collinearity
note: 8.DHHI_HHI omitted because of collinearity

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(  11,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8810
                                                  Adj R-squared   =     0.8779
                                                  Within R-sq.    =     0.0226
Number of clusters (dma_code) =        205        Root MSE        =     0.1256

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    DHHI_HHI |
        1 0  |  -.0293753   .0043789    -6.71   0.000    -.0380089   -.0207416
        1 4  |  -.0830973   .0000699 -1188.10   0.000    -.0832352   -.0829594
        1 5  |  -.1949584   .0001029 -1894.59   0.000    -.1951613   -.1947555
        1 7  |  -.0657734   .0004335  -151.71   0.000    -.0666282   -.0649186
        1 8  |   .0190269   .0122022     1.56   0.120    -.0050317    .0430856
             |
 post_merger#|
    DHHI_HHI |
        1 0  |   .0506149   .0032239    15.70   0.000     .0442584    .0569714
        1 4  |   .0383269   .0030181    12.70   0.000     .0323762    .0442776
        1 5  |   .0574399   .0029484    19.48   0.000     .0516268    .0632531
        1 7  |   .0503041   .0027623    18.21   0.000     .0448578    .0557503
        1 8  |   .0304848   .0085378     3.57   0.000     .0136512    .0473185
             |
    DHHI_HHI |
          4  |          0  (omitted)
          5  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0016464   .0001051   -15.67   0.000    -.0018535   -.0014393
       _cons |   2.022739   .0025151   804.23   0.000      2.01778    2.027698
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 250 singleton observations)
note: 1bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_HHI_NW omitted because of collinearity
note: 2.DHHI_HHI_NW omitted because of collinearity

HDFE Linear regression                            Number of obs   =    541,764
Absorbing 1 HDFE group                            F(   7,    204) =      57.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8810
                                                  Adj R-squared   =     0.8779
                                                  Within R-sq.    =     0.0226
Number of clusters (dma_code) =        205        Root MSE        =     0.1256

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
 DHHI_HHI_NW |
        1 0  |  -.0290846   .0044491    -6.54   0.000    -.0378568   -.0203124
        1 1  |  -.0638773   .0192876    -3.31   0.001    -.1019059   -.0258486
        1 2  |   .0190273   .0122022     1.56   0.120    -.0050313    .0430858
             |
 post_merger#|
 DHHI_HHI_NW |
        1 0  |   .0513576   .0032364    15.87   0.000     .0449765    .0577387
        1 1  |   .0293278   .0125531     2.34   0.020     .0045774    .0540782
        1 2  |   .0304947   .0085382     3.57   0.000     .0136603    .0473291
             |
 DHHI_HHI_NW |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0016468   .0001051   -15.67   0.000     -.001854   -.0014396
       _cons |   2.022737   .0025037   807.89   0.000       2.0178    2.027673
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     13762       13762           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   5,    204) =      85.74
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9082
                                                  Adj R-squared   =     0.9057
                                                  Within R-sq.    =     0.0165
Number of clusters (dma_code) =        205        Root MSE        =     0.1245

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0118113   .0072113    -1.64   0.103    -.0260297     .002407
 post_merger |   .0338911   .0030685    11.04   0.000     .0278411    .0399411
post_me~r_1y |   .0279368   .0033283     8.39   0.000     .0213746    .0344991
post_me~g_1y |   .0087227   .0079891     1.09   0.276    -.0070291    .0244746
       trend |  -.0018964   .0001727   -10.98   0.000    -.0022368   -.0015559
       _cons |   2.075376   .0039488   525.57   0.000      2.06759    2.083161
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 2bn.HHI_bins is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 2.HHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   5,    204) =      47.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9077
                                                  Adj R-squared   =     0.9052
                                                  Within R-sq.    =     0.0115
Number of clusters (dma_code) =        205        Root MSE        =     0.1248

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    HHI_bins |
        1 1  |  -.0415163   .0115584    -3.59   0.000    -.0643055   -.0187271
        1 2  |  -.0060654    .005647    -1.07   0.284    -.0171992    .0050685
             |
 post_merger#|
    HHI_bins |
        1 1  |   .0329996   .0069495     4.75   0.000     .0192976    .0467016
        1 2  |   .0326129   .0026407    12.35   0.000     .0274063    .0378195
             |
  2.HHI_bins |          0  (omitted)
       trend |  -.0014051   .0001619    -8.68   0.000    -.0017243    -.001086
       _cons |   2.066685   .0037442   551.96   0.000     2.059303    2.074067
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 1bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_bins omitted because of collinearity
note: 2.DHHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   7,    204) =      32.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9078
                                                  Adj R-squared   =     0.9053
                                                  Within R-sq.    =     0.0121
Number of clusters (dma_code) =        205        Root MSE        =     0.1248

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   DHHI_bins |
        1 0  |  -.0127489   .0062298    -2.05   0.042     -.025032   -.0004658
        1 1  |   .0114923    .005181     2.22   0.028     .0012772    .0217075
        1 2  |   .0237987   .0069427     3.43   0.001     .0101102    .0374873
             |
 post_merger#|
   DHHI_bins |
        1 0  |   .0361623   .0032192    11.23   0.000     .0298152    .0425094
        1 1  |   .0154421   .0054117     2.85   0.005     .0047722    .0261121
        1 2  |   .0268717    .010352     2.60   0.010     .0064611    .0472823
             |
   DHHI_bins |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0014039   .0001621    -8.66   0.000    -.0017235   -.0010843
       _cons |   2.066645   .0036557   565.32   0.000     2.059437    2.073853
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 5bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 6bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 7bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 8bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 5.HHI_binsf omitted because of collinearity
note: 6.HHI_binsf omitted because of collinearity
note: 7.HHI_binsf omitted because of collinearity
note: 8.HHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(  11,    204) =      29.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9077
                                                  Adj R-squared   =     0.9052
                                                  Within R-sq.    =     0.0115
Number of clusters (dma_code) =        205        Root MSE        =     0.1248

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   HHI_binsf |
        1 4  |  -.0684579   .0188617    -3.63   0.000    -.1056469    -.031269
        1 5  |  -.0346891    .009295    -3.73   0.000    -.0530157   -.0163624
        1 6  |  -.0220487   .0129001    -1.71   0.089    -.0474834     .003386
        1 7  |  -.0571988   .0141331    -4.05   0.000    -.0850644   -.0293332
        1 8  |  -.0060655    .005647    -1.07   0.284    -.0171994    .0050685
             |
 post_merger#|
   HHI_binsf |
        1 4  |   .0353087   .0069537     5.08   0.000     .0215983     .049019
        1 5  |   .0394162   .0050875     7.75   0.000     .0293855    .0494469
        1 6  |    .020599   .0054341     3.79   0.000     .0098847    .0313133
        1 7  |   .0416946   .0069614     5.99   0.000      .027969    .0554202
        1 8  |    .032611   .0026407    12.35   0.000     .0274044    .0378176
             |
   HHI_binsf |
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0014051   .0001619    -8.68   0.000    -.0017243   -.0010859
       _cons |   2.066683   .0037437   552.04   0.000     2.059302    2.074065
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 1bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 3bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 4bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 6bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_binsf omitted because of collinearity
note: 2.DHHI_binsf omitted because of collinearity
note: 3.DHHI_binsf omitted because of collinearity
note: 4.DHHI_binsf omitted because of collinearity
note: 5.DHHI_binsf omitted because of collinearity
note: 6.DHHI_binsf omitted because of collinearity
note: 7.DHHI_binsf omitted because of collinearity
note: 8.DHHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(  19,    204) =     312.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9078
                                                  Adj R-squared   =     0.9053
                                                  Within R-sq.    =     0.0126
Number of clusters (dma_code) =        205        Root MSE        =     0.1247

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
  DHHI_binsf |
        1 0  |  -.0087117   .0076837    -1.13   0.258    -.0238613     .006438
        1 1  |  -.0128117   .0080434    -1.59   0.113    -.0286707    .0030472
        1 2  |  -.0382746   .0009916   -38.60   0.000    -.0402297   -.0363195
        1 3  |    -.01998   .0094217    -2.12   0.035    -.0385564   -.0014036
        1 4  |   .0022493   .0129333     0.17   0.862    -.0232508    .0277495
        1 5  |  -.0094774   .0047163    -2.01   0.046    -.0187763   -.0001786
        1 6  |   .0223755   .0065854     3.40   0.001     .0093913    .0353597
        1 7  |   .0095742   .0025227     3.80   0.000     .0046002    .0145482
        1 8  |   .0237982   .0069427     3.43   0.001     .0101095    .0374869
             |
 post_merger#|
  DHHI_binsf |
        1 0  |   .0349859   .0033746    10.37   0.000     .0283324    .0416395
        1 1  |   .0391713   .0056647     6.91   0.000     .0280024    .0503402
        1 2  |   .0384735   .0047484     8.10   0.000     .0291112    .0478357
        1 3  |   .0390829   .0064269     6.08   0.000     .0264113    .0517545
        1 4  |    .024214   .0068655     3.53   0.001     .0106776    .0377504
        1 5  |   .0224384   .0056442     3.98   0.000     .0113098    .0335669
        1 6  |   .0227055   .0048218     4.71   0.000     .0131985    .0322124
        1 7  |  -.0005983   .0047995    -0.12   0.901    -.0100614    .0088647
        1 8  |   .0268582   .0103491     2.60   0.010     .0064533     .047263
             |
  DHHI_binsf |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0014034   .0001618    -8.67   0.000    -.0017225   -.0010843
       _cons |   2.066621   .0035213   586.89   0.000     2.059678    2.073564
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 4bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: 4.DHHI_HHI omitted because of collinearity
note: 5.DHHI_HHI omitted because of collinearity
note: 7.DHHI_HHI omitted because of collinearity
note: 8.DHHI_HHI omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(  11,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9077
                                                  Adj R-squared   =     0.9052
                                                  Within R-sq.    =     0.0116
Number of clusters (dma_code) =        205        Root MSE        =     0.1248

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    DHHI_HHI |
        1 0  |  -.0092119   .0057595    -1.60   0.111    -.0205678    .0021439
        1 4  |  -.0509317   .0003587  -141.98   0.000    -.0516389   -.0502244
        1 5  |  -.2083035   .0008391  -248.25   0.000    -.2099579    -.206649
        1 7  |  -.0168418   .0004602   -36.60   0.000     -.017749   -.0159345
        1 8  |   .0240309   .0070458     3.41   0.001     .0101391    .0379228
             |
 post_merger#|
    DHHI_HHI |
        1 0  |   .0331263   .0028007    11.83   0.000     .0276043    .0386483
        1 4  |   .0410029     .00439     9.34   0.000     .0323474    .0496584
        1 5  |   .0546783   .0043082    12.69   0.000      .046184    .0631727
        1 7  |   .0371229   .0042903     8.65   0.000     .0286638     .045582
        1 8  |   .0267806   .0105733     2.53   0.012     .0059336    .0476275
             |
    DHHI_HHI |
          4  |          0  (omitted)
          5  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0014047    .000162    -8.67   0.000    -.0017242   -.0010852
       _cons |    2.06668    .003765   548.93   0.000     2.059256    2.074103
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 273 singleton observations)
note: 1bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_HHI_NW omitted because of collinearity
note: 2.DHHI_HHI_NW omitted because of collinearity

HDFE Linear regression                            Number of obs   =    561,414
Absorbing 1 HDFE group                            F(   7,    204) =      32.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9077
                                                  Adj R-squared   =     0.9052
                                                  Within R-sq.    =     0.0116
Number of clusters (dma_code) =        205        Root MSE        =     0.1248

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
 DHHI_HHI_NW |
        1 0  |  -.0092154   .0057681    -1.60   0.112    -.0205881    .0021573
        1 1  |  -.0166729   .0090086    -1.85   0.066    -.0344348    .0010889
        1 2  |   .0240309   .0070457     3.41   0.001     .0101391    .0379227
             |
 post_merger#|
 DHHI_HHI_NW |
        1 0  |   .0331335   .0028002    11.83   0.000     .0276125    .0386546
        1 1  |   .0326892   .0086212     3.79   0.000     .0156911    .0496874
        1 2  |     .02678   .0105732     2.53   0.012     .0059332    .0476268
             |
 DHHI_HHI_NW |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0014047    .000162    -8.67   0.000    -.0017242   -.0010852
       _cons |   2.066678   .0037647   548.97   0.000     2.059256    2.074101
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     14909       14909           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(   5,    204) =      19.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9359
                                                  Adj R-squared   =     0.9344
                                                  Within R-sq.    =     0.0153
Number of clusters (dma_code) =        205        Root MSE        =     0.1144

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0063745   .0095835    -0.67   0.507      -.02527    .0125209
 post_merger |    .037591   .0086111     4.37   0.000     .0206128    .0545693
post_me~r_1y |   .0240976   .0103436     2.33   0.021     .0037035    .0444917
post_me~g_1y |   .0149112   .0138349     1.08   0.282    -.0123664    .0421889
       trend |   -.001595   .0002678    -5.96   0.000    -.0021231   -.0010669
       _cons |    1.89265   .0059897   315.98   0.000      1.88084     1.90446
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
note: 2bn.HHI_bins is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 2.HHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(   5,    204) =      38.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9355
                                                  Adj R-squared   =     0.9339
                                                  Within R-sq.    =     0.0086
Number of clusters (dma_code) =        205        Root MSE        =     0.1148

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    HHI_bins |
        1 1  |  -.0565278   .0063473    -8.91   0.000    -.0690426   -.0440131
        1 2  |   .0024806   .0079975     0.31   0.757    -.0132878     .018249
             |
 post_merger#|
    HHI_bins |
        1 1  |   .0361949   .0084248     4.30   0.000      .019584    .0528058
        1 2  |    .034807   .0081639     4.26   0.000     .0187105    .0509034
             |
  2.HHI_bins |          0  (omitted)
       trend |  -.0011074    .000227    -4.88   0.000    -.0015549   -.0006598
       _cons |   1.884066    .005294   355.88   0.000     1.873628    1.894504
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
note: 1bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_bins is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_bins omitted because of collinearity
note: 2.DHHI_bins omitted because of collinearity

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(   7,    204) =      10.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9355
                                                  Adj R-squared   =     0.9340
                                                  Within R-sq.    =     0.0091
Number of clusters (dma_code) =        205        Root MSE        =     0.1148

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   DHHI_bins |
        1 0  |  -.0030325   .0092898    -0.33   0.744    -.0213488    .0152839
        1 1  |   .0319486    .018944     1.69   0.093    -.0054026    .0692998
        1 2  |   .0070245   .0135575     0.52   0.605    -.0197063    .0337552
             |
 post_merger#|
   DHHI_bins |
        1 0  |   .0390768   .0089818     4.35   0.000     .0213677    .0567859
        1 1  |   .0020281   .0230713     0.09   0.930    -.0434608    .0475169
        1 2  |   .0373635   .0206507     1.81   0.072    -.0033528    .0780797
             |
   DHHI_bins |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0011062   .0002267    -4.88   0.000    -.0015533   -.0006592
       _cons |   1.884049   .0052822   356.68   0.000     1.873635    1.894464
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
note: 5bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 6bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 7bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: 8bn.HHI_binsf is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 5.HHI_binsf omitted because of collinearity
note: 6.HHI_binsf omitted because of collinearity
note: 7.HHI_binsf omitted because of collinearity
note: 8.HHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(  11,    204) =      62.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9355
                                                  Adj R-squared   =     0.9339
                                                  Within R-sq.    =     0.0086
Number of clusters (dma_code) =        205        Root MSE        =     0.1148

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
   HHI_binsf |
        1 4  |  -.0949052    .025542    -3.72   0.000    -.1452653    -.044545
        1 5  |  -.0623883   .0156774    -3.98   0.000    -.0932989   -.0314778
        1 6  |  -.0540351   .0098881    -5.46   0.000    -.0735311   -.0345391
        1 7  |  -.0567165   .0099974    -5.67   0.000    -.0764279   -.0370051
        1 8  |   .0024806   .0079976     0.31   0.757    -.0132879    .0182491
             |
 post_merger#|
   HHI_binsf |
        1 4  |   .0262082   .0069368     3.78   0.000     .0125312    .0398852
        1 5  |    .032348   .0119595     2.70   0.007     .0087679     .055928
        1 6  |   .0327616     .01089     3.01   0.003     .0112901     .054233
        1 7  |   .0410221   .0096947     4.23   0.000     .0219074    .0601369
        1 8  |   .0348082    .008164     4.26   0.000     .0187115    .0509049
             |
   HHI_binsf |
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0011074    .000227    -4.88   0.000     -.001555   -.0006598
       _cons |   1.884067   .0052938   355.90   0.000     1.873629    1.894505
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
note: 1bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 3bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 4bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 6bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_binsf is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_binsf omitted because of collinearity
note: 2.DHHI_binsf omitted because of collinearity
note: 3.DHHI_binsf omitted because of collinearity
note: 4.DHHI_binsf omitted because of collinearity
note: 5.DHHI_binsf omitted because of collinearity
note: 6.DHHI_binsf omitted because of collinearity
note: 7.DHHI_binsf omitted because of collinearity
note: 8.DHHI_binsf omitted because of collinearity

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(  19,    204) =     177.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9358
                                                  Adj R-squared   =     0.9342
                                                  Within R-sq.    =     0.0129
Number of clusters (dma_code) =        205        Root MSE        =     0.1145

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
  DHHI_binsf |
        1 0  |   .0012074   .0110124     0.11   0.913    -.0205053    .0229201
        1 1  |  -.0129719   .0151314    -0.86   0.392    -.0428058    .0168621
        1 2  |  -.0308189    .000636   -48.46   0.000     -.032073   -.0295649
        1 3  |  -.0144988   .0048845    -2.97   0.003    -.0241295   -.0048682
        1 4  |   .0183114   .0055924     3.27   0.001     .0072851    .0293377
        1 5  |  -.0291317   .0056354    -5.17   0.000    -.0402427   -.0180207
        1 6  |    .010257   .0072027     1.42   0.156    -.0039444    .0244583
        1 7  |    .104439   .0323074     3.23   0.001     .0407398    .1681382
        1 8  |   .0070247   .0135576     0.52   0.605    -.0197063    .0337557
             |
 post_merger#|
  DHHI_binsf |
        1 0  |   .0410892    .010546     3.90   0.000     .0202961    .0618822
        1 1  |   .0425596   .0097618     4.36   0.000     .0233126    .0618067
        1 2  |    .031099   .0075391     4.13   0.000     .0162345    .0459635
        1 3  |   .0235855   .0076851     3.07   0.002     .0084331    .0387378
        1 4  |    .005706   .0104149     0.55   0.584    -.0148287    .0262406
        1 5  |   .0387349   .0087436     4.43   0.000     .0214956    .0559742
        1 6  |   .0368326   .0162612     2.27   0.025     .0047711    .0688941
        1 7  |  -.0805394   .0283549    -2.84   0.005    -.1364456   -.0246332
        1 8  |     .03738   .0206492     1.81   0.072    -.0033332    .0780931
             |
  DHHI_binsf |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |  -.0011068   .0002266    -4.89   0.000    -.0015535   -.0006601
       _cons |   1.884051   .0049304   382.13   0.000      1.87433    1.893772
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
note: 4bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 5bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 7bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
note: 8bn.DHHI_HHI is probably collinear with the fixed effects (all partialled
> -out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters
note: 4.DHHI_HHI omitted because of collinearity
note: 5.DHHI_HHI omitted because of collinearity
note: 7.DHHI_HHI omitted because of collinearity
note: 8.DHHI_HHI omitted because of collinearity

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(  11,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9355
                                                  Adj R-squared   =     0.9339
                                                  Within R-sq.    =     0.0082
Number of clusters (dma_code) =        205        Root MSE        =     0.1148

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
    DHHI_HHI |
        1 0  |   .0012635   .0085321     0.15   0.882    -.0155588    .0180859
        1 4  |  -.0855162   .0002162  -395.45   0.000    -.0859426   -.0850899
        1 5  |  -.2104717   .0000513 -4102.15   0.000    -.2105729   -.2103706
        1 7  |  -.0478544   .0003378  -141.65   0.000    -.0485205   -.0471882
        1 8  |   .0070159   .0140785     0.50   0.619    -.0207422    .0347739
             |
 post_merger#|
    DHHI_HHI |
        1 0  |   .0345764   .0082866     4.17   0.000      .018238    .0509148
        1 4  |   .0271795   .0066645     4.08   0.000     .0140393    .0403197
        1 5  |    .069706    .006755    10.32   0.000     .0563874    .0830246
        1 7  |   .0279348   .0065434     4.27   0.000     .0150335    .0408361
        1 8  |   .0374734   .0213335     1.76   0.080     -.004589    .0795359
             |
    DHHI_HHI |
          4  |          0  (omitted)
          5  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
       trend |   -.001107    .000227    -4.88   0.000    -.0015546   -.0006594
       _cons |   1.884062   .0053263   353.73   0.000      1.87356    1.894563
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 117 singleton observations)
note: 1bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
note: 2bn.DHHI_HHI_NW is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 1 iterations)
note: 1.DHHI_HHI_NW omitted because of collinearity
note: 2.DHHI_HHI_NW omitted because of collinearity

HDFE Linear regression                            Number of obs   =    523,118
Absorbing 1 HDFE group                            F(   7,    204) =      37.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9355
                                                  Adj R-squared   =     0.9339
                                                  Within R-sq.    =     0.0082
Number of clusters (dma_code) =        205        Root MSE        =     0.1148

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g#|
 DHHI_HHI_NW |
        1 0  |   .0012489   .0085419     0.15   0.884    -.0155928    .0180905
        1 1  |  -.0407183    .008683    -4.69   0.000    -.0578382   -.0235985
        1 2  |   .0070159   .0140785     0.50   0.619     -.020742    .0347739
             |
 post_merger#|
 DHHI_HHI_NW |
        1 0  |   .0346438   .0082954     4.18   0.000     .0182881    .0509994
        1 1  |   .0210025   .0088886     2.36   0.019     .0034772    .0385277
        1 2  |   .0374745   .0213334     1.76   0.080    -.0045878    .0795368
             |
 DHHI_HHI_NW |
          1  |          0  (omitted)
          2  |          0  (omitted)
             |
       trend |  -.0011071    .000227    -4.88   0.000    -.0015547   -.0006594
       _cons |   1.884062   .0053256   353.78   0.000     1.873562    1.894562
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     12420       12420           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout

. 
. 
. est clear

. 
. 
. 
. 
. exit, STATA clear
