
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Sandbox/did_test2.do ../../
> ../All/m_1838188020_1/intermediate ../output/ quarter 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_1838188020_1/intermediate

. log using `2'/did_stata_`3', text replace
(note: file /projects/b1048/gillanes/Mergers/All/m_1838188020_1/intermediate/..
> /output//did_stata_quarter.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_1838188020_1/intermediate/.
> ./output//did_stata_quarter.log
  log type:  text
 opened on:  20 Aug 2020, 21:40:04

. 
. import delimited "stata_did_`3'.csv", encoding(ISO-8859-1)
(23 vars, 494,392 obs)

. 
. /*Install Packages*/
. 
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /* Fixed Effects */
. egen entity_effects = group(upc dma_code)

. egen time_effects = group(year `3') /* same goes for month*/

. egen time_calendar = group(`3') /* same goes for month*/

. 
. 
. /* WEIGHTING SCHEMES */
. gen pre_vol = volume * (1 - post_merger)

. gen weights_0 = 1 /*to add weights that won't change things*/

. egen weights_1 = total(pre_vol), by(upc)

. egen weights_2 = total(pre_vol), by(dma_code)

. egen weights_3 = total(pre_vol), by(upc dma_code)

. replace weights_1 = round(weights_1)
(0 real changes made)

. replace weights_2 = round(weights_2)
(0 real changes made)

. replace weights_3 = round(weights_3)
(0 real changes made)

. 
. /*Naive Variables*/
. gen np_dhhi = post_merger*dhhi

. gen np_HHI = post_merger*post_hhi

. 
. 
. 
. forval x = 0/3 {
  2. 
. * No Fixed-Effects
. reg lprice post_merger_merging post_merger trend [aw = weights_`x'], vce(clus
> ter dma_code)
  3. est sto NO_FE_`x'
  4. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> ") replace
  5. 
. * Product/Market Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> entity_effects) vce(cluster dma_code)
  6. est sto PM_FE_`x'
  7. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE") append
  8. 
. 
. * Product/Market and Time Fixed-Effects
. reghdfe lprice post_merger_merging [aw = weights_`x'], abs(entity_effects tim
> e_effects) vce(cluster dma_code)
  9. est sto PMT_FE_`x'
 10. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE") append
 11. 
. 
. * Calendar Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> time_calendar entity_effects) vce(cluster dma_code)
 12. est sto PMT_C_`x'
 13. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE") append
 14. 
. * Dma-Specific Time Trends
. reghdfe lprice post_merger_merging post_merger [aw = weights_`x'], abs(dma_co
> de##c.trend entity_effects) vce(cluster dma_code)
 15. est sto PMT_t_`x'
 16. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends") append
 17. 
. 
. *MAJOR*
. 
. * No Fixed-Effects, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend [aw = weig
> hts_`x'], vce(cluster dma_code)
 18. est sto NO_FE_M_`x'
 19. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Major") append
 20. 
. 
. * Product/market Fixed-Effects (Time Trend)
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(entity_effects) vce(cluster dma_code)
 21. est sto PM_FE_M_`x'
 22. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, Major") append
 23. 
. 
. * Product/market and Time Fixed-Effects
. reghdfe lprice post_merger_merging post_merger_major [aw = weights_`x'], abs(
> entity_effects time_effects) vce(cluster dma_code)
 24. est sto PMT_FE_M_`x'
 25. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major") append
 26. 
. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 27. est sto PMT_C_M_`x'
 28. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Major") append
 29. 
. reghdfe lprice post_merger_merging post_merger post_merger_major [aw = weight
> s_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
 30. est sto PMT_t_M_`x'
 31. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Major") append
 32. 
. /******************************/
. /******************************/
. /******************************/
. 
. *DHHI
. 
. * No Fixed-Effects, DHHI
. reg lprice post_merger_dhhi post_merger trend [aw = weights_`x'], vce(cluster
>  dma_code)
 33. est sto NO_FE_DHHI_`x'
 34. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , DHHI") append
 35. 
. * Product/market Fixed-Effects, DHHI
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(ent
> ity_effects) vce(cluster dma_code)
 36. est sto PM_FE_DHHI_`x'
 37. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, DHHI") append
 38. 
. *Product/market and Time Fixed-Effects, DHHI.
. reghdfe lprice post_merger_dhhi [aw = weights_`x'], abs(entity_effects time_e
> ffects) vce(cluster dma_code)
 39. est sto PMT_FE_DHHHI_`x'
 40. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major") append
 41. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(tim
> e_calendar entity_effects) vce(cluster dma_code)
 42. est sto PMT_C_DHHI_`x'
 43. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, DHHI") append
 44. 
. reghdfe lprice post_merger_dhhi post_merger [aw = weights_`x'], abs(dma_code#
> #c.trend entity_effects) vce(cluster dma_code)
 45. est sto PMT_t_DHHI_`x'
 46. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, DHHI") append
 47. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. *NAIVE SPECIFICATIONS
. 
. 
. *No FE
. 
. *No Fixed-Effects naive DHHI and post-HHI
. reg lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`x'],
>  vce(cluster dma_code)
 48. est sto np_D_H_`x'
 49. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive DHHI & post HHI") append
 50. 
. *No Fixed-Effects naive post-HHI
. reg lprice post_merger post_hhi  np_HHI trend [aw = weights_`x'], vce(cluster
>  dma_code)
 51. est sto np_H_`x'
 52. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive post HHI") append
 53. 
. *No Fixed-Effects naive DHHI
. reg lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], vce(cluster dma
> _code)
 54. est sto np_D_`x'
 55. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive DHHI") append
 56. 
. *Product/market FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI trend [aw = weights_`x'], abs(entit
> y_effects) vce(cluster dma_code)
 57. est sto PM_FE_np_D_H_`x'
 58. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI & post HHI") append
 59. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice post_merger np_HHI trend [aw = weights_`x'], abs(entity_effect
> s) vce(cluster dma_code)
 60. est sto PM_FE_np_H_`x'
 61. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive post HHI") append
 62. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice post_merger np_dhhi trend [aw = weights_`x'], abs(entity_effec
> ts) vce(cluster dma_code)
 63. est sto PM_FE_np_D_`x'
 64. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI") append
 65. 
. *Product/Market and Time FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice np_dhhi np_HHI [aw = weights_`x'], abs(entity_effects time_eff
> ects) vce(cluster dma_code)
 66. est sto PMT_FE_np_D_H_`x'
 67. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI & post HHI") append
 68. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice np_HHI [aw = weights_`x'], abs(entity_effects time_effects) vc
> e(cluster dma_code)
 69. est sto PMT_FE_np_H_`x'
 70. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive post HHI") append
 71. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice np_dhhi [aw = weights_`x'], abs(entity_effects time_effects) v
> ce(cluster dma_code)
 72. est sto PMT_FE_np_D_`x'
 73. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI") append
 74. 
. 
. /******************************/
. 
. *Calendar Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`
> x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 75. est sto PMT_FE_t_np_D_H_`x'
 76. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive DHHI & post HHI") append
 77. 
. *DMA-trends, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI [aw = weights_`x'], abs(dma_code##c
> .trend entity_effects) vce(cluster dma_code)
 78. est sto PMT_FE_t_np_D_H_`x'
 79. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive DHHI & post HHI") append
 80. 
. *Calendar Fixed-Effects, naive post-HHI
. reghdfe lprice post_hhi post_merger np_HHI trend [aw = weights_`x'], abs(time
> _calendar entity_effects) vce(cluster dma_code)
 81. est sto PMT_FE_t_np_H_`x'
 82. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive post HHI") append
 83. 
. *DMA-trends, naive post-HHI
. reghdfe lprice post_merger np_HHI [aw = weights_`x'], abs(dma_code##c.trend e
> ntity_effects) vce(cluster dma_code)
 84. est sto PMT_FE_t_np_H_`x'
 85. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive post HHI") append
 86. 
. *Calendar Fixed-Effects, naive DHHI
. reghdfe lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], abs(time_ca
> lendar entity_effects) vce(cluster dma_code)
 87. est sto PMT_FE_t_np_D_`x'
 88. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive DHHI") append
 89. 
. *DMA-trends, naive DHHI
. reghdfe lprice post_merger np_dhhi [aw = weights_`x'], abs(dma_code##c.trend 
> entity_effects) vce(cluster dma_code)
 90. est sto PMT_FE_t_np_D_`x'
 91. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive DHHI") append
 92. 
. 
. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. 
. 
. * No Fixed-Effects, Demographics
. reg lprice post_merger_merging post_merger log_hhinc_per_person_adj trend [aw
>  = weights_`x'], vce(cluster dma_code)
 93. est sto NO_FE_d_`x'
 94. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Demographics") append
 95. 
. * Product/market Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 96. *note: this one  seemed to have both Time F-E and Time-Trends*
. est sto PM_FE_d_`x'
 97. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Demographics") append
 98. 
. * Product/market and Time Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging log_hhinc_per_person_adj [aw = weights_`x'
> ], abs(entity_effects time_effects) vce(cluster dma_code)
 99. est sto PMT_FE_d_`x'
100. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Demographics") append
101. 
. 
. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
102. est sto PMT_C_d_`x'
103. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Demographics") append
104. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj [aw =
>  weights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
105. est sto PMT_t_d_`x'
106. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Demographics") append
107. 
. 
. 
. * No Fixed-Effects, Demographics, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend log_hhinc_
> per_person_adj [aw = weights_`x'], vce(cluster dma_code)
108. est sto NO_FE_d_M_`x'
109. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Major, Demographics") append
110. 
. *Products/market Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger post_merger_major trend log_hh
> inc_per_person_adj [aw = weights_`x'], abs(entity_effects) vce(cluster dma_co
> de)
111. est sto PM_FE_d_M_`x'
112. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, Major, Demographics") append
113. 
. *Products/market and Time Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger_major log_hhinc_per_person_adj
>  [aw = weights_`x'], abs(entity_effects time_effects) vce(cluster dma_code)
114. est sto PMT_FE_d_M_`x'
115. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major, Demographics") append
116. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj trend [aw = weights_`x'], abs(time_calendar entity_effects) vce(
> cluster dma_code)
117. est sto PMT_C_d_M_`x'
118. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Major, Demographics") append
119. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj [aw = weights_`x'], abs(dma_code##c.trend entity_effects) vce(cl
> uster dma_code)
120. est sto PMT_t_d_M_`x'
121. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Major, Demographics") append
122. 
. /******************************/
. /******************************/
. /******************************/
. 
. *No Fixed-Effects, DHHI, Demographics
. reg lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [aw = 
> weights_`x'], vce(cluster dma_code)
123. est sto NO_FE_DHHI_d_`x'
124. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , DHHI, Demographics") append
125. 
. *Product/market Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(entity_effects) vce(cluster dma_code)
126. est sto PM_FE_DHHI_d_`x'
127. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, DHHI, Demographics") append
128. 
. *Product/market and Time Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi log_hhinc_per_person_adj [aw = weights_`x'], 
> abs(entity_effects time_effects) vce(cluster dma_code)
129. est sto PMT_FE_DHHI_d_`x'
130. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, DHHI, Demographics") append
131. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
132. est sto PMT_C_d_D_`x'
133. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, DHHI, Demographics") append
134. 
. reghdfe lprice post_merger_dhhi post_merger log_hhinc_per_person_adj [aw = we
> ights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
135. est sto PMT_t_d_D_`x'
136. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, DHHI, Demographics") append
137. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. est clear
138. 
. 
. }
(sum of wgt is   4.9439e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     493.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0652
                                                Root MSE          =     .23444

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0484144   .0055221    -8.77   0.000     -.059302   -.0375267
       trend |   .0198741    .000633    31.39   0.000     .0186259    .0211222
       _cons |  -1.750677   .0132134  -132.49   0.000    -1.776729   -1.724624
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     540.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2745
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0475532   .0055826    -8.52   0.000    -.0585602   -.0365461
       trend |   .0195485   .0005947    32.87   0.000     .0183759    .0207211
       _cons |  -1.749265   .0046238  -378.32   0.000    -1.758381   -1.740148
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8653
                                                  Adj R-squared   =     0.8539
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |  -1.652878   5.30e-18 -3.1e+17   0.000    -1.652878   -1.652878
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     537.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8327
                                                  Within R-sq.    =     0.2773
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0485631   .0059595    -8.15   0.000    -.0603133    -.036813
       trend |   .0195424   .0005963    32.77   0.000     .0183667    .0207181
       _cons |  -1.748575   .0046864  -373.12   0.000    -1.757815   -1.739335
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      70.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8672
                                                  Adj R-squared   =     0.8558
                                                  Within R-sq.    =     0.0194
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.046872   .0055918    -8.38   0.000    -.0578972   -.0358468
       _cons |  -1.622688   .0036016  -450.54   0.000    -1.629789   -1.615587
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.9439e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     331.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0656
                                                Root MSE          =     .23439

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0541723   .0056969    -9.51   0.000    -.0654046     -.04294
post_merg~or |   .0119304   .0030481     3.91   0.000     .0059205    .0179403
       trend |   .0198746   .0006318    31.46   0.000     .0186289    .0211202
       _cons |  -1.750678   .0132112  -132.51   0.000    -1.776726    -1.72463
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     372.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2746
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0501621    .005457    -9.19   0.000    -.0609213   -.0394028
post_merg~or |   .0054047   .0018025     3.00   0.003     .0018509    .0089586
       trend |   .0195552   .0005944    32.90   0.000     .0183832    .0207272
       _cons |  -1.749305   .0046257  -378.17   0.000    -1.758426   -1.740185
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      10.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0014
                                                  R-squared       =     0.8654
                                                  Adj R-squared   =     0.8540
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0058535   .0018078     3.24   0.001     .0022891    .0094179
       _cons |  -1.654695   .0005611 -2949.18   0.000    -1.655801   -1.653588
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     372.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8328
                                                  Within R-sq.    =     0.2774
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0512472   .0058154    -8.81   0.000    -.0627133   -.0397811
post_merg~or |   .0055609    .001805     3.08   0.002     .0020019    .0091198
       trend |   .0195493    .000596    32.80   0.000     .0183742    .0207243
       _cons |  -1.748616   .0046885  -372.96   0.000    -1.757861   -1.739372
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      48.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8672
                                                  Adj R-squared   =     0.8559
                                                  Within R-sq.    =     0.0197
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0498409   .0055085    -9.05   0.000    -.0607018   -.0389801
post_merg~or |   .0061439   .0016962     3.62   0.000     .0027995    .0094883
       _cons |  -1.622683   .0036002  -450.72   0.000    -1.629781   -1.615584
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.9439e+05)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     493.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0652
                                                Root MSE          =     .23444

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0484144   .0055221    -8.77   0.000     -.059302   -.0375267
       trend |   .0198741    .000633    31.39   0.000     .0186259    .0211222
       _cons |  -1.750677   .0132134  -132.49   0.000    -1.776729   -1.724624
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     540.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2745
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0475532   .0055826    -8.52   0.000    -.0585602   -.0365461
       trend |   .0195485   .0005947    32.87   0.000     .0183759    .0207211
       _cons |  -1.749265   .0046238  -378.32   0.000    -1.758381   -1.740148
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8653
                                                  Adj R-squared   =     0.8539
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |  -1.652878   5.30e-18 -3.1e+17   0.000    -1.652878   -1.652878
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     537.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8327
                                                  Within R-sq.    =     0.2773
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0485631   .0059595    -8.15   0.000    -.0603133    -.036813
       trend |   .0195424   .0005963    32.77   0.000     .0183667    .0207181
       _cons |  -1.748575   .0046864  -373.12   0.000    -1.757815   -1.739335
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      70.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8672
                                                  Adj R-squared   =     0.8558
                                                  Within R-sq.    =     0.0194
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   -.046872   .0055918    -8.38   0.000    -.0578972   -.0358468
       _cons |  -1.622688   .0036016  -450.54   0.000    -1.629789   -1.615587
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.9439e+05)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     253.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0709
                                                Root MSE          =     .23372

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1366657   .0431118    -3.17   0.002    -.2216676   -.0516639
    post_hhi |   .1449241   .1789062     0.81   0.419    -.2078182    .4976663
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .1544948   .0796148     1.94   0.054    -.0024785    .3114681
       trend |   .0199393   .0006305    31.62   0.000     .0186962    .0211825
       _cons |   -1.83339   .1051744   -17.43   0.000    -2.040758   -1.626022
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   4.9439e+05)

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     253.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0709
                                                Root MSE          =     .23372

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1366657   .0431118    -3.17   0.002    -.2216676   -.0516639
    post_hhi |   .1449241   .1789062     0.81   0.419    -.2078182    .4976663
      np_HHI |   .1544948   .0796148     1.94   0.054    -.0024785    .3114681
       trend |   .0199393   .0006305    31.62   0.000     .0186962    .0211825
       _cons |   -1.83339   .1051744   -17.43   0.000    -2.040758   -1.626022
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   4.9439e+05)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     493.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0652
                                                Root MSE          =     .23444

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0484144   .0055221    -8.77   0.000     -.059302   -.0375267
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0198741    .000633    31.39   0.000     .0186259    .0211222
       _cons |  -1.750677   .0132134  -132.49   0.000    -1.776729   -1.724624
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     362.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8404
                                                  Adj R-squared   =     0.8268
                                                  Within R-sq.    =     0.2773
Number of clusters (dma_code) =        205        Root MSE        =     0.1008

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1495276    .041086    -3.64   0.000    -.2305354   -.0685199
     np_dhhi |          0  (omitted)
      np_HHI |   .1787903   .0764597     2.34   0.020     .0280377    .3295429
       trend |   .0195767    .000595    32.90   0.000     .0184036    .0207498
       _cons |  -1.749297   .0046079  -379.63   0.000    -1.758382   -1.740211
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     362.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8404
                                                  Adj R-squared   =     0.8268
                                                  Within R-sq.    =     0.2773
Number of clusters (dma_code) =        205        Root MSE        =     0.1008

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1495276    .041086    -3.64   0.000    -.2305354   -.0685199
      np_HHI |   .1787903   .0764597     2.34   0.020     .0280377    .3295429
       trend |   .0195767    .000595    32.90   0.000     .0184036    .0207498
       _cons |  -1.749297   .0046079  -379.63   0.000    -1.758382   -1.740211
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     540.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2745
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0475532   .0055826    -8.52   0.000    -.0585602   -.0365461
     np_dhhi |          0  (omitted)
       trend |   .0195485   .0005947    32.87   0.000     .0183759    .0207211
       _cons |  -1.749265   .0046238  -378.32   0.000    -1.758381   -1.740148
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       5.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0202
                                                  R-squared       =     0.8660
                                                  Adj R-squared   =     0.8546
                                                  Within R-sq.    =     0.0047
Number of clusters (dma_code) =        205        Root MSE        =     0.0924

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |   .1798701    .076836     2.34   0.020     .0283756    .3313646
       _cons |  -1.718803   .0281617   -61.03   0.000    -1.774328   -1.663278
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       5.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0202
                                                  R-squared       =     0.8660
                                                  Adj R-squared   =     0.8546
                                                  Within R-sq.    =     0.0047
Number of clusters (dma_code) =        205        Root MSE        =     0.0924

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   .1798701    .076836     2.34   0.020     .0283756    .3313646
       _cons |  -1.718803   .0281617   -61.03   0.000    -1.774328   -1.663278
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8653
                                                  Adj R-squared   =     0.8539
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |  -1.652878   5.30e-18 -3.1e+17   0.000    -1.652878   -1.652878
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     359.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8464
                                                  Adj R-squared   =     0.8334
                                                  Within R-sq.    =     0.2802
Number of clusters (dma_code) =        205        Root MSE        =     0.0989

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1504797   .0409384    -3.68   0.000    -.2311963   -.0697631
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .1786873   .0765796     2.33   0.021     .0276983    .3296763
       trend |   .0195705   .0005962    32.82   0.000     .0183949     .020746
       _cons |  -1.748605   .0046677  -374.62   0.000    -1.757809   -1.739402
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      79.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8678
                                                  Adj R-squared   =     0.8564
                                                  Within R-sq.    =     0.0235
Number of clusters (dma_code) =        205        Root MSE        =     0.0918

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.2191307   .0385332    -5.69   0.000     -.295105   -.1431564
     np_dhhi |          0  (omitted)
      np_HHI |   .3024276   .0713924     4.24   0.000      .161666    .4431891
       _cons |  -1.622582   .0034643  -468.37   0.000    -1.629413   -1.615752
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     359.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8464
                                                  Adj R-squared   =     0.8334
                                                  Within R-sq.    =     0.2802
Number of clusters (dma_code) =        205        Root MSE        =     0.0989

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.1504797   .0409384    -3.68   0.000    -.2311963   -.0697631
      np_HHI |   .1786873   .0765796     2.33   0.021     .0276983    .3296763
       trend |   .0195705   .0005962    32.82   0.000     .0183949     .020746
       _cons |  -1.748605   .0046677  -374.62   0.000    -1.757809   -1.739402
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      79.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8678
                                                  Adj R-squared   =     0.8564
                                                  Within R-sq.    =     0.0235
Number of clusters (dma_code) =        205        Root MSE        =     0.0918

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.2191307   .0385332    -5.69   0.000     -.295105   -.1431564
      np_HHI |   .3024276   .0713924     4.24   0.000      .161666    .4431891
       _cons |  -1.622582   .0034643  -468.37   0.000    -1.629413   -1.615752
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     537.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8327
                                                  Within R-sq.    =     0.2773
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0485631   .0059595    -8.15   0.000    -.0603133    -.036813
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0195424   .0005963    32.77   0.000     .0183667    .0207181
       _cons |  -1.748575   .0046864  -373.12   0.000    -1.757815   -1.739335
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      70.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8672
                                                  Adj R-squared   =     0.8558
                                                  Within R-sq.    =     0.0194
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   -.046872   .0055918    -8.38   0.000    -.0578972   -.0358468
     np_dhhi |          0  (omitted)
       _cons |  -1.622688   .0036016  -450.54   0.000    -1.629789   -1.615587
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.9439e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     297.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0832
                                                Root MSE          =     .23218

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0516093   .0059487    -8.68   0.000    -.0633381   -.0398805
log_hhinc_~j |    .159432   .0450465     3.54   0.000     .0706155    .2482486
       trend |   .0202825   .0006811    29.78   0.000     .0189396    .0216255
       _cons |  -3.377011   .4582882    -7.37   0.000      -4.2806   -2.473422
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     359.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2746
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0473107   .0056154    -8.43   0.000    -.0583823   -.0362391
log_hhinc_~j |  -.0127358   .0199968    -0.64   0.525    -.0521628    .0266912
       trend |   .0195187   .0005961    32.74   0.000     .0183433     .020694
       _cons |  -1.619359   .2036738    -7.95   0.000    -2.020934   -1.217783
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.04
Statistics robust to heteroskedasticity           Prob > F        =     0.8461
                                                  R-squared       =     0.8653
                                                  Adj R-squared   =     0.8539
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |  -.0034438   .0177165    -0.19   0.846    -.0383747    .0314871
       _cons |  -1.617761   .1806565    -8.95   0.000    -1.973954   -1.261568
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     357.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8328
                                                  Within R-sq.    =     0.2774
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0482259    .006022    -8.01   0.000    -.0600993   -.0363524
log_hhinc_~j |  -.0119203   .0196378    -0.61   0.545    -.0506393    .0267988
       trend |   .0195047   .0005976    32.64   0.000     .0183265    .0206829
       _cons |  -1.626995   .1998888    -8.14   0.000    -2.021108   -1.232882
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      36.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8673
                                                  Adj R-squared   =     0.8559
                                                  Within R-sq.    =     0.0198
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0465059   .0056277    -8.26   0.000    -.0576018   -.0354099
log_hhinc_~j |  -.0196491   .0193259    -1.02   0.310    -.0577533     .018455
       _cons |  -1.422559   .1965401    -7.24   0.000     -1.81007   -1.035049
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.9439e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     225.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0836
                                                Root MSE          =     .23213

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0572347   .0060922    -9.39   0.000    -.0692465    -.045223
post_merg~or |   .0116592   .0030453     3.83   0.000     .0056548    .0176635
       trend |   .0202829     .00068    29.83   0.000     .0189422    .0216235
log_hhinc_~j |   .1593552   .0450394     3.54   0.000     .0705527    .2481576
       _cons |  -3.376228   .4582142    -7.37   0.000    -4.279671   -2.472785
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   4,    204) =     279.10
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2747
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0499171   .0054884    -9.10   0.000    -.0607384   -.0390958
post_merg~or |   .0053991   .0018037     2.99   0.003     .0018428    .0089553
       trend |   .0195254   .0005958    32.77   0.000     .0183506    .0207002
log_hhinc_~j |  -.0127244   .0199992    -0.64   0.525    -.0521561    .0267072
       _cons |  -1.619515   .2036976    -7.95   0.000    -2.021138   -1.217893
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =       5.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0060
                                                  R-squared       =     0.8654
                                                  Adj R-squared   =     0.8540
                                                  Within R-sq.    =     0.0003
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0058519   .0018077     3.24   0.001     .0022878    .0094161
log_hhinc_~j |  -.0034307   .0177175    -0.19   0.847    -.0383637    .0315022
       _cons |   -1.61971   .1806364    -8.97   0.000    -1.975864   -1.263557
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   4,    204) =     278.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8459
                                                  Adj R-squared   =     0.8328
                                                  Within R-sq.    =     0.2776
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0509077    .005877    -8.66   0.000    -.0624951   -.0393203
post_merg~or |   .0055556   .0018061     3.08   0.002     .0019946    .0091167
log_hhinc_~j |  -.0119086   .0196401    -0.61   0.545    -.0506322    .0268149
       trend |   .0195116   .0005972    32.67   0.000     .0183341    .0206892
       _cons |  -1.627155   .1999122    -8.14   0.000    -2.021314   -1.232996
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =      33.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8673
                                                  Adj R-squared   =     0.8559
                                                  Within R-sq.    =     0.0201
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0494758   .0055411    -8.93   0.000     -.060401   -.0385507
post_merg~or |   .0061462   .0016962     3.62   0.000     .0028019    .0094906
log_hhinc_~j |  -.0196538   .0193274    -1.02   0.310    -.0577608    .0184533
       _cons |  -1.422507   .1965547    -7.24   0.000    -1.810046   -1.034968
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.9439e+05)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     297.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0832
                                                Root MSE          =     .23218

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0516093   .0059487    -8.68   0.000    -.0633381   -.0398805
       trend |   .0202825   .0006811    29.78   0.000     .0189396    .0216255
log_hhinc_~j |    .159432   .0450465     3.54   0.000     .0706155    .2482486
       _cons |  -3.377011   .4582882    -7.37   0.000      -4.2806   -2.473422
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     359.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2746
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0473107   .0056154    -8.43   0.000    -.0583823   -.0362391
       trend |   .0195187   .0005961    32.74   0.000     .0183433     .020694
log_hhinc_~j |  -.0127358   .0199968    -0.64   0.525    -.0521628    .0266912
       _cons |  -1.619359   .2036738    -7.95   0.000    -2.020934   -1.217783
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.04
Statistics robust to heteroskedasticity           Prob > F        =     0.8461
                                                  R-squared       =     0.8653
                                                  Adj R-squared   =     0.8539
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |  -.0034438   .0177165    -0.19   0.846    -.0383747    .0314871
       _cons |  -1.617761   .1806565    -8.95   0.000    -1.973954   -1.261568
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     357.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8328
                                                  Within R-sq.    =     0.2774
Number of clusters (dma_code) =        205        Root MSE        =     0.0991

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0482259    .006022    -8.01   0.000    -.0600993   -.0363524
       trend |   .0195047   .0005976    32.64   0.000     .0183265    .0206829
log_hhinc_~j |  -.0119203   .0196378    -0.61   0.545    -.0506393    .0267988
       _cons |  -1.626995   .1998888    -8.14   0.000    -2.021108   -1.232882
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      36.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8673
                                                  Adj R-squared   =     0.8559
                                                  Within R-sq.    =     0.0198
Number of clusters (dma_code) =        205        Root MSE        =     0.0920

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0465059   .0056277    -8.26   0.000    -.0576018   -.0354099
log_hhinc_~j |  -.0196491   .0193259    -1.02   0.310    -.0577533     .018455
       _cons |  -1.422559   .1965401    -7.24   0.000     -1.81007   -1.035049
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     351.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0669
                                                Root MSE          =     .21347

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0506848   .0056184    -9.02   0.000    -.0617624   -.0396073
       trend |   .0189029   .0007156    26.42   0.000      .017492    .0203137
       _cons |  -1.733055   .0127984  -135.41   0.000    -1.758289   -1.707821
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     498.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2964
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.052681   .0056592    -9.31   0.000    -.0638391    -.041523
       trend |   .0194601   .0006177    31.50   0.000     .0182422    .0206781
       _cons |  -1.735425   .0047185  -367.79   0.000    -1.744729   -1.726122
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |  -1.643846   6.06e-19 -2.7e+18   0.000    -1.643846   -1.643846
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     508.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8322
                                                  Within R-sq.    =     0.3027
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0552571   .0060131    -9.19   0.000     -.067113   -.0434013
       trend |   .0196009   .0006154    31.85   0.000     .0183874    .0208144
       _cons |  -1.734686   .0047867  -362.40   0.000    -1.744124   -1.725249
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      82.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8718
                                                  Adj R-squared   =     0.8608
                                                  Within R-sq.    =     0.0290
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0514822   .0056563    -9.10   0.000    -.0626345   -.0403299
       _cons |  -1.610976   .0036114  -446.08   0.000    -1.618096   -1.603855
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     259.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0670
                                                Root MSE          =     .21346

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0460263   .0061449    -7.49   0.000    -.0581419   -.0339107
post_merg~or |  -.0066344   .0028681    -2.31   0.022    -.0122894   -.0009793
       trend |   .0188992   .0007167    26.37   0.000      .017486    .0203124
       _cons |  -1.733047   .0128004  -135.39   0.000    -1.758285   -1.707809
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     335.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2964
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0518001   .0054904    -9.43   0.000    -.0626254   -.0409748
post_merg~or |  -.0012554   .0019595    -0.64   0.522    -.0051189    .0026081
       trend |   .0194594   .0006178    31.50   0.000     .0182413    .0206776
       _cons |  -1.735424   .0047191  -367.74   0.000    -1.744728   -1.726119
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.22
Statistics robust to heteroskedasticity           Prob > F        =     0.6372
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0009284   .0019657    -0.47   0.637    -.0048041    .0029473
       _cons |  -1.643432   .0008764 -1875.27   0.000     -1.64516   -1.641704
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     340.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8322
                                                  Within R-sq.    =     0.3027
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.054426   .0058058    -9.37   0.000     -.065873   -.0429789
post_merg~or |  -.0011842    .001964    -0.60   0.547    -.0050566    .0026881
       trend |   .0196002   .0006155    31.84   0.000     .0183866    .0208138
       _cons |  -1.734685   .0047873  -362.35   0.000    -1.744124   -1.725246
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      42.40
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8718
                                                  Adj R-squared   =     0.8608
                                                  Within R-sq.    =     0.0290
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0509549   .0055502    -9.18   0.000     -.061898   -.0400118
post_merg~or |  -.0007504   .0018479    -0.41   0.685    -.0043939     .002893
       _cons |  -1.610978   .0036105  -446.19   0.000    -1.618097   -1.603859
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     351.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0669
                                                Root MSE          =     .21347

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0506848   .0056184    -9.02   0.000    -.0617624   -.0396073
       trend |   .0189029   .0007156    26.42   0.000      .017492    .0203137
       _cons |  -1.733055   .0127984  -135.41   0.000    -1.758289   -1.707821
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     498.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2964
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   -.052681   .0056592    -9.31   0.000    -.0638391    -.041523
       trend |   .0194601   .0006177    31.50   0.000     .0182422    .0206781
       _cons |  -1.735425   .0047185  -367.79   0.000    -1.744729   -1.726122
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |  -1.643846   6.06e-19 -2.7e+18   0.000    -1.643846   -1.643846
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     508.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8322
                                                  Within R-sq.    =     0.3027
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0552571   .0060131    -9.19   0.000     -.067113   -.0434013
       trend |   .0196009   .0006154    31.85   0.000     .0183874    .0208144
       _cons |  -1.734686   .0047867  -362.40   0.000    -1.744124   -1.725249
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      82.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8718
                                                  Adj R-squared   =     0.8608
                                                  Within R-sq.    =     0.0290
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0514822   .0056563    -9.10   0.000    -.0626345   -.0403299
       _cons |  -1.610976   .0036114  -446.08   0.000    -1.618096   -1.603855
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     185.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0727
                                                Root MSE          =     .21281

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1551231   .0454453    -3.41   0.001    -.2447258   -.0655205
    post_hhi |   .1010467   .1752316     0.58   0.565    -.2444505     .446544
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .1823806    .083543     2.18   0.030     .0176622    .3470991
       trend |   .0190329   .0007073    26.91   0.000     .0176384    .0204275
       _cons |  -1.790985   .1026887   -17.44   0.000    -1.993452   -1.588517
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.8185e+13)

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     185.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0727
                                                Root MSE          =     .21281

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1551231   .0454453    -3.41   0.001    -.2447258   -.0655205
    post_hhi |   .1010467   .1752316     0.58   0.565    -.2444505     .446544
      np_HHI |   .1823806    .083543     2.18   0.030     .0176622    .3470991
       trend |   .0190329   .0007073    26.91   0.000     .0176384    .0204275
       _cons |  -1.790985   .1026887   -17.44   0.000    -1.993452   -1.588517
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.8185e+13)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     351.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0669
                                                Root MSE          =     .21347

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0506848   .0056184    -9.02   0.000    -.0617624   -.0396073
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0189029   .0007156    26.42   0.000      .017492    .0203137
       _cons |  -1.733055   .0127984  -135.41   0.000    -1.758289   -1.707821
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     335.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8381
                                                  Adj R-squared   =     0.8244
                                                  Within R-sq.    =     0.3013
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1774425   .0415525    -4.27   0.000    -.2593698   -.0955151
     np_dhhi |          0  (omitted)
      np_HHI |   .2183591   .0773551     2.82   0.005     .0658411    .3708772
       trend |   .0195045   .0006182    31.55   0.000     .0182856    .0207234
       _cons |  -1.735351   .0046549  -372.80   0.000    -1.744529   -1.726173
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     335.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8381
                                                  Adj R-squared   =     0.8244
                                                  Within R-sq.    =     0.3013
Number of clusters (dma_code) =        205        Root MSE        =     0.0926

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1774425   .0415525    -4.27   0.000    -.2593698   -.0955151
      np_HHI |   .2183591   .0773551     2.82   0.005     .0658411    .3708772
       trend |   .0195045   .0006182    31.55   0.000     .0182856    .0207234
       _cons |  -1.735351   .0046549  -372.80   0.000    -1.744529   -1.726173
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     498.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2964
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   -.052681   .0056592    -9.31   0.000    -.0638391    -.041523
     np_dhhi |          0  (omitted)
       trend |   .0194601   .0006177    31.50   0.000     .0182422    .0206781
       _cons |  -1.735425   .0047185  -367.79   0.000    -1.744729   -1.726122
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       8.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0048
                                                  R-squared       =     0.8734
                                                  Adj R-squared   =     0.8626
                                                  Within R-sq.    =     0.0092
Number of clusters (dma_code) =        205        Root MSE        =     0.0819

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |   .2220846   .0779457     2.85   0.005     .0684021     .375767
       _cons |  -1.724496   .0283059   -60.92   0.000    -1.780305   -1.668686
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       8.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0048
                                                  R-squared       =     0.8734
                                                  Adj R-squared   =     0.8626
                                                  Within R-sq.    =     0.0092
Number of clusters (dma_code) =        205        Root MSE        =     0.0819

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   .2220846   .0779457     2.85   0.005     .0684021     .375767
       _cons |  -1.724496   .0283059   -60.92   0.000    -1.780305   -1.668686
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |  -1.643846   6.06e-19 -2.7e+18   0.000    -1.643846   -1.643846
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     342.53
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8465
                                                  Adj R-squared   =     0.8335
                                                  Within R-sq.    =     0.3079
Number of clusters (dma_code) =        205        Root MSE        =     0.0901

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1803635   .0414577    -4.35   0.000     -.262104   -.0986229
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |    .218948   .0775461     2.82   0.005     .0660534    .3718426
       trend |    .019646   .0006156    31.91   0.000     .0184322    .0208598
       _cons |  -1.734611   .0047189  -367.59   0.000    -1.743915   -1.725307
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      93.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8724
                                                  Adj R-squared   =     0.8615
                                                  Within R-sq.    =     0.0336
Number of clusters (dma_code) =        205        Root MSE        =     0.0822

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.2153482   .0378085    -5.70   0.000    -.2898937   -.1408027
     np_dhhi |          0  (omitted)
      np_HHI |   .2875626   .0705403     4.08   0.000     .1484812    .4266441
       _cons |  -1.610781   .0034744  -463.62   0.000    -1.617631    -1.60393
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     342.53
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8465
                                                  Adj R-squared   =     0.8335
                                                  Within R-sq.    =     0.3079
Number of clusters (dma_code) =        205        Root MSE        =     0.0901

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.1803635   .0414577    -4.35   0.000     -.262104   -.0986229
      np_HHI |    .218948   .0775461     2.82   0.005     .0660534    .3718426
       trend |    .019646   .0006156    31.91   0.000     .0184322    .0208598
       _cons |  -1.734611   .0047189  -367.59   0.000    -1.743915   -1.725307
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      93.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8724
                                                  Adj R-squared   =     0.8615
                                                  Within R-sq.    =     0.0336
Number of clusters (dma_code) =        205        Root MSE        =     0.0822

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.2153482   .0378085    -5.70   0.000    -.2898937   -.1408027
      np_HHI |   .2875626   .0705403     4.08   0.000     .1484812    .4266441
       _cons |  -1.610781   .0034744  -463.62   0.000    -1.617631    -1.60393
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     508.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8322
                                                  Within R-sq.    =     0.3027
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0552571   .0060131    -9.19   0.000     -.067113   -.0434013
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0196009   .0006154    31.85   0.000     .0183874    .0208144
       _cons |  -1.734686   .0047867  -362.40   0.000    -1.744124   -1.725249
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      82.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8718
                                                  Adj R-squared   =     0.8608
                                                  Within R-sq.    =     0.0290
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0514822   .0056563    -9.10   0.000    -.0626345   -.0403299
     np_dhhi |          0  (omitted)
       _cons |  -1.610976   .0036114  -446.08   0.000    -1.618096   -1.603855
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     214.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0871
                                                Root MSE          =     .21115

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.053512   .0059843    -8.94   0.000     -.065311    -.041713
log_hhinc_~j |    .153936   .0445582     3.45   0.001     .0660824    .2417897
       trend |   .0192732   .0007622    25.29   0.000     .0177704     .020776
       _cons |  -3.303028   .4532286    -7.29   0.000    -4.196641   -2.409415
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     331.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2966
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0524482   .0056951    -9.21   0.000    -.0636771   -.0412193
log_hhinc_~j |  -.0126117   .0210659    -0.60   0.550    -.0541466    .0289231
       trend |   .0194314    .000619    31.39   0.000      .018211    .0206518
       _cons |  -1.606811   .2145337    -7.49   0.000    -2.029798   -1.183823
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.01
Statistics robust to heteroskedasticity           Prob > F        =     0.9193
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |  -.0018618   .0183528    -0.10   0.919    -.0380472    .0343237
       _cons |  -1.624865   .1871091    -8.68   0.000     -1.99378   -1.255949
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     338.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8323
                                                  Within R-sq.    =     0.3028
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0549513   .0060808    -9.04   0.000    -.0669405    -.042962
log_hhinc_~j |  -.0110309   .0206292    -0.53   0.593    -.0517047    .0296428
       trend |   .0195666   .0006165    31.74   0.000      .018351    .0207822
       _cons |  -1.622199    .209953    -7.73   0.000    -2.036155   -1.208243
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      43.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8719
                                                  Adj R-squared   =     0.8609
                                                  Within R-sq.    =     0.0296
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0511069   .0056979    -8.97   0.000    -.0623412   -.0398727
log_hhinc_~j |  -.0209951   .0207504    -1.01   0.313    -.0619077    .0199176
       _cons |  -1.397168   .2110079    -6.62   0.000    -1.813204   -.9811316
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     177.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0872
                                                Root MSE          =     .21113

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0489324   .0064891    -7.54   0.000    -.0617267    -.036138
post_merg~or |  -.0065216   .0028739    -2.27   0.024    -.0121879   -.0008553
       trend |   .0192696   .0007634    25.24   0.000     .0177645    .0207747
log_hhinc_~j |   .1539206   .0445608     3.45   0.001     .0660618    .2417793
       _cons |  -3.302863   .4532556    -7.29   0.000     -4.19653   -2.409197
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   4,    204) =     250.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2966
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0515637    .005518    -9.34   0.000    -.0624432   -.0406842
post_merg~or |  -.0012606   .0019602    -0.64   0.521    -.0051255    .0026044
       trend |   .0194307   .0006191    31.39   0.000     .0182101    .0206513
log_hhinc_~j |  -.0126138   .0210657    -0.60   0.550    -.0541483    .0289206
       _cons |  -1.606788   .2145317    -7.49   0.000    -2.029772   -1.183804
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =       0.12
Statistics robust to heteroskedasticity           Prob > F        =     0.8839
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0009293   .0019649    -0.47   0.637    -.0048034    .0029447
log_hhinc_~j |  -.0018637   .0183524    -0.10   0.919    -.0380484    .0343209
       _cons |   -1.62443   .1870148    -8.69   0.000     -1.99316     -1.2557
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   4,    204) =     255.22
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8323
                                                  Within R-sq.    =     0.3029
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0541166   .0058647    -9.23   0.000    -.0656798   -.0425534
post_merg~or |  -.0011891   .0019645    -0.61   0.546    -.0050625    .0026842
log_hhinc_~j |  -.0110331    .020629    -0.53   0.593    -.0517064    .0296403
       trend |    .019566   .0006166    31.73   0.000     .0183502    .0207817
       _cons |  -1.622176   .2099509    -7.73   0.000    -2.036128   -1.208224
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =      29.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8719
                                                  Adj R-squared   =     0.8609
                                                  Within R-sq.    =     0.0296
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0505773   .0055789    -9.07   0.000     -.061577   -.0395776
post_merg~or |  -.0007538   .0018483    -0.41   0.684     -.004398    .0028904
log_hhinc_~j |  -.0209957   .0207502    -1.01   0.313    -.0619081    .0199166
       _cons |  -1.397163   .2110066    -6.62   0.000    -1.813196   -.9811294
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.8185e+13)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     214.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0871
                                                Root MSE          =     .21115

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   -.053512   .0059843    -8.94   0.000     -.065311    -.041713
       trend |   .0192732   .0007622    25.29   0.000     .0177704     .020776
log_hhinc_~j |    .153936   .0445582     3.45   0.001     .0660824    .2417897
       _cons |  -3.303028   .4532286    -7.29   0.000    -4.196641   -2.409415
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     331.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8370
                                                  Adj R-squared   =     0.8232
                                                  Within R-sq.    =     0.2966
Number of clusters (dma_code) =        205        Root MSE        =     0.0929

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0524482   .0056951    -9.21   0.000    -.0636771   -.0412193
       trend |   .0194314    .000619    31.39   0.000      .018211    .0206518
log_hhinc_~j |  -.0126117   .0210659    -0.60   0.550    -.0541466    .0289231
       _cons |  -1.606811   .2145337    -7.49   0.000    -2.029798   -1.183823
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.01
Statistics robust to heteroskedasticity           Prob > F        =     0.9193
                                                  R-squared       =     0.8722
                                                  Adj R-squared   =     0.8613
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0823

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |  -.0018618   .0183528    -0.10   0.919    -.0380472    .0343237
       _cons |  -1.624865   .1871091    -8.68   0.000     -1.99378   -1.255949
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     338.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8323
                                                  Within R-sq.    =     0.3028
Number of clusters (dma_code) =        205        Root MSE        =     0.0905

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0549513   .0060808    -9.04   0.000    -.0669405    -.042962
       trend |   .0195666   .0006165    31.74   0.000      .018351    .0207822
log_hhinc_~j |  -.0110309   .0206292    -0.53   0.593    -.0517047    .0296428
       _cons |  -1.622199    .209953    -7.73   0.000    -2.036155   -1.208243
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      43.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8719
                                                  Adj R-squared   =     0.8609
                                                  Within R-sq.    =     0.0296
Number of clusters (dma_code) =        205        Root MSE        =     0.0824

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0511069   .0056979    -8.97   0.000    -.0623412   -.0398727
log_hhinc_~j |  -.0209951   .0207504    -1.01   0.313    -.0619077    .0199176
       _cons |  -1.397168   .2110079    -6.62   0.000    -1.813204   -.9811316
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     173.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0550
                                                Root MSE          =     .25057

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0574953   .0075661    -7.60   0.000    -.0724132   -.0425775
       trend |    .020221   .0010979    18.42   0.000     .0180563    .0223857
       _cons |  -1.755402   .0274155   -64.03   0.000    -1.809457   -1.701348
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     164.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8945
                                                  Adj R-squared   =     0.8856
                                                  Within R-sq.    =     0.3250
Number of clusters (dma_code) =        205        Root MSE        =     0.0872

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0573784    .007792    -7.36   0.000    -.0727416   -.0420152
       trend |   .0197888   .0011012    17.97   0.000     .0176177    .0219599
       _cons |  -1.752714   .0075315  -232.72   0.000    -1.767564   -1.737865
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9189
                                                  Adj R-squared   =     0.9120
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |  -1.660751   4.90e-19 -3.4e+18   0.000    -1.660751   -1.660751
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     163.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8997
                                                  Adj R-squared   =     0.8912
                                                  Within R-sq.    =     0.3296
Number of clusters (dma_code) =        205        Root MSE        =     0.0850

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0578746   .0083034    -6.97   0.000    -.0742461   -.0415031
       trend |   .0197075   .0010967    17.97   0.000     .0175452    .0218699
       _cons |  -1.751864   .0076529  -228.91   0.000    -1.766953   -1.736775
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      52.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9152
                                                  Adj R-squared   =     0.9080
                                                  Within R-sq.    =     0.0398
Number of clusters (dma_code) =        205        Root MSE        =     0.0782

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    -.05755   .0079446    -7.24   0.000     -.073214   -.0418859
       _cons |  -1.623585   .0051306  -316.45   0.000    -1.633701    -1.61347
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =     116.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0574
                                                Root MSE          =     .25024

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0729755   .0085396    -8.55   0.000    -.0898128   -.0561382
post_merg~or |   .0319464   .0040234     7.94   0.000     .0240136    .0398792
       trend |   .0202078    .001104    18.30   0.000      .018031    .0223845
       _cons |  -1.755376   .0274048   -64.05   0.000    -1.809409   -1.701343
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     111.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8946
                                                  Adj R-squared   =     0.8857
                                                  Within R-sq.    =     0.3258
Number of clusters (dma_code) =        205        Root MSE        =     0.0871

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0632244   .0084556    -7.48   0.000     -.079896   -.0465528
post_merg~or |   .0120668   .0032036     3.77   0.000     .0057504    .0183833
       trend |   .0197977    .001103    17.95   0.000      .017623    .0219724
       _cons |  -1.752793   .0075322  -232.71   0.000    -1.767644   -1.737942
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      14.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.9190
                                                  Adj R-squared   =     0.9122
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0122377   .0032188     3.80   0.000     .0058913    .0185841
       _cons |  -1.664601   .0010126 -1643.92   0.000    -1.666597   -1.662604
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     110.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8998
                                                  Adj R-squared   =     0.8913
                                                  Within R-sq.    =     0.3304
Number of clusters (dma_code) =        205        Root MSE        =     0.0850

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0637526   .0089411    -7.13   0.000    -.0813814   -.0461238
post_merg~or |   .0121308   .0031995     3.79   0.000     .0058226    .0184391
       trend |   .0197165   .0010987    17.94   0.000     .0175502    .0218829
       _cons |  -1.751943   .0076534  -228.91   0.000    -1.767033   -1.736853
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      27.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9154
                                                  Adj R-squared   =     0.9081
                                                  Within R-sq.    =     0.0413
Number of clusters (dma_code) =        205        Root MSE        =     0.0781

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0635986   .0085479    -7.44   0.000    -.0804521   -.0467451
post_merg~or |   .0124826   .0030204     4.13   0.000     .0065274    .0184378
       _cons |  -1.623606   .0051398  -315.89   0.000     -1.63374   -1.613472
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     173.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0550
                                                Root MSE          =     .25057

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0574953   .0075661    -7.60   0.000    -.0724132   -.0425775
       trend |    .020221   .0010979    18.42   0.000     .0180563    .0223857
       _cons |  -1.755402   .0274155   -64.03   0.000    -1.809457   -1.701348
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     164.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8945
                                                  Adj R-squared   =     0.8856
                                                  Within R-sq.    =     0.3250
Number of clusters (dma_code) =        205        Root MSE        =     0.0872

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0573784    .007792    -7.36   0.000    -.0727416   -.0420152
       trend |   .0197888   .0011012    17.97   0.000     .0176177    .0219599
       _cons |  -1.752714   .0075315  -232.72   0.000    -1.767564   -1.737865
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9189
                                                  Adj R-squared   =     0.9120
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |  -1.660751   4.90e-19 -3.4e+18   0.000    -1.660751   -1.660751
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     163.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8997
                                                  Adj R-squared   =     0.8912
                                                  Within R-sq.    =     0.3296
Number of clusters (dma_code) =        205        Root MSE        =     0.0850

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0578746   .0083034    -6.97   0.000    -.0742461   -.0415031
       trend |   .0197075   .0010967    17.97   0.000     .0175452    .0218699
       _cons |  -1.751864   .0076529  -228.91   0.000    -1.766953   -1.736775
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      52.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9152
                                                  Adj R-squared   =     0.9080
                                                  Within R-sq.    =     0.0398
Number of clusters (dma_code) =        205        Root MSE        =     0.0782

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    -.05755   .0079446    -7.24   0.000     -.073214   -.0418859
       _cons |  -1.623585   .0051306  -316.45   0.000    -1.633701    -1.61347
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     121.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0672
                                                Root MSE          =     .24895

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1238409   .0504355    -2.46   0.015    -.2232826   -.0243992
    post_hhi |   .2823508   .2973878     0.95   0.344     -.303997    .8686986
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .1185553   .0932491     1.27   0.205    -.0653002    .3024109
       trend |   .0202527   .0011473    17.65   0.000     .0179905    .0225149
       _cons |  -1.912749   .1677077   -11.41   0.000    -2.243412   -1.582086
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.6368e+13)

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =     121.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0672
                                                Root MSE          =     .24895

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1238409   .0504355    -2.46   0.015    -.2232826   -.0243992
    post_hhi |   .2823508   .2973878     0.95   0.344     -.303997    .8686986
      np_HHI |   .1185553   .0932491     1.27   0.205    -.0653002    .3024109
       trend |   .0202527   .0011473    17.65   0.000     .0179905    .0225149
       _cons |  -1.912749   .1677077   -11.41   0.000    -2.243412   -1.582086
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.6368e+13)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(2, 204)         =     173.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0550
                                                Root MSE          =     .25057

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0574953   .0075661    -7.60   0.000    -.0724132   -.0425775
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |    .020221   .0010979    18.42   0.000     .0180563    .0223857
       _cons |  -1.755402   .0274155   -64.03   0.000    -1.809457   -1.701348
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     128.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8948
                                                  Adj R-squared   =     0.8859
                                                  Within R-sq.    =     0.3271
Number of clusters (dma_code) =        205        Root MSE        =     0.0870

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1268744   .0493274    -2.57   0.011    -.2241313   -.0296176
     np_dhhi |          0  (omitted)
      np_HHI |   .1246148   .0922106     1.35   0.178    -.0571933    .3064229
       trend |   .0198016   .0011097    17.84   0.000     .0176135    .0219896
       _cons |  -1.752763   .0073792  -237.53   0.000    -1.767312   -1.738214
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     128.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8948
                                                  Adj R-squared   =     0.8859
                                                  Within R-sq.    =     0.3271
Number of clusters (dma_code) =        205        Root MSE        =     0.0870

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1268744   .0493274    -2.57   0.011    -.2241313   -.0296176
      np_HHI |   .1246148   .0922106     1.35   0.178    -.0571933    .3064229
       trend |   .0198016   .0011097    17.84   0.000     .0176135    .0219896
       _cons |  -1.752763   .0073792  -237.53   0.000    -1.767312   -1.738214
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     164.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8945
                                                  Adj R-squared   =     0.8856
                                                  Within R-sq.    =     0.3250
Number of clusters (dma_code) =        205        Root MSE        =     0.0872

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0573784    .007792    -7.36   0.000    -.0727416   -.0420152
     np_dhhi |          0  (omitted)
       trend |   .0197888   .0011012    17.97   0.000     .0176177    .0219599
       _cons |  -1.752714   .0075315  -232.72   0.000    -1.767564   -1.737865
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       1.81
Statistics robust to heteroskedasticity           Prob > F        =     0.1805
                                                  R-squared       =     0.9192
                                                  Adj R-squared   =     0.9124
                                                  Within R-sq.    =     0.0040
Number of clusters (dma_code) =        205        Root MSE        =     0.0763

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |   .1246298   .0927338     1.34   0.180    -.0582098    .3074693
       _cons |  -1.705603    .033373   -51.11   0.000    -1.771403   -1.639802
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       1.81
Statistics robust to heteroskedasticity           Prob > F        =     0.1805
                                                  R-squared       =     0.9192
                                                  Adj R-squared   =     0.9124
                                                  Within R-sq.    =     0.0040
Number of clusters (dma_code) =        205        Root MSE        =     0.0763

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   .1246298   .0927338     1.34   0.180    -.0582098    .3074693
       _cons |  -1.705603    .033373   -51.11   0.000    -1.771403   -1.639802
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9189
                                                  Adj R-squared   =     0.9120
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |  -1.660751   4.90e-19 -3.4e+18   0.000    -1.660751   -1.660751
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     125.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9000
                                                  Adj R-squared   =     0.8915
                                                  Within R-sq.    =     0.3318
Number of clusters (dma_code) =        205        Root MSE        =     0.0849

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1272901   .0490766    -2.59   0.010    -.2240524   -.0305277
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |    .124473   .0923436     1.35   0.179    -.0575974    .3065433
       trend |   .0197199   .0011053    17.84   0.000     .0175407    .0218992
       _cons |  -1.751912   .0074948  -233.75   0.000    -1.766689   -1.737134
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      61.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9153
                                                  Adj R-squared   =     0.9081
                                                  Within R-sq.    =     0.0405
Number of clusters (dma_code) =        205        Root MSE        =     0.0782

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   -.112886   .0493647    -2.29   0.023    -.2102165   -.0155554
     np_dhhi |          0  (omitted)
      np_HHI |   .0992804   .0983899     1.01   0.314    -.0947111     .293272
       _cons |  -1.623578    .005282  -307.38   0.000    -1.633993   -1.613164
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     125.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9000
                                                  Adj R-squared   =     0.8915
                                                  Within R-sq.    =     0.3318
Number of clusters (dma_code) =        205        Root MSE        =     0.0849

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.1272901   .0490766    -2.59   0.010    -.2240524   -.0305277
      np_HHI |    .124473   .0923436     1.35   0.179    -.0575974    .3065433
       trend |   .0197199   .0011053    17.84   0.000     .0175407    .0218992
       _cons |  -1.751912   .0074948  -233.75   0.000    -1.766689   -1.737134
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      61.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9153
                                                  Adj R-squared   =     0.9081
                                                  Within R-sq.    =     0.0405
Number of clusters (dma_code) =        205        Root MSE        =     0.0782

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   -.112886   .0493647    -2.29   0.023    -.2102165   -.0155554
      np_HHI |   .0992804   .0983899     1.01   0.314    -.0947111     .293272
       _cons |  -1.623578    .005282  -307.38   0.000    -1.633993   -1.613164
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =     163.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8997
                                                  Adj R-squared   =     0.8912
                                                  Within R-sq.    =     0.3296
Number of clusters (dma_code) =        205        Root MSE        =     0.0850

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0578746   .0083034    -6.97   0.000    -.0742461   -.0415031
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0197075   .0010967    17.97   0.000     .0175452    .0218699
       _cons |  -1.751864   .0076529  -228.91   0.000    -1.766953   -1.736775
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =      52.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9152
                                                  Adj R-squared   =     0.9080
                                                  Within R-sq.    =     0.0398
Number of clusters (dma_code) =        205        Root MSE        =     0.0782

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    -.05755   .0079446    -7.24   0.000     -.073214   -.0418859
     np_dhhi |          0  (omitted)
       _cons |  -1.623585   .0051306  -316.45   0.000    -1.633701    -1.61347
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =      99.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1220
                                                Root MSE          =     .24152

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0671187   .0116448    -5.76   0.000    -.0900782   -.0441592
log_hhinc_~j |   .3022017   .0823146     3.67   0.000     .1399052    .4644983
       trend |   .0207986   .0012329    16.87   0.000     .0183678    .0232294
       _cons |  -4.871175   .8363135    -5.82   0.000    -6.520102   -3.222249
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     107.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8946
                                                  Adj R-squared   =     0.8857
                                                  Within R-sq.    =     0.3257
Number of clusters (dma_code) =        205        Root MSE        =     0.0871

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0567462   .0078631    -7.22   0.000    -.0722496   -.0412428
log_hhinc_~j |  -.0215748   .0287635    -0.75   0.454    -.0782867    .0351372
       trend |   .0197567    .001113    17.75   0.000     .0175622    .0219512
       _cons |  -1.530296   .2959083    -5.17   0.000    -2.113727   -.9468651
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.01
Statistics robust to heteroskedasticity           Prob > F        =     0.9128
                                                  R-squared       =     0.9189
                                                  Adj R-squared   =     0.9120
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |  -.0029953   .0273255    -0.11   0.913    -.0568718    .0508813
       _cons |  -1.629845   .2819549    -5.78   0.000    -2.185764   -1.073925
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     107.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8998
                                                  Adj R-squared   =     0.8913
                                                  Within R-sq.    =     0.3303
Number of clusters (dma_code) =        205        Root MSE        =     0.0850

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0570431   .0084252    -6.77   0.000    -.0736547   -.0404316
log_hhinc_~j |   -.021016   .0278148    -0.76   0.451    -.0758574    .0338253
       trend |   .0196577   .0011056    17.78   0.000     .0174778    .0218376
       _cons |  -1.535224   .2858913    -5.37   0.000    -2.098905   -.9715433
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      26.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9154
                                                  Adj R-squared   =     0.9082
                                                  Within R-sq.    =     0.0418
Number of clusters (dma_code) =        205        Root MSE        =     0.0781

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0566438   .0077941    -7.27   0.000     -.072011   -.0412765
log_hhinc_~j |  -.0320006   .0335023    -0.96   0.341    -.0980558    .0340546
       _cons |  -1.293976   .3458789    -3.74   0.000    -1.975932     -.61202
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(4, 204)         =      83.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1244
                                                Root MSE          =      .2412

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0821173   .0123022    -6.68   0.000    -.1063731   -.0578616
post_merg~or |   .0309742   .0038498     8.05   0.000     .0233837    .0385648
       trend |   .0207851    .001238    16.79   0.000     .0183442     .023226
log_hhinc_~j |   .3018719   .0822521     3.67   0.000     .1396986    .4640452
       _cons |  -4.867749   .8356785    -5.82   0.000    -6.515423   -3.220074
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   4,    204) =      82.16
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8948
                                                  Adj R-squared   =     0.8858
                                                  Within R-sq.    =     0.3264
Number of clusters (dma_code) =        205        Root MSE        =     0.0871

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0625988   .0084962    -7.37   0.000    -.0793505   -.0458471
post_merg~or |   .0120823   .0032227     3.75   0.000     .0057283    .0184363
       trend |   .0197656   .0011148    17.73   0.000     .0175676    .0219635
log_hhinc_~j |  -.0216071    .028782    -0.75   0.454    -.0783553    .0351412
       _cons |  -1.530042   .2960853    -5.17   0.000    -2.113822   -.9462621
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =       7.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0007
                                                  R-squared       =     0.9190
                                                  Adj R-squared   =     0.9122
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |     .01224   .0032175     3.80   0.000     .0058962    .0185839
log_hhinc_~j |  -.0030313   .0273198    -0.11   0.912    -.0568967    .0508342
       _cons |  -1.633324    .282088    -5.79   0.000    -2.189506   -1.077142
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   4,    204) =      81.93
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8999
                                                  Adj R-squared   =     0.8914
                                                  Within R-sq.    =     0.3311
Number of clusters (dma_code) =        205        Root MSE        =     0.0849

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.062927   .0090287    -6.97   0.000    -.0807286   -.0451254
post_merg~or |   .0121456   .0032176     3.77   0.000     .0058016    .0184896
log_hhinc_~j |   -.021048    .027834    -0.76   0.450    -.0759272    .0338312
       trend |   .0196667   .0011075    17.76   0.000      .017483    .0218503
       _cons |  -1.534974   .2860759    -5.37   0.000    -2.099019   -.9709291
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =      19.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9156
                                                  Adj R-squared   =     0.9083
                                                  Within R-sq.    =     0.0433
Number of clusters (dma_code) =        205        Root MSE        =     0.0780

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0627011    .008332    -7.53   0.000     -.079129   -.0462732
post_merg~or |   .0125028   .0030365     4.12   0.000     .0065159    .0184898
log_hhinc_~j |  -.0320397   .0335289    -0.96   0.340    -.0981473    .0340679
       _cons |  -1.293594   .3461612    -3.74   0.000    -1.976106   -.6110811
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.6368e+13)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    494,392
                                                F(3, 204)         =      99.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1220
                                                Root MSE          =     .24152

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0671187   .0116448    -5.76   0.000    -.0900782   -.0441592
       trend |   .0207986   .0012329    16.87   0.000     .0183678    .0232294
log_hhinc_~j |   .3022017   .0823146     3.67   0.000     .1399052    .4644983
       _cons |  -4.871175   .8363135    -5.82   0.000    -6.520102   -3.222249
------------------------------------------------------------------------------
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     107.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8946
                                                  Adj R-squared   =     0.8857
                                                  Within R-sq.    =     0.3257
Number of clusters (dma_code) =        205        Root MSE        =     0.0871

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0567462   .0078631    -7.22   0.000    -.0722496   -.0412428
       trend |   .0197567    .001113    17.75   0.000     .0175622    .0219512
log_hhinc_~j |  -.0215748   .0287635    -0.75   0.454    -.0782867    .0351372
       _cons |  -1.530296   .2959083    -5.17   0.000    -2.113727   -.9468651
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   1,    204) =       0.01
Statistics robust to heteroskedasticity           Prob > F        =     0.9128
                                                  R-squared       =     0.9189
                                                  Adj R-squared   =     0.9120
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0764

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |  -.0029953   .0273255    -0.11   0.913    -.0568718    .0508813
       _cons |  -1.629845   .2819549    -5.78   0.000    -2.185764   -1.073925
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   3,    204) =     107.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8998
                                                  Adj R-squared   =     0.8913
                                                  Within R-sq.    =     0.3303
Number of clusters (dma_code) =        205        Root MSE        =     0.0850

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0570431   .0084252    -6.77   0.000    -.0736547   -.0404316
       trend |   .0196577   .0011056    17.78   0.000     .0174778    .0218376
log_hhinc_~j |   -.021016   .0278148    -0.76   0.451    -.0758574    .0338253
       _cons |  -1.535224   .2858913    -5.37   0.000    -2.098905   -.9715433
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 636 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 2 HDFE groups                           F(   2,    204) =      26.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9154
                                                  Adj R-squared   =     0.9082
                                                  Within R-sq.    =     0.0418
Number of clusters (dma_code) =        205        Root MSE        =     0.0781

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0566438   .0077941    -7.27   0.000     -.072011   -.0412765
log_hhinc_~j |  -.0320006   .0335023    -0.96   0.341    -.0980558    .0340546
       _cons |  -1.293976   .3458789    -3.74   0.000    -1.975932     -.61202
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     38583       38583           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(2, 204)         =      76.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0577
                                                Root MSE          =     .24557

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0627377   .0085378    -7.35   0.000    -.0795713   -.0459041
       trend |   .0207764    .001693    12.27   0.000     .0174384    .0241144
       _cons |  -1.756928   .0272349   -64.51   0.000    -1.810626    -1.70323
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   2,    204) =      77.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8981
                                                  Adj R-squared   =     0.8898
                                                  Within R-sq.    =     0.3601
Number of clusters (dma_code) =        205        Root MSE        =     0.0840

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    -.06306   .0084927    -7.43   0.000    -.0798048   -.0463152
       trend |     .02078   .0016791    12.38   0.000     .0174694    .0240907
       _cons |  -1.756745    .009481  -185.29   0.000    -1.775438   -1.738051
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9286
                                                  Adj R-squared   =     0.9228
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |  -1.662668   4.41e-18 -3.8e+17   0.000    -1.662668   -1.662668
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      81.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9046
                                                  Adj R-squared   =     0.8968
                                                  Within R-sq.    =     0.3689
Number of clusters (dma_code) =        205        Root MSE        =     0.0813

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0652344   .0087458    -7.46   0.000    -.0824783   -.0479906
       trend |   .0208414   .0016519    12.62   0.000     .0175844    .0240985
       _cons |  -1.755748   .0096278  -182.36   0.000     -1.77473   -1.736765
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =      51.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9255
                                                  Adj R-squared   =     0.9194
                                                  Within R-sq.    =     0.0568
Number of clusters (dma_code) =        205        Root MSE        =     0.0718

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0636225   .0088616    -7.18   0.000    -.0810945   -.0461504
       _cons |  -1.621859    .005684  -285.34   0.000    -1.633066   -1.610652
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(3, 204)         =      57.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0607
                                                Root MSE          =     .24519

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0889772   .0148594    -5.99   0.000     -.118275   -.0596794
post_merg~or |    .037181   .0143914     2.58   0.010     .0088061    .0655559
       trend |   .0208031   .0017055    12.20   0.000     .0174405    .0241657
       _cons |  -1.756982    .027239   -64.50   0.000    -1.810688   -1.703276
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   3,    204) =     136.11
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8982
                                                  Adj R-squared   =     0.8899
                                                  Within R-sq.    =     0.3604
Number of clusters (dma_code) =        205        Root MSE        =     0.0840

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0684465   .0111838    -6.12   0.000    -.0904973   -.0463958
post_merg~or |   .0076516   .0066069     1.16   0.248    -.0053749    .0206781
       trend |   .0207829   .0016817    12.36   0.000     .0174671    .0240987
       _cons |  -1.756747   .0094647  -185.61   0.000    -1.775409   -1.738086
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =       1.36
Statistics robust to heteroskedasticity           Prob > F        =     0.2453
                                                  R-squared       =     0.9287
                                                  Adj R-squared   =     0.9228
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0077971   .0066914     1.17   0.245    -.0053962    .0209903
       _cons |  -1.666173   .0030075  -554.01   0.000    -1.672102   -1.660243
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   3,    204) =     138.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9046
                                                  Adj R-squared   =     0.8969
                                                  Within R-sq.    =     0.3692
Number of clusters (dma_code) =        205        Root MSE        =     0.0812

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0706341   .0111787    -6.32   0.000    -.0926747   -.0485935
post_merg~or |   .0076701   .0066146     1.16   0.248    -.0053716    .0207119
       trend |   .0208443   .0016545    12.60   0.000     .0175822    .0241065
       _cons |   -1.75575   .0096111  -182.68   0.000      -1.7747     -1.7368
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      30.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9255
                                                  Adj R-squared   =     0.9194
                                                  Within R-sq.    =     0.0568
Number of clusters (dma_code) =        205        Root MSE        =     0.0718

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0658524   .0105468    -6.24   0.000    -.0866472   -.0450576
post_merg~or |   .0031688   .0040834     0.78   0.439    -.0048824    .0112199
       _cons |  -1.621853   .0056934  -284.87   0.000    -1.633079   -1.610628
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(2, 204)         =      76.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0577
                                                Root MSE          =     .24557

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0627377   .0085378    -7.35   0.000    -.0795713   -.0459041
       trend |   .0207764    .001693    12.27   0.000     .0174384    .0241144
       _cons |  -1.756928   .0272349   -64.51   0.000    -1.810626    -1.70323
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   2,    204) =      77.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8981
                                                  Adj R-squared   =     0.8898
                                                  Within R-sq.    =     0.3601
Number of clusters (dma_code) =        205        Root MSE        =     0.0840

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    -.06306   .0084927    -7.43   0.000    -.0798048   -.0463152
       trend |     .02078   .0016791    12.38   0.000     .0174694    .0240907
       _cons |  -1.756745    .009481  -185.29   0.000    -1.775438   -1.738051
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9286
                                                  Adj R-squared   =     0.9228
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |  -1.662668   4.41e-18 -3.8e+17   0.000    -1.662668   -1.662668
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      81.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9046
                                                  Adj R-squared   =     0.8968
                                                  Within R-sq.    =     0.3689
Number of clusters (dma_code) =        205        Root MSE        =     0.0813

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0652344   .0087458    -7.46   0.000    -.0824783   -.0479906
       trend |   .0208414   .0016519    12.62   0.000     .0175844    .0240985
       _cons |  -1.755748   .0096278  -182.36   0.000     -1.77473   -1.736765
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =      51.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9255
                                                  Adj R-squared   =     0.9194
                                                  Within R-sq.    =     0.0568
Number of clusters (dma_code) =        205        Root MSE        =     0.0718

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0636225   .0088616    -7.18   0.000    -.0810945   -.0461504
       _cons |  -1.621859    .005684  -285.34   0.000    -1.633066   -1.610652
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(4, 204)         =      58.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0758
                                                Root MSE          =     .24321

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1769248    .064425    -2.75   0.007    -.3039491   -.0499005
    post_hhi |   .2919004   .3110407     0.94   0.349    -.3213664    .9051672
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .2044219   .1127679     1.81   0.071    -.0179181    .4267619
       trend |   .0208558   .0017695    11.79   0.000      .017367    .0243447
       _cons |  -1.919459   .1795904   -10.69   0.000     -2.27355   -1.565368
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   3.0477e+11)

Linear regression                               Number of obs     =    485,319
                                                F(4, 204)         =      58.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0758
                                                Root MSE          =     .24321

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1769248    .064425    -2.75   0.007    -.3039491   -.0499005
    post_hhi |   .2919004   .3110407     0.94   0.349    -.3213664    .9051672
      np_HHI |   .2044219   .1127679     1.81   0.071    -.0179181    .4267619
       trend |   .0208558   .0017695    11.79   0.000      .017367    .0243447
       _cons |  -1.919459   .1795904   -10.69   0.000     -2.27355   -1.565368
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   3.0477e+11)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(2, 204)         =      76.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0577
                                                Root MSE          =     .24557

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0627377   .0085378    -7.35   0.000    -.0795713   -.0459041
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0207764    .001693    12.27   0.000     .0174384    .0241144
       _cons |  -1.756928   .0272349   -64.51   0.000    -1.810626    -1.70323
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   3,    204) =      76.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8990
                                                  Adj R-squared   =     0.8907
                                                  Within R-sq.    =     0.3655
Number of clusters (dma_code) =        205        Root MSE        =     0.0836

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   -.173933   .0633097    -2.75   0.007    -.2987583   -.0491077
     np_dhhi |          0  (omitted)
      np_HHI |     .19912   .1115886     1.78   0.076    -.0208949    .4191349
       trend |   .0208015   .0016945    12.28   0.000     .0174605    .0241425
       _cons |  -1.756793   .0090167  -194.84   0.000    -1.774571   -1.739015
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   3,    204) =      76.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8990
                                                  Adj R-squared   =     0.8907
                                                  Within R-sq.    =     0.3655
Number of clusters (dma_code) =        205        Root MSE        =     0.0836

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   -.173933   .0633097    -2.75   0.007    -.2987583   -.0491077
      np_HHI |     .19912   .1115886     1.78   0.076    -.0208949    .4191349
       trend |   .0208015   .0016945    12.28   0.000     .0174605    .0241425
       _cons |  -1.756793   .0090167  -194.84   0.000    -1.774571   -1.739015
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   2,    204) =      77.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8981
                                                  Adj R-squared   =     0.8898
                                                  Within R-sq.    =     0.3601
Number of clusters (dma_code) =        205        Root MSE        =     0.0840

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    -.06306   .0084927    -7.43   0.000    -.0798048   -.0463152
     np_dhhi |          0  (omitted)
       trend |     .02078   .0016791    12.38   0.000     .0174694    .0240907
       _cons |  -1.756745    .009481  -185.29   0.000    -1.775438   -1.738051
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =       3.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0783
                                                  R-squared       =     0.9295
                                                  Adj R-squared   =     0.9237
                                                  Within R-sq.    =     0.0123
Number of clusters (dma_code) =        205        Root MSE        =     0.0699

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |   .1998137   .1129181     1.77   0.078    -.0228226    .4224499
       _cons |  -1.733941   .0402773   -43.05   0.000    -1.813354   -1.654527
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =       3.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0783
                                                  R-squared       =     0.9295
                                                  Adj R-squared   =     0.9237
                                                  Within R-sq.    =     0.0123
Number of clusters (dma_code) =        205        Root MSE        =     0.0699

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   .1998137   .1129181     1.77   0.078    -.0228226    .4224499
       _cons |  -1.733941   .0402773   -43.05   0.000    -1.813354   -1.654527
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   0,    204) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9286
                                                  Adj R-squared   =     0.9228
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |  -1.662668   4.41e-18 -3.8e+17   0.000    -1.662668   -1.662668
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   3,    204) =      76.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9055
                                                  Adj R-squared   =     0.8977
                                                  Within R-sq.    =     0.3746
Number of clusters (dma_code) =        205        Root MSE        =     0.0809

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.1759704   .0629066    -2.80   0.006    -.3000009   -.0519399
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .1988877   .1118502     1.78   0.077    -.0216429    .4194183
       trend |   .0208619   .0016667    12.52   0.000     .0175757    .0241481
       _cons |  -1.755794   .0091589  -191.70   0.000    -1.773852   -1.737736
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      69.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9255
                                                  Adj R-squared   =     0.9194
                                                  Within R-sq.    =     0.0570
Number of clusters (dma_code) =        205        Root MSE        =     0.0718

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0905475   .0599836    -1.51   0.133    -.2088149    .0277199
     np_dhhi |          0  (omitted)
      np_HHI |   .0483976   .1199753     0.40   0.687     -.188153    .2849483
       _cons |  -1.621852    .005771  -281.03   0.000    -1.633231   -1.610474
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   3,    204) =      76.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9055
                                                  Adj R-squared   =     0.8977
                                                  Within R-sq.    =     0.3746
Number of clusters (dma_code) =        205        Root MSE        =     0.0809

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.1759704   .0629066    -2.80   0.006    -.3000009   -.0519399
      np_HHI |   .1988877   .1118502     1.78   0.077    -.0216429    .4194183
       trend |   .0208619   .0016667    12.52   0.000     .0175757    .0241481
       _cons |  -1.755794   .0091589  -191.70   0.000    -1.773852   -1.737736
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      69.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9255
                                                  Adj R-squared   =     0.9194
                                                  Within R-sq.    =     0.0570
Number of clusters (dma_code) =        205        Root MSE        =     0.0718

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0905475   .0599836    -1.51   0.133    -.2088149    .0277199
      np_HHI |   .0483976   .1199753     0.40   0.687     -.188153    .2849483
       _cons |  -1.621852    .005771  -281.03   0.000    -1.633231   -1.610474
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      81.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9046
                                                  Adj R-squared   =     0.8968
                                                  Within R-sq.    =     0.3689
Number of clusters (dma_code) =        205        Root MSE        =     0.0813

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0652344   .0087458    -7.46   0.000    -.0824783   -.0479906
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0208414   .0016519    12.62   0.000     .0175844    .0240985
       _cons |  -1.755748   .0096278  -182.36   0.000     -1.77473   -1.736765
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =      51.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9255
                                                  Adj R-squared   =     0.9194
                                                  Within R-sq.    =     0.0568
Number of clusters (dma_code) =        205        Root MSE        =     0.0718

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0636225   .0088616    -7.18   0.000    -.0810945   -.0461504
     np_dhhi |          0  (omitted)
       _cons |  -1.621859    .005684  -285.34   0.000    -1.633066   -1.610652
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(3, 204)         =      53.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1290
                                                Root MSE          =     .23611

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0721243   .0123405    -5.84   0.000    -.0964556    -.047793
log_hhinc_~j |    .307334   .0837309     3.67   0.000     .1422452    .4724229
       trend |   .0213388   .0017287    12.34   0.000     .0179303    .0247473
       _cons |  -4.924805    .853632    -5.77   0.000    -6.607878   -3.241732
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   3,    204) =      55.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8982
                                                  Adj R-squared   =     0.8898
                                                  Within R-sq.    =     0.3603
Number of clusters (dma_code) =        205        Root MSE        =     0.0840

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0626903   .0087169    -7.19   0.000     -.079877   -.0455035
log_hhinc_~j |   -.012826   .0306299    -0.42   0.676    -.0732177    .0475658
       trend |   .0207609   .0016987    12.22   0.000     .0174115    .0241102
       _cons |  -1.624553   .3167682    -5.13   0.000    -2.249113   -.9999939
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =       0.07
Statistics robust to heteroskedasticity           Prob > F        =     0.7945
                                                  R-squared       =     0.9286
                                                  Adj R-squared   =     0.9228
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |   .0081861   .0313857     0.26   0.794    -.0536958     .070068
       _cons |  -1.747111    .323754    -5.40   0.000    -2.385444   -1.108778
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   3,    204) =      57.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9046
                                                  Adj R-squared   =     0.8968
                                                  Within R-sq.    =     0.3691
Number of clusters (dma_code) =        205        Root MSE        =     0.0813

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0647909   .0090642    -7.15   0.000    -.0826625   -.0469193
log_hhinc_~j |  -.0113595   .0295485    -0.38   0.701    -.0696191    .0469001
       trend |   .0208145   .0016746    12.43   0.000     .0175127    .0241163
       _cons |  -1.638681   .3053665    -5.37   0.000     -2.24076   -1.036602
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      26.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9258
                                                  Adj R-squared   =     0.9196
                                                  Within R-sq.    =     0.0599
Number of clusters (dma_code) =        205        Root MSE        =     0.0717

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.062579   .0085693    -7.30   0.000    -.0794748   -.0456832
log_hhinc_~j |  -.0374421   .0387777    -0.97   0.335    -.1138986    .0390144
       _cons |    -1.2363   .4008137    -3.08   0.002    -2.026569   -.4460317
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(4, 204)         =      40.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1313
                                                Root MSE          =     .23579

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0955831   .0154737    -6.18   0.000    -.1260921   -.0650741
post_merg~or |   .0332919   .0123899     2.69   0.008     .0088631    .0577206
       trend |   .0213605   .0017353    12.31   0.000     .0179391     .024782
log_hhinc_~j |   .3061552   .0835295     3.67   0.000     .1414634    .4708471
       _cons |  -4.912703   .8514671    -5.77   0.000    -6.591507   -3.233898
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   4,    204) =     100.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8982
                                                  Adj R-squared   =     0.8899
                                                  Within R-sq.    =     0.3606
Number of clusters (dma_code) =        205        Root MSE        =     0.0839

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0681448   .0113722    -5.99   0.000    -.0905669   -.0457227
post_merg~or |   .0077563   .0066165     1.17   0.242    -.0052892    .0208018
       trend |   .0207635   .0017011    12.21   0.000     .0174094    .0241176
log_hhinc_~j |  -.0130237   .0305799    -0.43   0.671    -.0733169    .0472694
       _cons |  -1.622518   .3161895    -5.13   0.000    -2.245936   -.9990994
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =       0.74
Statistics robust to heteroskedasticity           Prob > F        =     0.4783
                                                  R-squared       =     0.9287
                                                  Adj R-squared   =     0.9229
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0077331   .0065381     1.18   0.238    -.0051578     .020624
log_hhinc_~j |   .0079848     .03123     0.26   0.798    -.0535902    .0695598
       _cons |   -1.74851   .3234326    -5.41   0.000     -2.38621   -1.110811
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   4,    204) =     102.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9047
                                                  Adj R-squared   =     0.8969
                                                  Within R-sq.    =     0.3694
Number of clusters (dma_code) =        205        Root MSE        =     0.0812

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0702481   .0114668    -6.13   0.000    -.0928568   -.0476395
post_merg~or |    .007763   .0066188     1.17   0.242    -.0052871    .0208131
log_hhinc_~j |  -.0115587   .0294961    -0.39   0.696     -.069715    .0465977
       trend |   .0208169   .0016768    12.42   0.000      .017511    .0241229
       _cons |  -1.636631    .304759    -5.37   0.000    -2.237512   -1.035749
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   3,    204) =      19.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9258
                                                  Adj R-squared   =     0.9196
                                                  Within R-sq.    =     0.0600
Number of clusters (dma_code) =        205        Root MSE        =     0.0717

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0649177    .010108    -6.42   0.000    -.0848473   -.0449881
post_merg~or |   .0033256   .0042075     0.79   0.430    -.0049701    .0116213
log_hhinc_~j |     -.0375   .0388271    -0.97   0.335    -.1140539     .039054
       _cons |  -1.235698   .4013406    -3.08   0.002    -2.027005   -.4443905
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0477e+11)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    485,319
                                                F(3, 204)         =      53.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1290
                                                Root MSE          =     .23611

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0721243   .0123405    -5.84   0.000    -.0964556    -.047793
       trend |   .0213388   .0017287    12.34   0.000     .0179303    .0247473
log_hhinc_~j |    .307334   .0837309     3.67   0.000     .1422452    .4724229
       _cons |  -4.924805    .853632    -5.77   0.000    -6.607878   -3.241732
------------------------------------------------------------------------------
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 1 HDFE group                            F(   3,    204) =      55.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8982
                                                  Adj R-squared   =     0.8898
                                                  Within R-sq.    =     0.3603
Number of clusters (dma_code) =        205        Root MSE        =     0.0840

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0626903   .0087169    -7.19   0.000     -.079877   -.0455035
       trend |   .0207609   .0016987    12.22   0.000     .0174115    .0241102
log_hhinc_~j |   -.012826   .0306299    -0.42   0.676    -.0732177    .0475658
       _cons |  -1.624553   .3167682    -5.13   0.000    -2.249113   -.9999939
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   1,    204) =       0.07
Statistics robust to heteroskedasticity           Prob > F        =     0.7945
                                                  R-squared       =     0.9286
                                                  Adj R-squared   =     0.9228
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        205        Root MSE        =     0.0703

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |   .0081861   .0313857     0.26   0.794    -.0536958     .070068
       _cons |  -1.747111    .323754    -5.40   0.000    -2.385444   -1.108778
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     36642       36642           0    *|
   time_effects |        14           0          14     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   3,    204) =      57.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9046
                                                  Adj R-squared   =     0.8968
                                                  Within R-sq.    =     0.3691
Number of clusters (dma_code) =        205        Root MSE        =     0.0813

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |  -.0647909   .0090642    -7.15   0.000    -.0826625   -.0469193
       trend |   .0208145   .0016746    12.43   0.000     .0175127    .0241163
log_hhinc_~j |  -.0113595   .0295485    -0.38   0.701    -.0696191    .0469001
       _cons |  -1.638681   .3053665    -5.37   0.000     -2.24076   -1.036602
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |     36642       36642           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 152 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    485,167
Absorbing 2 HDFE groups                           F(   2,    204) =      26.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9258
                                                  Adj R-squared   =     0.9196
                                                  Within R-sq.    =     0.0599
Number of clusters (dma_code) =        205        Root MSE        =     0.0717

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   -.062579   .0085693    -7.30   0.000    -.0794748   -.0456832
log_hhinc_~j |  -.0374421   .0387777    -0.97   0.335    -.1138986    .0390144
       _cons |    -1.2363   .4008137    -3.08   0.002    -2.026569   -.4460317
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       205         205           0    *|
 dma_code#c.trend |       205           0         205    ?|
   entity_effects |     36642       36642           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout

. 
. reghdfe lprice post_merger_merging post_merger trend, abs(entity_effects) vce
> (cluster dma_code)
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   2,    204) =     540.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2745
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0475532   .0055826    -8.52   0.000    -.0585602   -.0365461
       trend |   .0195485   .0005947    32.87   0.000     .0183759    .0207211
       _cons |  -1.749265   .0046238  -378.32   0.000    -1.758381   -1.740148
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl1

. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
> , abs(entity_effects) vce(cluster dma_code)
(dropped 636 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    493,756
Absorbing 1 HDFE group                            F(   3,    204) =     359.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8398
                                                  Adj R-squared   =     0.8262
                                                  Within R-sq.    =     0.2746
Number of clusters (dma_code) =        205        Root MSE        =     0.1010

                             (Std. Err. adjusted for 205 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0473107   .0056154    -8.43   0.000    -.0583823   -.0362391
log_hhinc_~j |  -.0127358   .0199968    -0.64   0.525    -.0521628    .0266912
       trend |   .0195187   .0005961    32.74   0.000     .0183433     .020694
       _cons |  -1.619359   .2036738    -7.95   0.000    -2.020934   -1.217783
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |     38583       38583           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl2

. 
. esttab tabl1 tabl2 using `2'/did_stata_table_`3'.tex, replace se r2 ar2 title
> ("Reduced Form Price Effects") mtitles("DMA/Product FE" "DMA/Product, Demogra
> phics")
(note: file ../output//did_stata_table_quarter.tex not found)
(output written to ../output//did_stata_table_quarter.tex)

. 
. 
. est clear

. 
. 
. 
. 
. exit, STATA clear
