
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Sandbox/did_test2.do ../../
> ../All/m_2616272020_1/intermediate ../output/ quarter 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_2616272020_1/intermediate

. log using `2'/did_stata_`3', text replace
(note: file /projects/b1048/gillanes/Mergers/All/m_2616272020_1/intermediate/..
> /output//did_stata_quarter.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_2616272020_1/intermediate/.
> ./output//did_stata_quarter.log
  log type:  text
 opened on:  10 Aug 2020, 21:43:17

. 
. import delimited "stata_did_`3'.csv", encoding(ISO-8859-1)
(23 vars, 103,069 obs)

. 
. /*Install Packages*/
. 
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /* Fixed Effects */
. egen entity_effects = group(upc dma_code)

. egen time_effects = group(year `3') /* same goes for month*/

. egen time_calendar = group(`3') /* same goes for month*/

. 
. 
. /* WEIGHTING SCHEMES */
. gen pre_vol = volume * (1 - post_merger)

. gen weights_0 = 1 /*to add weights that won't change things*/

. egen weights_1 = total(pre_vol), by(upc)

. egen weights_2 = total(pre_vol), by(dma_code)

. egen weights_3 = total(pre_vol), by(upc dma_code)

. replace weights_1 = round(weights_1)
(79,477 real changes made)

. replace weights_2 = round(weights_2)
(93,843 real changes made)

. replace weights_3 = round(weights_3)
(99,206 real changes made)

. 
. /*Naive Variables*/
. gen np_dhhi = post_merger*dhhi

. gen np_HHI = post_merger*post_hhi

. 
. 
. 
. forval x = 0/3 {
  2. 
. * No Fixed-Effects
. reg lprice post_merger_merging post_merger trend [aw = weights_`x'], vce(clus
> ter dma_code)
  3. est sto NO_FE_`x'
  4. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> ") replace
  5. 
. * Product/Market Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> entity_effects) vce(cluster dma_code)
  6. est sto PM_FE_`x'
  7. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE") append
  8. 
. 
. * Product/Market and Time Fixed-Effects
. reghdfe lprice post_merger_merging [aw = weights_`x'], abs(entity_effects tim
> e_effects) vce(cluster dma_code)
  9. est sto PMT_FE_`x'
 10. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE") append
 11. 
. 
. * Calendar Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> time_calendar entity_effects) vce(cluster dma_code)
 12. est sto PMT_C_`x'
 13. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE") append
 14. 
. * Dma-Specific Time Trends
. reghdfe lprice post_merger_merging post_merger [aw = weights_`x'], abs(dma_co
> de##c.trend entity_effects) vce(cluster dma_code)
 15. est sto PMT_t_`x'
 16. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends") append
 17. 
. 
. *MAJOR*
. 
. * No Fixed-Effects, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend [aw = weig
> hts_`x'], vce(cluster dma_code)
 18. est sto NO_FE_M_`x'
 19. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Major") append
 20. 
. 
. * Product/market Fixed-Effects (Time Trend)
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(entity_effects) vce(cluster dma_code)
 21. est sto PM_FE_M_`x'
 22. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, Major") append
 23. 
. 
. * Product/market and Time Fixed-Effects
. reghdfe lprice post_merger_merging post_merger_major [aw = weights_`x'], abs(
> entity_effects time_effects) vce(cluster dma_code)
 24. est sto PMT_FE_M_`x'
 25. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major") append
 26. 
. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 27. est sto PMT_C_M_`x'
 28. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Major") append
 29. 
. reghdfe lprice post_merger_merging post_merger post_merger_major [aw = weight
> s_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
 30. est sto PMT_t_M_`x'
 31. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Major") append
 32. 
. /******************************/
. /******************************/
. /******************************/
. 
. *DHHI
. 
. * No Fixed-Effects, DHHI
. reg lprice post_merger_dhhi post_merger trend [aw = weights_`x'], vce(cluster
>  dma_code)
 33. est sto NO_FE_DHHI_`x'
 34. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , DHHI") append
 35. 
. * Product/market Fixed-Effects, DHHI
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(ent
> ity_effects) vce(cluster dma_code)
 36. est sto PM_FE_DHHI_`x'
 37. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, DHHI") append
 38. 
. *Product/market and Time Fixed-Effects, DHHI.
. reghdfe lprice post_merger_dhhi [aw = weights_`x'], abs(entity_effects time_e
> ffects) vce(cluster dma_code)
 39. est sto PMT_FE_DHHHI_`x'
 40. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major") append
 41. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(tim
> e_calendar entity_effects) vce(cluster dma_code)
 42. est sto PMT_C_DHHI_`x'
 43. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, DHHI") append
 44. 
. reghdfe lprice post_merger_dhhi post_merger [aw = weights_`x'], abs(dma_code#
> #c.trend entity_effects) vce(cluster dma_code)
 45. est sto PMT_t_DHHI_`x'
 46. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, DHHI") append
 47. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. *NAIVE SPECIFICATIONS
. 
. 
. *No FE
. 
. *No Fixed-Effects naive DHHI and post-HHI
. reg lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`x'],
>  vce(cluster dma_code)
 48. est sto np_D_H_`x'
 49. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive DHHI & post HHI") append
 50. 
. *No Fixed-Effects naive post-HHI
. reg lprice post_merger post_hhi  np_HHI trend [aw = weights_`x'], vce(cluster
>  dma_code)
 51. est sto np_H_`x'
 52. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive post HHI") append
 53. 
. *No Fixed-Effects naive DHHI
. reg lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], vce(cluster dma
> _code)
 54. est sto np_D_`x'
 55. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive DHHI") append
 56. 
. *Product/market FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI trend [aw = weights_`x'], abs(entit
> y_effects) vce(cluster dma_code)
 57. est sto PM_FE_np_D_H_`x'
 58. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI & post HHI") append
 59. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice post_merger np_HHI trend [aw = weights_`x'], abs(entity_effect
> s) vce(cluster dma_code)
 60. est sto PM_FE_np_H_`x'
 61. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive post HHI") append
 62. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice post_merger np_dhhi trend [aw = weights_`x'], abs(entity_effec
> ts) vce(cluster dma_code)
 63. est sto PM_FE_np_D_`x'
 64. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI") append
 65. 
. *Product/Market and Time FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice np_dhhi np_HHI [aw = weights_`x'], abs(entity_effects time_eff
> ects) vce(cluster dma_code)
 66. est sto PMT_FE_np_D_H_`x'
 67. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI & post HHI") append
 68. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice np_HHI [aw = weights_`x'], abs(entity_effects time_effects) vc
> e(cluster dma_code)
 69. est sto PMT_FE_np_H_`x'
 70. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive post HHI") append
 71. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice np_dhhi [aw = weights_`x'], abs(entity_effects time_effects) v
> ce(cluster dma_code)
 72. est sto PMT_FE_np_D_`x'
 73. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI") append
 74. 
. 
. /******************************/
. 
. *Calendar Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`
> x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 75. est sto PMT_FE_t_np_D_H_`x'
 76. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive DHHI & post HHI") append
 77. 
. *DMA-trends, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI [aw = weights_`x'], abs(dma_code##c
> .trend entity_effects) vce(cluster dma_code)
 78. est sto PMT_FE_t_np_D_H_`x'
 79. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive DHHI & post HHI") append
 80. 
. *Calendar Fixed-Effects, naive post-HHI
. reghdfe lprice post_hhi post_merger np_HHI trend [aw = weights_`x'], abs(time
> _calendar entity_effects) vce(cluster dma_code)
 81. est sto PMT_FE_t_np_H_`x'
 82. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive post HHI") append
 83. 
. *DMA-trends, naive post-HHI
. reghdfe lprice post_merger np_HHI [aw = weights_`x'], abs(dma_code##c.trend e
> ntity_effects) vce(cluster dma_code)
 84. est sto PMT_FE_t_np_H_`x'
 85. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive post HHI") append
 86. 
. *Calendar Fixed-Effects, naive DHHI
. reghdfe lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], abs(time_ca
> lendar entity_effects) vce(cluster dma_code)
 87. est sto PMT_FE_t_np_D_`x'
 88. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive DHHI") append
 89. 
. *DMA-trends, naive DHHI
. reghdfe lprice post_merger np_dhhi [aw = weights_`x'], abs(dma_code##c.trend 
> entity_effects) vce(cluster dma_code)
 90. est sto PMT_FE_t_np_D_`x'
 91. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive DHHI") append
 92. 
. 
. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. 
. 
. * No Fixed-Effects, Demographics
. reg lprice post_merger_merging post_merger log_hhinc_per_person_adj trend [aw
>  = weights_`x'], vce(cluster dma_code)
 93. est sto NO_FE_d_`x'
 94. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Demographics") append
 95. 
. * Product/market Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 96. *note: this one  seemed to have both Time F-E and Time-Trends*
. est sto PM_FE_d_`x'
 97. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Demographics") append
 98. 
. * Product/market and Time Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging log_hhinc_per_person_adj [aw = weights_`x'
> ], abs(entity_effects time_effects) vce(cluster dma_code)
 99. est sto PMT_FE_d_`x'
100. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Demographics") append
101. 
. 
. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
102. est sto PMT_C_d_`x'
103. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Demographics") append
104. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj [aw =
>  weights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
105. est sto PMT_t_d_`x'
106. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Demographics") append
107. 
. 
. 
. * No Fixed-Effects, Demographics, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend log_hhinc_
> per_person_adj [aw = weights_`x'], vce(cluster dma_code)
108. est sto NO_FE_d_M_`x'
109. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Major, Demographics") append
110. 
. *Products/market Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger post_merger_major trend log_hh
> inc_per_person_adj [aw = weights_`x'], abs(entity_effects) vce(cluster dma_co
> de)
111. est sto PM_FE_d_M_`x'
112. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, Major, Demographics") append
113. 
. *Products/market and Time Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger_major log_hhinc_per_person_adj
>  [aw = weights_`x'], abs(entity_effects time_effects) vce(cluster dma_code)
114. est sto PMT_FE_d_M_`x'
115. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major, Demographics") append
116. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj trend [aw = weights_`x'], abs(time_calendar entity_effects) vce(
> cluster dma_code)
117. est sto PMT_C_d_M_`x'
118. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Major, Demographics") append
119. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj [aw = weights_`x'], abs(dma_code##c.trend entity_effects) vce(cl
> uster dma_code)
120. est sto PMT_t_d_M_`x'
121. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Major, Demographics") append
122. 
. /******************************/
. /******************************/
. /******************************/
. 
. *No Fixed-Effects, DHHI, Demographics
. reg lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [aw = 
> weights_`x'], vce(cluster dma_code)
123. est sto NO_FE_DHHI_d_`x'
124. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , DHHI, Demographics") append
125. 
. *Product/market Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(entity_effects) vce(cluster dma_code)
126. est sto PM_FE_DHHI_d_`x'
127. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, DHHI, Demographics") append
128. 
. *Product/market and Time Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi log_hhinc_per_person_adj [aw = weights_`x'], 
> abs(entity_effects time_effects) vce(cluster dma_code)
129. est sto PMT_FE_DHHI_d_`x'
130. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, DHHI, Demographics") append
131. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
132. est sto PMT_C_d_D_`x'
133. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, DHHI, Demographics") append
134. 
. reghdfe lprice post_merger_dhhi post_merger log_hhinc_per_person_adj [aw = we
> ights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
135. est sto PMT_t_d_D_`x'
136. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, DHHI, Demographics") append
137. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. est clear
138. 
. 
. }
(sum of wgt is   1.0307e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(2, 205)         =      60.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .71294

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0337359   .0031484    10.72   0.000     .0275284    .0399433
       trend |   -.002364    .000385    -6.14   0.000     -.003123    -.001605
       _cons |   .7115477   .0083087    85.64   0.000     .6951662    .7279292
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =     167.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .028177   .0020067    14.04   0.000     .0242206    .0321334
       trend |  -.0036071   .0002599   -13.88   0.000    -.0041195   -.0030947
       _cons |    .725535   .0022588   321.21   0.000     .7210816    .7299885
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   .7090486   3.60e-17  2.0e+16   0.000     .7090486    .7090486
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =     168.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0302069   .0021537    14.03   0.000     .0259607    .0344532
       trend |  -.0037685   .0002627   -14.34   0.000    -.0042865   -.0032505
       _cons |   .7258916   .0022696   319.83   0.000     .7214168    .7303664
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =     195.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0280844   .0020095    13.98   0.000     .0241224    .0320463
       _cons |   .6951192   .0009967   697.43   0.000     .6931542    .6970843
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0307e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(3, 205)         =    1119.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1212
                                                Root MSE          =     .66841

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .3930532   .0086032    45.69   0.000      .376091    .4100153
post_merg~or |  -.7039377    .012269   -57.38   0.000    -.7281273    -.679748
       trend |  -.0040743   .0004713    -8.65   0.000    -.0050035   -.0031451
       _cons |   .7184095   .0085743    83.79   0.000     .7015043    .7353146
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   3,    205) =     154.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9709
                                                  Adj R-squared   =     0.9686
                                                  Within R-sq.    =     0.0126
Number of clusters (dma_code) =        206        Root MSE        =     0.1262

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0503055   .0024014    20.95   0.000     .0455708    .0550402
post_merg~or |  -.0432414   .0041772   -10.35   0.000    -.0514772   -.0350055
       trend |  -.0036737   .0002627   -13.98   0.000    -.0041917   -.0031558
       _cons |   .7256366   .0022751   318.95   0.000      .721151    .7301222
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =     108.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9712
                                                  Adj R-squared   =     0.9689
                                                  Within R-sq.    =     0.0070
Number of clusters (dma_code) =        206        Root MSE        =     0.1256

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0431493    .004147   -10.40   0.000    -.0513256   -.0349731
       _cons |   .7195406   .0010084   713.57   0.000     .7175525    .7215287
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   3,    205) =     159.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0129
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .052237   .0024295    21.50   0.000      .047447    .0570271
post_merg~or |   -.043113   .0041806   -10.31   0.000    -.0513554   -.0348706
       trend |   -.003831   .0002654   -14.44   0.000    -.0043543   -.0033078
       _cons |   .7259757   .0022844   317.79   0.000     .7214717    .7304796
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =     227.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9716
                                                  Adj R-squared   =     0.9692
                                                  Within R-sq.    =     0.0107
Number of clusters (dma_code) =        206        Root MSE        =     0.1250

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0508282   .0024135    21.06   0.000     .0460697    .0555867
post_merg~or |  -.0444721    .004282   -10.39   0.000    -.0529145   -.0360297
       _cons |   .6946522   .0009848   705.41   0.000     .6927107    .6965938
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0307e+05)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(2, 205)         =      60.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .71294

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0337359   .0031484    10.72   0.000     .0275284    .0399433
       trend |   -.002364    .000385    -6.14   0.000     -.003123    -.001605
       _cons |   .7115477   .0083087    85.64   0.000     .6951662    .7279292
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =     167.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    .028177   .0020067    14.04   0.000     .0242206    .0321334
       trend |  -.0036071   .0002599   -13.88   0.000    -.0041195   -.0030947
       _cons |    .725535   .0022588   321.21   0.000     .7210816    .7299885
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |   .7090486   3.60e-17  2.0e+16   0.000     .7090486    .7090486
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =     168.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0302069   .0021537    14.03   0.000     .0259607    .0344532
       trend |  -.0037685   .0002627   -14.34   0.000    -.0042865   -.0032505
       _cons |   .7258916   .0022696   319.83   0.000     .7214168    .7303664
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =     195.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0280844   .0020095    13.98   0.000     .0241224    .0320463
       _cons |   .6951192   .0009967   697.43   0.000     .6931542    .6970843
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0307e+05)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(4, 205)         =      32.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0013
                                                Root MSE          =     .71253

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0095949   .0369449     0.26   0.795    -.0632458    .0824356
    post_hhi |  -.2848852   .0941489    -3.03   0.003    -.4705095   -.0992609
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .0331536   .0499766     0.66   0.508    -.0653804    .1316876
       trend |  -.0023235   .0003884    -5.98   0.000    -.0030892   -.0015578
       _cons |   .9203233   .0714944    12.87   0.000     .7793647    1.061282
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   1.0307e+05)

Linear regression                               Number of obs     =    103,069
                                                F(4, 205)         =      32.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0013
                                                Root MSE          =     .71253

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0095949   .0369449     0.26   0.795    -.0632458    .0824356
    post_hhi |  -.2848852   .0941489    -3.03   0.003    -.4705095   -.0992609
      np_HHI |   .0331536   .0499766     0.66   0.508    -.0653804    .1316876
       trend |  -.0023235   .0003884    -5.98   0.000    -.0030892   -.0015578
       _cons |   .9203233   .0714944    12.87   0.000     .7793647    1.061282
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   1.0307e+05)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(2, 205)         =      60.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .71294

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0337359   .0031484    10.72   0.000     .0275284    .0399433
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   -.002364    .000385    -6.14   0.000     -.003123    -.001605
       _cons |   .7115477   .0083087    85.64   0.000     .6951662    .7279292
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   3,    205) =     112.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0366167   .0204556     1.79   0.075    -.0037136    .0769469
     np_dhhi |          0  (omitted)
      np_HHI |  -.0115066   .0277563    -0.41   0.679    -.0662311    .0432179
       trend |   -.003608   .0002594   -13.91   0.000    -.0041195   -.0030965
       _cons |   .7255539   .0022498   322.50   0.000     .7211182    .7299896
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   3,    205) =     112.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0366167   .0204556     1.79   0.075    -.0037136    .0769469
      np_HHI |  -.0115066   .0277563    -0.41   0.679    -.0662311    .0432179
       trend |   -.003608   .0002594   -13.91   0.000    -.0041195   -.0030965
       _cons |   .7255539   .0022498   322.50   0.000     .7211182    .7299896
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =     167.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .028177   .0020067    14.04   0.000     .0242206    .0321334
     np_dhhi |          0  (omitted)
       trend |  -.0036071   .0002599   -13.88   0.000    -.0041195   -.0030947
       _cons |    .725535   .0022588   321.21   0.000     .7210816    .7299885
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =       0.21
Statistics robust to heteroskedasticity           Prob > F        =     0.6443
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |    -.01275   .0275764    -0.46   0.644    -.0671197    .0416197
       _cons |   .7136992   .0100584    70.96   0.000     .6938679    .7335304
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =       0.21
Statistics robust to heteroskedasticity           Prob > F        =     0.6443
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |    -.01275   .0275764    -0.46   0.644    -.0671197    .0416197
       _cons |   .7136992   .0100584    70.96   0.000     .6938679    .7335304
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |   .7090486   3.60e-17  2.0e+16   0.000     .7090486    .7090486
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   3,    205) =     113.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0382034   .0205012     1.86   0.064    -.0022168    .0786235
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.0109057   .0277926    -0.39   0.695    -.0657016    .0438903
       trend |  -.0037692   .0002624   -14.36   0.000    -.0042865   -.0032519
       _cons |   .7259089   .0022611   321.05   0.000      .721451    .7303668
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      98.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0012817   .0172338     0.07   0.941    -.0326966      .03526
     np_dhhi |          0  (omitted)
      np_HHI |   .0365043   .0234897     1.55   0.122     -.009808    .0828166
       _cons |    .695098   .0009939   699.33   0.000     .6931384    .6970577
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   3,    205) =     113.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0382034   .0205012     1.86   0.064    -.0022168    .0786235
      np_HHI |  -.0109057   .0277926    -0.39   0.695    -.0657016    .0438903
       trend |  -.0037692   .0002624   -14.36   0.000    -.0042865   -.0032519
       _cons |   .7259089   .0022611   321.05   0.000      .721451    .7303668
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      98.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0012817   .0172338     0.07   0.941    -.0326966      .03526
      np_HHI |   .0365043   .0234897     1.55   0.122     -.009808    .0828166
       _cons |    .695098   .0009939   699.33   0.000     .6931384    .6970577
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =     168.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0302069   .0021537    14.03   0.000     .0259607    .0344532
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |  -.0037685   .0002627   -14.34   0.000    -.0042865   -.0032505
       _cons |   .7258916   .0022696   319.83   0.000     .7214168    .7303664
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =     195.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0280844   .0020095    13.98   0.000     .0241224    .0320463
     np_dhhi |          0  (omitted)
       _cons |   .6951192   .0009967   697.43   0.000     .6931542    .6970843
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0297e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,971
                                                F(3, 205)         =      40.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .71285

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0337722   .0031616    10.68   0.000     .0275387    .0400056
log_hhinc_~j |    .007216   .0098658     0.73   0.465    -.0122354    .0266674
       trend |  -.0024096   .0003937    -6.12   0.000    -.0031859   -.0016334
       _cons |   .6387387   .0994894     6.42   0.000      .442585    .8348923
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   3,    205) =     111.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0281815    .002015    13.99   0.000     .0242087    .0321543
log_hhinc_~j |   .0020443   .0014119     1.45   0.149    -.0007394     .004828
       trend |   -.003619   .0002598   -13.93   0.000    -.0041312   -.0031068
       _cons |    .704815    .014656    48.09   0.000     .6759191    .7337109
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   1,    205) =       0.12
Statistics robust to heteroskedasticity           Prob > F        =     0.7290
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |  -.0003995   .0011514    -0.35   0.729    -.0026695    .0018706
       _cons |   .7129714   .0116563    61.17   0.000     .6899897     .735953
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   3,    205) =     112.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |     .03019   .0021593    13.98   0.000     .0259327    .0344473
log_hhinc_~j |   .0019849     .00143     1.39   0.167    -.0008345    .0048044
       trend |  -.0037785   .0002627   -14.38   0.000    -.0042964   -.0032605
       _cons |   .7057667   .0148474    47.53   0.000     .6764935    .7350398
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   2,    205) =      97.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0034
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0280905   .0020184    13.92   0.000      .024111      .03207
log_hhinc_~j |   .0029021    .001257     2.31   0.022     .0004239    .0053804
       _cons |   .6656134   .0128698    51.72   0.000     .6402393    .6909876
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0297e+05)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,971
                                                F(4, 205)         =     839.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1213
                                                Root MSE          =     .66829

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .3933809   .0086167    45.65   0.000     .3763922    .4103696
post_merg~or |  -.7041151   .0122735   -57.37   0.000    -.7283135   -.6799167
       trend |  -.0041411   .0004819    -8.59   0.000    -.0050913   -.0031909
log_hhinc_~j |   .0080658   .0106479     0.76   0.450    -.0129276    .0290592
       _cons |   .6370972   .1074399     5.93   0.000     .4252683    .8489261
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   4,    205) =     115.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9709
                                                  Adj R-squared   =     0.9686
                                                  Within R-sq.    =     0.0127
Number of clusters (dma_code) =        206        Root MSE        =     0.1262

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0503546   .0024112    20.88   0.000     .0456006    .0551085
post_merg~or |  -.0433036   .0041802   -10.36   0.000    -.0515454   -.0350618
       trend |  -.0036868   .0002627   -14.04   0.000    -.0042047   -.0031689
log_hhinc_~j |   .0020645   .0014114     1.46   0.145    -.0007183    .0048472
       _cons |   .7047169   .0146633    48.06   0.000     .6758067    .7336271
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   2,    205) =      54.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9712
                                                  Adj R-squared   =     0.9689
                                                  Within R-sq.    =     0.0070
Number of clusters (dma_code) =        206        Root MSE        =     0.1257

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0432037   .0041517   -10.41   0.000    -.0513891   -.0350183
log_hhinc_~j |  -.0003811   .0011549    -0.33   0.742    -.0026581     .001896
       _cons |   .7232918    .011891    60.83   0.000     .6998474    .7467362
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   4,    205) =     119.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0130
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0522632    .002438    21.44   0.000     .0474564      .05707
post_merg~or |  -.0431742   .0041836   -10.32   0.000    -.0514226   -.0349258
log_hhinc_~j |   .0020084   .0014292     1.41   0.161    -.0008094    .0048263
       trend |   -.003842   .0002654   -14.47   0.000    -.0043654   -.0033187
       _cons |   .7056171   .0148502    47.52   0.000     .6763384    .7348957
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   3,    205) =     151.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9716
                                                  Adj R-squared   =     0.9692
                                                  Within R-sq.    =     0.0108
Number of clusters (dma_code) =        206        Root MSE        =     0.1250

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0508766   .0024258    20.97   0.000     .0460939    .0556594
post_merg~or |  -.0445314   .0042868   -10.39   0.000    -.0529832   -.0360796
log_hhinc_~j |   .0029043   .0012668     2.29   0.023     .0004066     .005402
       _cons |   .6651197    .012973    51.27   0.000     .6395421    .6906973
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0297e+05)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    102,971
                                                F(3, 205)         =      40.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .71285

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0337722   .0031616    10.68   0.000     .0275387    .0400056
       trend |  -.0024096   .0003937    -6.12   0.000    -.0031859   -.0016334
log_hhinc_~j |    .007216   .0098658     0.73   0.465    -.0122354    .0266674
       _cons |   .6387387   .0994894     6.42   0.000      .442585    .8348923
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   3,    205) =     111.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0281815    .002015    13.99   0.000     .0242087    .0321543
       trend |   -.003619   .0002598   -13.93   0.000    -.0041312   -.0031068
log_hhinc_~j |   .0020443   .0014119     1.45   0.149    -.0007394     .004828
       _cons |    .704815    .014656    48.09   0.000     .6759191    .7337109
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   1,    205) =       0.12
Statistics robust to heteroskedasticity           Prob > F        =     0.7290
                                                  R-squared       =     0.9710
                                                  Adj R-squared   =     0.9687
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1261

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |  -.0003995   .0011514    -0.35   0.729    -.0026695    .0018706
       _cons |   .7129714   .0116563    61.17   0.000     .6899897     .735953
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   3,    205) =     112.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9708
                                                  Adj R-squared   =     0.9685
                                                  Within R-sq.    =     0.0060
Number of clusters (dma_code) =        206        Root MSE        =     0.1265

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |     .03019   .0021593    13.98   0.000     .0259327    .0344473
       trend |  -.0037785   .0002627   -14.38   0.000    -.0042964   -.0032605
log_hhinc_~j |   .0019849     .00143     1.39   0.167    -.0008345    .0048044
       _cons |   .7057667   .0148474    47.53   0.000     .6764935    .7350398
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 10 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   2,    205) =      97.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9714
                                                  Adj R-squared   =     0.9690
                                                  Within R-sq.    =     0.0034
Number of clusters (dma_code) =        206        Root MSE        =     0.1255

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0280905   .0020184    13.92   0.000      .024111      .03207
log_hhinc_~j |   .0029021    .001257     2.31   0.022     .0004239    .0053804
       _cons |   .6656134   .0128698    51.72   0.000     .6402393    .6909876
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2199e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,448
                                                F(2, 205)         =      66.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .57729

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0320604   .0028012    11.45   0.000     .0265376    .0375832
       trend |  -.0027338   .0004814    -5.68   0.000    -.0036829   -.0017846
       _cons |  -.0122908   .0090705    -1.36   0.177    -.0301742    .0055925
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 1 HDFE group                            F(   2,    205) =      63.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0245343   .0022783    10.77   0.000     .0200425    .0290261
       trend |  -.0025585   .0003968    -6.45   0.000    -.0033408   -.0017762
       _cons |  -.0100293   .0032001    -3.13   0.002    -.0163386     -.00372
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   -.019525   1.94e-17 -1.0e+15   0.000     -.019525    -.019525
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   2,    205) =      61.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0253723   .0023938    10.60   0.000     .0206528    .0300918
       trend |  -.0025895   .0003973    -6.52   0.000    -.0033728   -.0018063
       _cons |  -.0101831   .0031976    -3.18   0.002    -.0164876   -.0038787
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   1,    205) =     114.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0244316   .0022878    10.68   0.000      .019921    .0289422
       _cons |   -.031679   .0011381   -27.84   0.000    -.0339229   -.0294351
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2199e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,448
                                                F(3, 205)         =    1607.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1751
                                                Root MSE          =     .52438

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .8748242   .0142817    61.25   0.000     .8466663     .902982
post_merg~or |  -.9797566   .0146439   -66.91   0.000    -1.008629   -.9508848
       trend |  -.0030047   .0004693    -6.40   0.000      -.00393   -.0020794
       _cons |  -.0112019   .0090129    -1.24   0.215    -.0289717     .006568
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 1 HDFE group                            F(   3,    205) =     137.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9757
                                                  Adj R-squared   =     0.9738
                                                  Within R-sq.    =     0.0130
Number of clusters (dma_code) =        206        Root MSE        =     0.0934

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0645749   .0038249    16.88   0.000     .0570336    .0721161
post_merg~or |  -.0465185   .0041042   -11.33   0.000    -.0546103   -.0384267
       trend |  -.0025541   .0003967    -6.44   0.000    -.0033362    -.001772
       _cons |  -.0101344   .0031979    -3.17   0.002    -.0164394   -.0038294
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   1,    205) =     129.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9766
                                                  Adj R-squared   =     0.9748
                                                  Within R-sq.    =     0.0081
Number of clusters (dma_code) =        206        Root MSE        =     0.0916

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0468188   .0041068   -11.40   0.000    -.0549158   -.0387217
       _cons |   .0004543   .0017525     0.26   0.796     -.003001    .0039096
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   3,    205) =     139.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9758
                                                  Adj R-squared   =     0.9739
                                                  Within R-sq.    =     0.0131
Number of clusters (dma_code) =        206        Root MSE        =     0.0932

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0654968   .0038288    17.11   0.000     .0579478    .0730457
post_merg~or |  -.0466021   .0041009   -11.36   0.000    -.0546875   -.0385167
       trend |  -.0025858   .0003972    -6.51   0.000     -.003369   -.0018026
       _cons |  -.0102886   .0031956    -3.22   0.001    -.0165891   -.0039881
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   2,    205) =     188.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9781
                                                  Adj R-squared   =     0.9763
                                                  Within R-sq.    =     0.0139
Number of clusters (dma_code) =        206        Root MSE        =     0.0888

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0657786   .0034296    19.18   0.000     .0590167    .0725404
post_merg~or |  -.0480226   .0037714   -12.73   0.000    -.0554583    -.040587
       _cons |  -.0317548   .0011363   -27.94   0.000    -.0339952   -.0295144
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2199e+11)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    102,448
                                                F(2, 205)         =      66.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .57729

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0320604   .0028012    11.45   0.000     .0265376    .0375832
       trend |  -.0027338   .0004814    -5.68   0.000    -.0036829   -.0017846
       _cons |  -.0122908   .0090705    -1.36   0.177    -.0301742    .0055925
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 1 HDFE group                            F(   2,    205) =      63.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0245343   .0022783    10.77   0.000     .0200425    .0290261
       trend |  -.0025585   .0003968    -6.45   0.000    -.0033408   -.0017762
       _cons |  -.0100293   .0032001    -3.13   0.002    -.0163386     -.00372
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |   -.019525   1.94e-17 -1.0e+15   0.000     -.019525    -.019525
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   2,    205) =      61.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0253723   .0023938    10.60   0.000     .0206528    .0300918
       trend |  -.0025895   .0003973    -6.52   0.000    -.0033728   -.0018063
       _cons |  -.0101831   .0031976    -3.18   0.002    -.0164876   -.0038787
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   1,    205) =     114.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0244316   .0022878    10.68   0.000      .019921    .0289422
       _cons |   -.031679   .0011381   -27.84   0.000    -.0339229   -.0294351
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2199e+11)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    102,448
                                                F(4, 205)         =      42.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0037
                                                Root MSE          =     .57629

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0307116   .0411846    -0.75   0.457    -.1119114    .0504881
    post_hhi |  -.3933147   .1056235    -3.72   0.000    -.6015623   -.1850671
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .0849843   .0549799     1.55   0.124    -.0234143    .1933829
       trend |   -.002697   .0004863    -5.55   0.000    -.0036557   -.0017382
       _cons |    .278457   .0817467     3.41   0.001     .1172849     .439629
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.2199e+11)

Linear regression                               Number of obs     =    102,448
                                                F(4, 205)         =      42.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0037
                                                Root MSE          =     .57629

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0307116   .0411846    -0.75   0.457    -.1119114    .0504881
    post_hhi |  -.3933147   .1056235    -3.72   0.000    -.6015623   -.1850671
      np_HHI |   .0849843   .0549799     1.55   0.124    -.0234143    .1933829
       trend |   -.002697   .0004863    -5.55   0.000    -.0036557   -.0017382
       _cons |    .278457   .0817467     3.41   0.001     .1172849     .439629
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.2199e+11)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    102,448
                                                F(2, 205)         =      66.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .57729

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0320604   .0028012    11.45   0.000     .0265376    .0375832
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |  -.0027338   .0004814    -5.68   0.000    -.0036829   -.0017846
       _cons |  -.0122908   .0090705    -1.36   0.177    -.0301742    .0055925
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 1 HDFE group                            F(   3,    205) =      43.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0268348   .0265285     1.01   0.313    -.0254689    .0791385
     np_dhhi |          0  (omitted)
      np_HHI |  -.0031097     .03543    -0.09   0.930    -.0729636    .0667441
       trend |  -.0025585   .0003969    -6.45   0.000     -.003341   -.0017761
       _cons |  -.0100273   .0032078    -3.13   0.002    -.0163518   -.0037028
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 1 HDFE group                            F(   3,    205) =      43.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0268348   .0265285     1.01   0.313    -.0254689    .0791385
      np_HHI |  -.0031097     .03543    -0.09   0.930    -.0729636    .0667441
       trend |  -.0025585   .0003969    -6.45   0.000     -.003341   -.0017761
       _cons |  -.0100273   .0032078    -3.13   0.002    -.0163518   -.0037028
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 1 HDFE group                            F(   2,    205) =      63.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0245343   .0022783    10.77   0.000     .0200425    .0290261
     np_dhhi |          0  (omitted)
       trend |  -.0025585   .0003968    -6.45   0.000    -.0033408   -.0017762
       _cons |  -.0100293   .0032001    -3.13   0.002    -.0163386     -.00372
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   1,    205) =       0.01
Statistics robust to heteroskedasticity           Prob > F        =     0.9219
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |  -.0034708   .0353371    -0.10   0.922    -.0731415    .0661999
       _cons |  -.0182458   .0130245    -1.40   0.163     -.043925    .0074335
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   1,    205) =       0.01
Statistics robust to heteroskedasticity           Prob > F        =     0.9219
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0034708   .0353371    -0.10   0.922    -.0731415    .0661999
       _cons |  -.0182458   .0130245    -1.40   0.163     -.043925    .0074335
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |   -.019525   1.94e-17 -1.0e+15   0.000     -.019525    -.019525
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   3,    205) =      42.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0276018   .0265062     1.04   0.299    -.0246579    .0798615
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.0030141   .0354489    -0.09   0.932    -.0729053    .0668771
       trend |  -.0025895   .0003973    -6.52   0.000    -.0033728   -.0018063
       _cons |  -.0101813    .003205    -3.18   0.002    -.0165002   -.0038623
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   2,    205) =      58.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0162578   .0172964     0.94   0.348    -.0178438    .0503594
     np_dhhi |          0  (omitted)
      np_HHI |   .0110444   .0237257     0.47   0.642    -.0357334    .0578221
       _cons |  -.0316835   .0011395   -27.80   0.000    -.0339302   -.0294369
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   3,    205) =      42.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0276018   .0265062     1.04   0.299    -.0246579    .0798615
      np_HHI |  -.0030141   .0354489    -0.09   0.932    -.0729053    .0668771
       trend |  -.0025895   .0003973    -6.52   0.000    -.0033728   -.0018063
       _cons |  -.0101813    .003205    -3.18   0.002    -.0165002   -.0038623
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   2,    205) =      58.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0162578   .0172964     0.94   0.348    -.0178438    .0503594
      np_HHI |   .0110444   .0237257     0.47   0.642    -.0357334    .0578221
       _cons |  -.0316835   .0011395   -27.80   0.000    -.0339302   -.0294369
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   2,    205) =      61.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0253723   .0023938    10.60   0.000     .0206528    .0300918
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |  -.0025895   .0003973    -6.52   0.000    -.0033728   -.0018063
       _cons |  -.0101831   .0031976    -3.18   0.002    -.0164876   -.0038787
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,123
Absorbing 2 HDFE groups                           F(   1,    205) =     114.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0244316   .0022878    10.68   0.000      .019921    .0289422
     np_dhhi |          0  (omitted)
       _cons |   -.031679   .0011381   -27.84   0.000    -.0339229   -.0294351
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2142e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,350
                                                F(3, 205)         =      44.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .57723

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0320807   .0028114    11.41   0.000     .0265378    .0376237
log_hhinc_~j |   .0037577   .0116749     0.32   0.748    -.0192606    .0267761
       trend |  -.0027562   .0004891    -5.64   0.000    -.0037204   -.0017919
       _cons |  -.0501601    .117256    -0.43   0.669    -.2813425    .1810222
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 1 HDFE group                            F(   3,    205) =      42.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0055
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .024532   .0022842    10.74   0.000     .0200284    .0290355
log_hhinc_~j |    .002737   .0020283     1.35   0.179     -.001262     .006736
       trend |  -.0025736   .0003971    -6.48   0.000    -.0033565   -.0017907
       _cons |  -.0376187   .0208474    -1.80   0.073    -.0787214    .0034841
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   1,    205) =       0.17
Statistics robust to heteroskedasticity           Prob > F        =     0.6793
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |  -.0006814   .0016462    -0.41   0.679     -.003927    .0025641
       _cons |  -.0126484   .0166596    -0.76   0.449    -.0454946    .0201977
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   3,    205) =      41.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0056
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0253537   .0023971    10.58   0.000     .0206276    .0300797
log_hhinc_~j |   .0027874   .0020572     1.35   0.177    -.0012686    .0068434
       trend |  -.0026033   .0003976    -6.55   0.000    -.0033873   -.0018194
       _cons |  -.0382856    .021129    -1.81   0.071    -.0799437    .0033724
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   2,    205) =      56.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0054
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0244222   .0022928    10.65   0.000     .0199016    .0289428
log_hhinc_~j |   .0042258   .0020374     2.07   0.039     .0002089    .0082427
       _cons |  -.0744602   .0208142    -3.58   0.000    -.1154976   -.0334228
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2142e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,350
                                                F(4, 205)         =    1215.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1752
                                                Root MSE          =     .52427

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .875513   .0142138    61.60   0.000      .847489     .903537
post_merg~or |  -.9803297   .0145713   -67.28   0.000    -1.009058   -.9516009
       trend |  -.0030277   .0004766    -6.35   0.000    -.0039675    -.002088
log_hhinc_~j |   .0013561   .0112733     0.12   0.904    -.0208704    .0235826
       _cons |  -.0248232   .1130888    -0.22   0.826    -.2477894     .198143
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 1 HDFE group                            F(   4,    205) =     102.53
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9757
                                                  Adj R-squared   =     0.9738
                                                  Within R-sq.    =     0.0132
Number of clusters (dma_code) =        206        Root MSE        =     0.0934

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0645996   .0038325    16.86   0.000     .0570435    .0721557
post_merg~or |  -.0465399   .0041087   -11.33   0.000    -.0546405   -.0384392
       trend |  -.0025699   .0003971    -6.47   0.000    -.0033528    -.001787
log_hhinc_~j |   .0027516   .0020273     1.36   0.176    -.0012454    .0067486
       _cons |  -.0378687   .0208358    -1.82   0.071    -.0789486    .0032113
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   2,    205) =      65.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9766
                                                  Adj R-squared   =     0.9748
                                                  Within R-sq.    =     0.0081
Number of clusters (dma_code) =        206        Root MSE        =     0.0917

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   -.046832   .0041128   -11.39   0.000    -.0549407   -.0387232
log_hhinc_~j |  -.0006696   .0016482    -0.41   0.685    -.0039191      .00258
       _cons |   .0072175     .01697     0.43   0.671    -.0262405    .0406755
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   4,    205) =     104.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9758
                                                  Adj R-squared   =     0.9739
                                                  Within R-sq.    =     0.0133
Number of clusters (dma_code) =        206        Root MSE        =     0.0932

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0655046   .0038362    17.08   0.000     .0579413     .073068
post_merg~or |  -.0466236   .0041055   -11.36   0.000     -.054718   -.0385292
log_hhinc_~j |   .0028021    .002056     1.36   0.174    -.0012516    .0068558
       trend |  -.0026003   .0003977    -6.54   0.000    -.0033843   -.0018163
       _cons |  -.0385367   .0211157    -1.83   0.069    -.0801685    .0030952
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   3,    205) =     125.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9781
                                                  Adj R-squared   =     0.9763
                                                  Within R-sq.    =     0.0144
Number of clusters (dma_code) =        206        Root MSE        =     0.0888

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0658034   .0034415    19.12   0.000     .0590181    .0725887
post_merg~or |  -.0480534   .0037774   -12.72   0.000     -.055501   -.0406058
log_hhinc_~j |   .0042494   .0020376     2.09   0.038      .000232    .0082668
       _cons |  -.0747772    .020808    -3.59   0.000    -.1158023   -.0337521
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.2142e+11)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    102,350
                                                F(3, 205)         =      44.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .57723

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0320807   .0028114    11.41   0.000     .0265378    .0376237
       trend |  -.0027562   .0004891    -5.64   0.000    -.0037204   -.0017919
log_hhinc_~j |   .0037577   .0116749     0.32   0.748    -.0192606    .0267761
       _cons |  -.0501601    .117256    -0.43   0.669    -.2813425    .1810222
------------------------------------------------------------------------------
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 1 HDFE group                            F(   3,    205) =      42.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9736
                                                  Within R-sq.    =     0.0055
Number of clusters (dma_code) =        206        Root MSE        =     0.0938

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    .024532   .0022842    10.74   0.000     .0200284    .0290355
       trend |  -.0025736   .0003971    -6.48   0.000    -.0033565   -.0017907
log_hhinc_~j |    .002737   .0020283     1.35   0.179     -.001262     .006736
       _cons |  -.0376187   .0208474    -1.80   0.073    -.0787214    .0034841
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   1,    205) =       0.17
Statistics robust to heteroskedasticity           Prob > F        =     0.6793
                                                  R-squared       =     0.9764
                                                  Adj R-squared   =     0.9746
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0920

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |  -.0006814   .0016462    -0.41   0.679     -.003927    .0025641
       _cons |  -.0126484   .0166596    -0.76   0.449    -.0454946    .0201977
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7276        7276           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   3,    205) =      41.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9756
                                                  Adj R-squared   =     0.9737
                                                  Within R-sq.    =     0.0056
Number of clusters (dma_code) =        206        Root MSE        =     0.0936

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0253537   .0023971    10.58   0.000     .0206276    .0300797
       trend |  -.0026033   .0003976    -6.55   0.000    -.0033873   -.0018194
log_hhinc_~j |   .0027874   .0020572     1.35   0.177    -.0012686    .0068434
       _cons |  -.0382856    .021129    -1.81   0.071    -.0799437    .0033724
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7276        7276           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 325 singleton observations)
(MWFE estimator converged in 8 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,025
Absorbing 2 HDFE groups                           F(   2,    205) =      56.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9761
                                                  Within R-sq.    =     0.0054
Number of clusters (dma_code) =        206        Root MSE        =     0.0892

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0244222   .0022928    10.65   0.000     .0199016    .0289428
log_hhinc_~j |   .0042258   .0020374     2.07   0.039     .0002089    .0082427
       _cons |  -.0744602   .0208142    -3.58   0.000    -.1154976   -.0334228
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7276        7276           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0834e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(2, 205)         =       9.02
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0001
                                                Root MSE          =     .73025

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0211449   .0050664     4.17   0.000      .011156    .0311338
       trend |  -.0021107   .0007052    -2.99   0.003     -.003501   -.0007204
       _cons |   .7142847   .0176965    40.36   0.000     .6793942    .7491751
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =      82.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0075
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0225374   .0028122     8.01   0.000     .0169929     .028082
       trend |  -.0040682   .0004448    -9.15   0.000    -.0049452   -.0031911
       _cons |    .731134   .0041483   176.25   0.000     .7229552    .7393128
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1426

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   .7079578   1.92e-17  3.7e+16   0.000     .7079578    .7079578
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      74.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        206        Root MSE        =     0.1429

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0237717    .003331     7.14   0.000     .0172042    .0303391
       trend |   -.004189   .0004381    -9.56   0.000    -.0050529   -.0033252
       _cons |   .7315422   .0041299   177.14   0.000     .7233997    .7396846
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =      64.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        206        Root MSE        =     0.1420

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0224184   .0027869     8.04   0.000     .0169238     .027913
       _cons |   .6968376   .0013824   504.09   0.000     .6941121    .6995631
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0834e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(3, 205)         =     246.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0933
                                                Root MSE          =     .69536

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .3516227   .0151681    23.18   0.000     .3217173     .381528
post_merg~or |  -.6330406   .0237559   -26.65   0.000    -.6798779   -.5862033
       trend |  -.0038045   .0008226    -4.62   0.000    -.0054264   -.0021826
       _cons |   .7211057   .0181465    39.74   0.000     .6853281    .7568834
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   3,    205) =     104.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9647
                                                  Adj R-squared   =     0.9620
                                                  Within R-sq.    =     0.0175
Number of clusters (dma_code) =        206        Root MSE        =     0.1423

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0531006   .0034548    15.37   0.000     .0462891    .0599121
post_merg~or |   -.058004   .0087415    -6.64   0.000    -.0752388   -.0407692
       trend |  -.0041707   .0004486    -9.30   0.000    -.0050553   -.0032862
       _cons |   .7312067   .0041656   175.53   0.000     .7229938    .7394196
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =      44.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9622
                                                  Within R-sq.    =     0.0100
Number of clusters (dma_code) =        206        Root MSE        =     0.1419

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0576388   .0086623    -6.65   0.000    -.0747175   -.0405602
       _cons |   .7222343   .0021456   336.62   0.000     .7180041    .7264645
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   3,    205) =     111.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9648
                                                  Adj R-squared   =     0.9620
                                                  Within R-sq.    =     0.0176
Number of clusters (dma_code) =        206        Root MSE        =     0.1422

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0542729   .0031894    17.02   0.000     .0479847    .0605612
post_merg~or |   -.057906   .0087568    -6.61   0.000     -.075171   -.0406409
       trend |  -.0042887   .0004418    -9.71   0.000    -.0051597   -.0034177
       _cons |   .7315973    .004147   176.42   0.000     .7234211    .7397734
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =     150.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9654
                                                  Adj R-squared   =     0.9625
                                                  Within R-sq.    =     0.0121
Number of clusters (dma_code) =        206        Root MSE        =     0.1413

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0534394   .0035548    15.03   0.000     .0464307    .0604481
post_merg~or |  -.0589227   .0088957    -6.62   0.000    -.0764614   -.0413839
       _cons |   .6960447   .0013471   516.70   0.000     .6933888    .6987006
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0834e+11)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(2, 205)         =       9.02
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0001
                                                Root MSE          =     .73025

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0211449   .0050664     4.17   0.000      .011156    .0311338
       trend |  -.0021107   .0007052    -2.99   0.003     -.003501   -.0007204
       _cons |   .7142847   .0176965    40.36   0.000     .6793942    .7491751
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =      82.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0075
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0225374   .0028122     8.01   0.000     .0169929     .028082
       trend |  -.0040682   .0004448    -9.15   0.000    -.0049452   -.0031911
       _cons |    .731134   .0041483   176.25   0.000     .7229552    .7393128
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1426

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |   .7079578   1.92e-17  3.7e+16   0.000     .7079578    .7079578
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      74.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        206        Root MSE        =     0.1429

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0237717    .003331     7.14   0.000     .0172042    .0303391
       trend |   -.004189   .0004381    -9.56   0.000    -.0050529   -.0033252
       _cons |   .7315422   .0041299   177.14   0.000     .7233997    .7396846
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =      64.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        206        Root MSE        =     0.1420

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0224184   .0027869     8.04   0.000     .0169238     .027913
       _cons |   .6968376   .0013824   504.09   0.000     .6941121    .6995631
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0834e+11)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(4, 205)         =       5.67
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0021
                                                Root MSE          =     .72952

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0065292   .0497136     0.13   0.896    -.0914863    .1045447
    post_hhi |  -.3944205   .1505858    -2.62   0.009     -.691316    -.097525
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .0211433   .0732924     0.29   0.773    -.1233602    .1656468
       trend |  -.0021654   .0007212    -3.00   0.003    -.0035872   -.0007435
       _cons |   .9845122   .1097649     8.97   0.000     .7680993    1.200925
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   1.0834e+11)

Linear regression                               Number of obs     =    103,069
                                                F(4, 205)         =       5.67
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0021
                                                Root MSE          =     .72952

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0065292   .0497136     0.13   0.896    -.0914863    .1045447
    post_hhi |  -.3944205   .1505858    -2.62   0.009     -.691316    -.097525
      np_HHI |   .0211433   .0732924     0.29   0.773    -.1233602    .1656468
       trend |  -.0021654   .0007212    -3.00   0.003    -.0035872   -.0007435
       _cons |   .9845122   .1097649     8.97   0.000     .7680993    1.200925
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   1.0834e+11)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    103,069
                                                F(2, 205)         =       9.02
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0001
                                                Root MSE          =     .73025

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0211449   .0050664     4.17   0.000      .011156    .0311338
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |  -.0021107   .0007052    -2.99   0.003     -.003501   -.0007204
       _cons |   .7142847   .0176965    40.36   0.000     .6793942    .7491751
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   3,    205) =      51.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0541361   .0312825     1.73   0.085    -.0075406    .1158128
     np_dhhi |          0  (omitted)
      np_HHI |  -.0461954   .0443244    -1.04   0.299    -.1335856    .0411948
       trend |  -.0040721   .0004433    -9.19   0.000    -.0049461   -.0031981
       _cons |   .7311372   .0041288   177.08   0.000     .7229967    .7392776
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   3,    205) =      51.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0541361   .0312825     1.73   0.085    -.0075406    .1158128
      np_HHI |  -.0461954   .0443244    -1.04   0.299    -.1335856    .0411948
       trend |  -.0040721   .0004433    -9.19   0.000    -.0049461   -.0031981
       _cons |   .7311372   .0041288   177.08   0.000     .7229967    .7392776
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =      82.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0075
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0225374   .0028122     8.01   0.000     .0169929     .028082
     np_dhhi |          0  (omitted)
       trend |  -.0040682   .0004448    -9.15   0.000    -.0049452   -.0031911
       _cons |    .731134   .0041483   176.25   0.000     .7229552    .7393128
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =       1.11
Statistics robust to heteroskedasticity           Prob > F        =     0.2928
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        206        Root MSE        =     0.1426

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |  -.0467235   .0443017    -1.05   0.293    -.1340689    .0406218
       _cons |   .7237808   .0150028    48.24   0.000     .6942012    .7533603
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =       1.11
Statistics robust to heteroskedasticity           Prob > F        =     0.2928
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        206        Root MSE        =     0.1426

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0467235   .0443017    -1.05   0.293    -.1340689    .0406218
       _cons |   .7237808   .0150028    48.24   0.000     .6942012    .7533603
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.1426

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |   .7079578   1.92e-17  3.7e+16   0.000     .7079578    .7079578
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   3,    205) =      47.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9617
                                                  Within R-sq.    =     0.0079
Number of clusters (dma_code) =        206        Root MSE        =     0.1429

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0553013   .0316012     1.75   0.082    -.0070037    .1176064
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.0461068   .0443238    -1.04   0.299    -.1334958    .0412822
       trend |  -.0041923   .0004368    -9.60   0.000    -.0050536    -.003331
       _cons |   .7315443   .0041079   178.08   0.000     .7234451    .7396435
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      35.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        206        Root MSE        =     0.1420

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .015586   .0178382     0.87   0.383    -.0195839    .0507559
     np_dhhi |          0  (omitted)
      np_HHI |    .009985   .0248281     0.40   0.688    -.0389661    .0589362
       _cons |   .6968453   .0013759   506.45   0.000     .6941325    .6995581
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   3,    205) =      47.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9617
                                                  Within R-sq.    =     0.0079
Number of clusters (dma_code) =        206        Root MSE        =     0.1429

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0553013   .0316012     1.75   0.082    -.0070037    .1176064
      np_HHI |  -.0461068   .0443238    -1.04   0.299    -.1334958    .0412822
       trend |  -.0041923   .0004368    -9.60   0.000    -.0050536    -.003331
       _cons |   .7315443   .0041079   178.08   0.000     .7234451    .7396435
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      35.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        206        Root MSE        =     0.1420

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .015586   .0178382     0.87   0.383    -.0195839    .0507559
      np_HHI |    .009985   .0248281     0.40   0.688    -.0389661    .0589362
       _cons |   .6968453   .0013759   506.45   0.000     .6941325    .6995581
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   2,    205) =      74.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        206        Root MSE        =     0.1429

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0237717    .003331     7.14   0.000     .0172042    .0303391
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   -.004189   .0004381    -9.56   0.000    -.0050529   -.0033252
       _cons |   .7315422   .0041299   177.14   0.000     .7233997    .7396846
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 2 HDFE groups                           F(   1,    205) =      64.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        206        Root MSE        =     0.1420

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0224184   .0027869     8.04   0.000     .0169238     .027913
     np_dhhi |          0  (omitted)
       _cons |   .6968376   .0013824   504.09   0.000     .6941121    .6995631
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0817e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,971
                                                F(3, 205)         =       5.24
                                                Prob > F          =     0.0017
                                                R-squared         =     0.0003
                                                Root MSE          =     .73007

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0218304   .0056139     3.89   0.000     .0107619    .0328988
log_hhinc_~j |   .0224122   .0191395     1.17   0.243    -.0153234    .0601478
       trend |  -.0022644   .0007426    -3.05   0.003    -.0037285   -.0008004
       _cons |   .4853947    .190015     2.55   0.011     .1107604    .8600291
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   3,    205) =      58.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0076
Number of clusters (dma_code) =        206        Root MSE        =     0.1431

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0226618    .002911     7.78   0.000     .0169223    .0284012
log_hhinc_~j |   .0051208   .0033063     1.55   0.123     -.001398    .0116396
       trend |  -.0040997    .000433    -9.47   0.000    -.0049534   -.0032459
       _cons |   .6786725   .0358105    18.95   0.000     .6080683    .7492767
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   1,    205) =       1.98
Statistics robust to heteroskedasticity           Prob > F        =     0.1609
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        206        Root MSE        =     0.1427

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |   .0040064   .0028472     1.41   0.161    -.0016072      .00962
       _cons |   .6667118   .0291748    22.85   0.000     .6091906     .724233
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   3,    205) =      52.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0078
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0238581   .0034235     6.97   0.000     .0171084    .0306078
log_hhinc_~j |   .0049311   .0033169     1.49   0.139    -.0016086    .0114707
       trend |  -.0042166   .0004287    -9.84   0.000    -.0050618   -.0033714
       _cons |   .6810113   .0358836    18.98   0.000      .610263    .7517596
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   2,    205) =      30.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0019
Number of clusters (dma_code) =        206        Root MSE        =     0.1421

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .022585   .0029005     7.79   0.000     .0168663    .0283037
log_hhinc_~j |   .0063645    .003004     2.12   0.035     .0004419    .0122872
       _cons |   .6313455   .0313065    20.17   0.000     .5696216    .6930695
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0817e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =    102,971
                                                F(4, 205)         =     183.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0937
                                                Root MSE          =     .69513

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .3529886   .0157667    22.39   0.000     .3219029    .3840743
post_merg~or |  -.6334801   .0238057   -26.61   0.000    -.6804155   -.5865447
       trend |  -.0040132   .0008667    -4.63   0.000     -.005722   -.0023044
log_hhinc_~j |   .0265858   .0198406     1.34   0.182    -.0125319    .0657035
       _cons |   .4497226   .1975451     2.28   0.024      .060242    .8392032
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   4,    205) =      86.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9647
                                                  Adj R-squared   =     0.9620
                                                  Within R-sq.    =     0.0177
Number of clusters (dma_code) =        206        Root MSE        =     0.1423

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0533243   .0033695    15.83   0.000     .0466808    .0599677
post_merg~or |  -.0581297   .0087484    -6.64   0.000     -.075378   -.0408813
       trend |  -.0042052   .0004365    -9.63   0.000    -.0050659   -.0033445
log_hhinc_~j |   .0051878   .0032906     1.58   0.116    -.0012999    .0116755
       _cons |   .6780698   .0357062    18.99   0.000     .6076712    .7484683
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   2,    205) =      35.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9649
                                                  Adj R-squared   =     0.9622
                                                  Within R-sq.    =     0.0101
Number of clusters (dma_code) =        206        Root MSE        =     0.1420

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0577609    .008668    -6.66   0.000    -.0748507    -.040671
log_hhinc_~j |   .0040973   .0028365     1.44   0.150    -.0014951    .0096898
       _cons |   .6800906   .0301139    22.58   0.000     .6207179    .7394633
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   4,    205) =      89.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9648
                                                  Adj R-squared   =     0.9620
                                                  Within R-sq.    =     0.0178
Number of clusters (dma_code) =        206        Root MSE        =     0.1423

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0544555   .0031278    17.41   0.000     .0482887    .0606223
post_merg~or |  -.0580302   .0087635    -6.62   0.000    -.0753084    -.040752
log_hhinc_~j |   .0050048   .0033018     1.52   0.131     -.001505    .0115146
       trend |  -.0043191    .000432   -10.00   0.000    -.0051709   -.0034674
       _cons |   .6803208   .0357824    19.01   0.000      .609772    .7508695
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   3,    205) =     102.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9654
                                                  Adj R-squared   =     0.9625
                                                  Within R-sq.    =     0.0124
Number of clusters (dma_code) =        206        Root MSE        =     0.1414

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0536855   .0034822    15.42   0.000     .0468199     .060551
post_merg~or |  -.0590227   .0089154    -6.62   0.000    -.0766003   -.0414451
log_hhinc_~j |   .0063113    .003003     2.10   0.037     .0003907     .012232
       _cons |   .6310866    .031357    20.13   0.000     .5692631    .6929101
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.0817e+11)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    102,971
                                                F(3, 205)         =       5.24
                                                Prob > F          =     0.0017
                                                R-squared         =     0.0003
                                                Root MSE          =     .73007

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0218304   .0056139     3.89   0.000     .0107619    .0328988
       trend |  -.0022644   .0007426    -3.05   0.003    -.0037285   -.0008004
log_hhinc_~j |   .0224122   .0191395     1.17   0.243    -.0153234    .0601478
       _cons |   .4853947    .190015     2.55   0.011     .1107604    .8600291
------------------------------------------------------------------------------
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   3,    205) =      58.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0076
Number of clusters (dma_code) =        206        Root MSE        =     0.1431

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0226618    .002911     7.78   0.000     .0169223    .0284012
       trend |  -.0040997    .000433    -9.47   0.000    -.0049534   -.0032459
log_hhinc_~j |   .0051208   .0033063     1.55   0.123     -.001398    .0116396
       _cons |   .6786725   .0358105    18.95   0.000     .6080683    .7492767
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   1,    205) =       1.98
Statistics robust to heteroskedasticity           Prob > F        =     0.1609
                                                  R-squared       =     0.9646
                                                  Adj R-squared   =     0.9618
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        206        Root MSE        =     0.1427

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |   .0040064   .0028472     1.41   0.161    -.0016072      .00962
       _cons |   .6667118   .0291748    22.85   0.000     .6091906     .724233
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   3,    205) =      52.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9644
                                                  Adj R-squared   =     0.9616
                                                  Within R-sq.    =     0.0078
Number of clusters (dma_code) =        206        Root MSE        =     0.1430

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0238581   .0034235     6.97   0.000     .0171084    .0306078
       trend |  -.0042166   .0004287    -9.84   0.000    -.0050618   -.0033714
log_hhinc_~j |   .0049311   .0033169     1.49   0.139    -.0016086    .0114707
       _cons |   .6810113   .0358836    18.98   0.000      .610263    .7517596
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 336 singleton observations)
(MWFE estimator converged in 9 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 2 HDFE groups                           F(   2,    205) =      30.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9650
                                                  Adj R-squared   =     0.9621
                                                  Within R-sq.    =     0.0019
Number of clusters (dma_code) =        206        Root MSE        =     0.1421

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    .022585   .0029005     7.79   0.000     .0168663    .0283037
log_hhinc_~j |   .0063645    .003004     2.12   0.035     .0004419    .0122872
       _cons |   .6313455   .0313065    20.17   0.000     .5696216    .6930695
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      7446        7446           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0627e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     99,529
                                                F(2, 205)         =      19.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0003
                                                Root MSE          =      .5929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0198611   .0046121     4.31   0.000     .0107678    .0289544
       trend |  -.0032765   .0005793    -5.66   0.000    -.0044185   -.0021344
       _cons |   .0168721   .0239525     0.70   0.482    -.0303528     .064097
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 1 HDFE group                            F(   2,    205) =      22.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9769
                                                  Adj R-squared   =     0.9753
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0932

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0196278   .0034769     5.65   0.000     .0127728    .0264828
       trend |  -.0024486   .0005001    -4.90   0.000    -.0034347   -.0014625
       _cons |   .0100228   .0040928     2.45   0.015     .0019534    .0180921
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9775
                                                  Adj R-squared   =     0.9759
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0921

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |  -.0009195   5.94e-19 -1.5e+15   0.000    -.0009195   -.0009195
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   2,    205) =      22.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9771
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0051
Number of clusters (dma_code) =        206        Root MSE        =     0.0930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0208076   .0036499     5.70   0.000     .0136114    .0280037
       trend |  -.0025276   .0005061    -4.99   0.000    -.0035255   -.0015297
       _cons |   .0101071   .0041125     2.46   0.015     .0019988    .0182153
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   1,    205) =      30.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9784
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        206        Root MSE        =     0.0903

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0196444   .0035664     5.51   0.000     .0126129    .0266759
       _cons |  -.0105865    .001755    -6.03   0.000    -.0140467   -.0071263
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0627e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     99,529
                                                F(3, 205)         =      56.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0922
                                                Root MSE          =     .56499

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .5412971   .0744826     7.27   0.000     .3944468    .6881473
post_merg~or |  -.6457823   .0839856    -7.69   0.000    -.8113686    -.480196
       trend |  -.0035163   .0005937    -5.92   0.000    -.0046869   -.0023458
       _cons |   .0178371   .0239249     0.75   0.457    -.0293334    .0650076
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 1 HDFE group                            F(   3,    205) =      57.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9773
                                                  Adj R-squared   =     0.9757
                                                  Within R-sq.    =     0.0207
Number of clusters (dma_code) =        206        Root MSE        =     0.0925

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0659146   .0052431    12.57   0.000     .0555773     .076252
post_merg~or |   -.057339   .0059595    -9.62   0.000    -.0690887   -.0455893
       trend |  -.0024692   .0005023    -4.92   0.000    -.0034596   -.0014787
       _cons |   .0101079   .0039717     2.55   0.012     .0022774    .0179384
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   1,    205) =      93.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9779
                                                  Adj R-squared   =     0.9763
                                                  Within R-sq.    =     0.0162
Number of clusters (dma_code) =        206        Root MSE        =     0.0913

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0573809     .00595    -9.64   0.000    -.0691119   -.0456498
       _cons |    .021787   .0023545     9.25   0.000     .0171449    .0264292
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   3,    205) =      55.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9774
                                                  Adj R-squared   =     0.9758
                                                  Within R-sq.    =     0.0209
Number of clusters (dma_code) =        206        Root MSE        =     0.0923

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0671402   .0054226    12.38   0.000     .0564491    .0778313
post_merg~or |  -.0573888   .0059576    -9.63   0.000    -.0691348   -.0456428
       trend |  -.0025484   .0005086    -5.01   0.000    -.0035511   -.0015457
       _cons |   .0101911   .0039916     2.55   0.011     .0023213     .018061
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   2,    205) =      61.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9788
                                                  Adj R-squared   =     0.9771
                                                  Within R-sq.    =     0.0172
Number of clusters (dma_code) =        206        Root MSE        =     0.0897

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0626263   .0056539    11.08   0.000     .0514791    .0737736
post_merg~or |  -.0532492   .0063618    -8.37   0.000    -.0657922   -.0407062
       _cons |  -.0106664   .0017535    -6.08   0.000    -.0141235   -.0072093
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0627e+09)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =     99,529
                                                F(2, 205)         =      19.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0003
                                                Root MSE          =      .5929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0198611   .0046121     4.31   0.000     .0107678    .0289544
       trend |  -.0032765   .0005793    -5.66   0.000    -.0044185   -.0021344
       _cons |   .0168721   .0239525     0.70   0.482    -.0303528     .064097
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 1 HDFE group                            F(   2,    205) =      22.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9769
                                                  Adj R-squared   =     0.9753
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0932

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0196278   .0034769     5.65   0.000     .0127728    .0264828
       trend |  -.0024486   .0005001    -4.90   0.000    -.0034347   -.0014625
       _cons |   .0100228   .0040928     2.45   0.015     .0019534    .0180921
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9775
                                                  Adj R-squared   =     0.9759
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0921

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |  -.0009195   5.94e-19 -1.5e+15   0.000    -.0009195   -.0009195
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   2,    205) =      22.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9771
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0051
Number of clusters (dma_code) =        206        Root MSE        =     0.0930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0208076   .0036499     5.70   0.000     .0136114    .0280037
       trend |  -.0025276   .0005061    -4.99   0.000    -.0035255   -.0015297
       _cons |   .0101071   .0041125     2.46   0.015     .0019988    .0182153
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   1,    205) =      30.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9784
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        206        Root MSE        =     0.0903

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0196444   .0035664     5.51   0.000     .0126129    .0266759
       _cons |  -.0105865    .001755    -6.03   0.000    -.0140467   -.0071263
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0627e+09)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =     99,529
                                                F(4, 205)         =      16.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0025
                                                Root MSE          =     .59226

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .1356029   .0297689     4.56   0.000     .0769104    .1942953
    post_hhi |  -.2211157   .2794606    -0.79   0.430    -.7721013    .3298699
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.1687315    .043992    -3.84   0.000    -.2554663   -.0819968
       trend |  -.0032824   .0005751    -5.71   0.000    -.0044163   -.0021486
       _cons |   .1688091   .2077179     0.81   0.417    -.2407283    .5783466
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   3.0627e+09)

Linear regression                               Number of obs     =     99,529
                                                F(4, 205)         =      16.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0025
                                                Root MSE          =     .59226

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .1356029   .0297689     4.56   0.000     .0769104    .1942953
    post_hhi |  -.2211157   .2794606    -0.79   0.430    -.7721013    .3298699
      np_HHI |  -.1687315    .043992    -3.84   0.000    -.2554663   -.0819968
       trend |  -.0032824   .0005751    -5.71   0.000    -.0044163   -.0021486
       _cons |   .1688091   .2077179     0.81   0.417    -.2407283    .5783466
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   3.0627e+09)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =     99,529
                                                F(2, 205)         =      19.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0003
                                                Root MSE          =      .5929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0198611   .0046121     4.31   0.000     .0107678    .0289544
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |  -.0032765   .0005793    -5.66   0.000    -.0044185   -.0021344
       _cons |   .0168721   .0239525     0.70   0.482    -.0303528     .064097
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 1 HDFE group                            F(   3,    205) =      22.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9771
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0115
Number of clusters (dma_code) =        206        Root MSE        =     0.0929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .1344916   .0247212     5.44   0.000     .0857512    .1832319
     np_dhhi |          0  (omitted)
      np_HHI |  -.1672176   .0367724    -4.55   0.000    -.2397182    -.094717
       trend |  -.0024611   .0005005    -4.92   0.000    -.0034478   -.0014744
       _cons |   .0100881   .0037141     2.72   0.007     .0027654    .0174108
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 1 HDFE group                            F(   3,    205) =      22.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9771
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0115
Number of clusters (dma_code) =        206        Root MSE        =     0.0929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .1344916   .0247212     5.44   0.000     .0857512    .1832319
      np_HHI |  -.1672176   .0367724    -4.55   0.000    -.2397182    -.094717
       trend |  -.0024611   .0005005    -4.92   0.000    -.0034478   -.0014744
       _cons |   .0100881   .0037141     2.72   0.007     .0027654    .0174108
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 1 HDFE group                            F(   2,    205) =      22.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9769
                                                  Adj R-squared   =     0.9753
                                                  Within R-sq.    =     0.0050
Number of clusters (dma_code) =        206        Root MSE        =     0.0932

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0196278   .0034769     5.65   0.000     .0127728    .0264828
     np_dhhi |          0  (omitted)
       trend |  -.0024486   .0005001    -4.90   0.000    -.0034347   -.0014625
       _cons |   .0100228   .0040928     2.45   0.015     .0019534    .0180921
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   1,    205) =      20.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9777
                                                  Adj R-squared   =     0.9760
                                                  Within R-sq.    =     0.0067
Number of clusters (dma_code) =        206        Root MSE        =     0.0918

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |  -.1672863   .0366901    -4.56   0.000    -.2396246    -.094948
       _cons |   .0555885   .0123936     4.49   0.000     .0311532    .0800237
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   1,    205) =      20.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9777
                                                  Adj R-squared   =     0.9760
                                                  Within R-sq.    =     0.0067
Number of clusters (dma_code) =        206        Root MSE        =     0.0918

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.1672863   .0366901    -4.56   0.000    -.2396246    -.094948
       _cons |   .0555885   .0123936     4.49   0.000     .0311532    .0800237
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9775
                                                  Adj R-squared   =     0.9759
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.0921

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |  -.0009195   5.94e-19 -1.5e+15   0.000    -.0009195   -.0009195
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   3,    205) =      22.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9772
                                                  Adj R-squared   =     0.9756
                                                  Within R-sq.    =     0.0117
Number of clusters (dma_code) =        206        Root MSE        =     0.0927

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .1357215    .024706     5.49   0.000      .087011    .1844319
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.1672976   .0368184    -4.54   0.000    -.2398889   -.0947064
       trend |  -.0025397   .0005067    -5.01   0.000    -.0035388   -.0015406
       _cons |   .0101711   .0037353     2.72   0.007     .0028067    .0175356
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   2,    205) =      32.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9785
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.0903

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0532647   .0219392     2.43   0.016     .0100094      .09652
     np_dhhi |          0  (omitted)
      np_HHI |  -.0489559   .0348108    -1.41   0.161    -.1175891    .0196772
       _cons |  -.0105942   .0017529    -6.04   0.000    -.0140501   -.0071382
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   3,    205) =      22.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9772
                                                  Adj R-squared   =     0.9756
                                                  Within R-sq.    =     0.0117
Number of clusters (dma_code) =        206        Root MSE        =     0.0927

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .1357215    .024706     5.49   0.000      .087011    .1844319
      np_HHI |  -.1672976   .0368184    -4.54   0.000    -.2398889   -.0947064
       trend |  -.0025397   .0005067    -5.01   0.000    -.0035388   -.0015406
       _cons |   .0101711   .0037353     2.72   0.007     .0028067    .0175356
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   2,    205) =      32.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9785
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        206        Root MSE        =     0.0903

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0532647   .0219392     2.43   0.016     .0100094      .09652
      np_HHI |  -.0489559   .0348108    -1.41   0.161    -.1175891    .0196772
       _cons |  -.0105942   .0017529    -6.04   0.000    -.0140501   -.0071382
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   2,    205) =      22.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9771
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0051
Number of clusters (dma_code) =        206        Root MSE        =     0.0930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0208076   .0036499     5.70   0.000     .0136114    .0280037
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |  -.0025276   .0005061    -4.99   0.000    -.0035255   -.0015297
       _cons |   .0101071   .0041125     2.46   0.015     .0019988    .0182153
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,461
Absorbing 2 HDFE groups                           F(   1,    205) =      30.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9784
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        206        Root MSE        =     0.0903

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0196444   .0035664     5.51   0.000     .0126129    .0266759
     np_dhhi |          0  (omitted)
       _cons |  -.0105865    .001755    -6.03   0.000    -.0140467   -.0071263
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0560e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     99,431
                                                F(3, 205)         =      12.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0006
                                                Root MSE          =     .59273

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0205186   .0050104     4.10   0.000       .01064    .0303973
log_hhinc_~j |   .0210587   .0344278     0.61   0.541    -.0468193    .0889367
       trend |  -.0034064    .000625    -5.45   0.000    -.0046386   -.0021742
       _cons |   -.197867   .3379325    -0.59   0.559    -.8641359    .4684019
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 1 HDFE group                            F(   3,    205) =      14.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9769
                                                  Adj R-squared   =     0.9752
                                                  Within R-sq.    =     0.0052
Number of clusters (dma_code) =        206        Root MSE        =     0.0933

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0197369   .0035605     5.54   0.000      .012717    .0267567
log_hhinc_~j |   .0032398   .0029945     1.08   0.281    -.0026641    .0091437
       trend |    -.00247   .0005007    -4.93   0.000    -.0034571   -.0014829
       _cons |   -.022882    .031535    -0.73   0.469    -.0850565    .0392926
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   1,    205) =       0.54
Statistics robust to heteroskedasticity           Prob > F        =     0.4651
                                                  R-squared       =     0.9775
                                                  Adj R-squared   =     0.9758
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        206        Root MSE        =     0.0922

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |   .0016622    .002271     0.73   0.465    -.0028153    .0061398
       _cons |  -.0177946   .0232568    -0.77   0.445    -.0636478    .0280585
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   3,    205) =      14.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9770
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0931

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0208895   .0037266     5.61   0.000     .0135421    .0282369
log_hhinc_~j |   .0031201   .0030646     1.02   0.310     -.002922    .0091622
       trend |  -.0025461   .0005069    -5.02   0.000    -.0035456   -.0015466
       _cons |  -.0215827   .0322324    -0.67   0.504    -.0851323    .0419669
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   2,    205) =      14.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9784
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0035
Number of clusters (dma_code) =        206        Root MSE        =     0.0904

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0197799   .0036829     5.37   0.000     .0125187    .0270411
log_hhinc_~j |   .0047855   .0031573     1.52   0.131    -.0014395    .0110105
       _cons |  -.0595127    .033127    -1.80   0.074     -.124826    .0058007
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0560e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     99,431
                                                F(4, 205)         =      47.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0933
                                                Root MSE          =     .56457

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .5455696   .0744444     7.33   0.000     .3987948    .6923443
post_merg~or |  -.6494984   .0835697    -7.77   0.000    -.8142648    -.484732
       trend |  -.0036439   .0006412    -5.68   0.000    -.0049081   -.0023797
log_hhinc_~j |   .0072784   .0323803     0.22   0.822    -.0565628    .0711195
       _cons |  -.0559558   .3166689    -0.18   0.860    -.6803014    .5683898
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 1 HDFE group                            F(   4,    205) =      44.40
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9773
                                                  Adj R-squared   =     0.9756
                                                  Within R-sq.    =     0.0209
Number of clusters (dma_code) =        206        Root MSE        =     0.0926

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0662952   .0052884    12.54   0.000     .0558685    .0767219
post_merg~or |  -.0575649   .0059355    -9.70   0.000    -.0692674   -.0458624
       trend |  -.0024972   .0005042    -4.95   0.000    -.0034912   -.0015031
log_hhinc_~j |   .0031209   .0029374     1.06   0.289    -.0026705    .0089123
       _cons |  -.0215544   .0310247    -0.69   0.488    -.0827228    .0396139
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   2,    205) =      47.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9778
                                                  Adj R-squared   =     0.9762
                                                  Within R-sq.    =     0.0163
Number of clusters (dma_code) =        206        Root MSE        =     0.0914

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0576331   .0059309    -9.72   0.000    -.0693264   -.0459397
log_hhinc_~j |   .0015422   .0022069     0.70   0.485    -.0028088    .0058933
       _cons |   .0062533   .0224905     0.28   0.781    -.0380891    .0505956
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   4,    205) =      43.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9774
                                                  Adj R-squared   =     0.9757
                                                  Within R-sq.    =     0.0212
Number of clusters (dma_code) =        206        Root MSE        =     0.0923

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0674859   .0054643    12.35   0.000     .0567126    .0782593
post_merg~or |  -.0576137   .0059336    -9.71   0.000    -.0693124    -.045915
log_hhinc_~j |   .0030017   .0030071     1.00   0.319    -.0029272    .0089305
       trend |  -.0025728   .0005106    -5.04   0.000    -.0035795   -.0015662
       _cons |   -.020263   .0317201    -0.64   0.524    -.0828024    .0422765
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   3,    205) =      40.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9787
                                                  Adj R-squared   =     0.9771
                                                  Within R-sq.    =     0.0177
Number of clusters (dma_code) =        206        Root MSE        =     0.0898

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0630369   .0057445    10.97   0.000      .051711    .0743627
post_merg~or |  -.0534959   .0063731    -8.39   0.000    -.0660611   -.0409307
log_hhinc_~j |   .0048554   .0031486     1.54   0.125    -.0013524    .0110631
       _cons |   -.060333   .0330959    -1.82   0.070    -.1255851    .0049191
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   3.0560e+09)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =     99,431
                                                F(3, 205)         =      12.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0006
                                                Root MSE          =     .59273

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0205186   .0050104     4.10   0.000       .01064    .0303973
       trend |  -.0034064    .000625    -5.45   0.000    -.0046386   -.0021742
log_hhinc_~j |   .0210587   .0344278     0.61   0.541    -.0468193    .0889367
       _cons |   -.197867   .3379325    -0.59   0.559    -.8641359    .4684019
------------------------------------------------------------------------------
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 1 HDFE group                            F(   3,    205) =      14.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9769
                                                  Adj R-squared   =     0.9752
                                                  Within R-sq.    =     0.0052
Number of clusters (dma_code) =        206        Root MSE        =     0.0933

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0197369   .0035605     5.54   0.000      .012717    .0267567
       trend |    -.00247   .0005007    -4.93   0.000    -.0034571   -.0014829
log_hhinc_~j |   .0032398   .0029945     1.08   0.281    -.0026641    .0091437
       _cons |   -.022882    .031535    -0.73   0.469    -.0850565    .0392926
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   1,    205) =       0.54
Statistics robust to heteroskedasticity           Prob > F        =     0.4651
                                                  R-squared       =     0.9775
                                                  Adj R-squared   =     0.9758
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        206        Root MSE        =     0.0922

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |   .0016622    .002271     0.73   0.465    -.0028153    .0061398
       _cons |  -.0177946   .0232568    -0.77   0.445    -.0636478    .0280585
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6707        6707           0    *|
   time_effects |        18           0          18     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   3,    205) =      14.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9770
                                                  Adj R-squared   =     0.9754
                                                  Within R-sq.    =     0.0053
Number of clusters (dma_code) =        206        Root MSE        =     0.0931

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0208895   .0037266     5.61   0.000     .0135421    .0282369
       trend |  -.0025461   .0005069    -5.02   0.000    -.0035456   -.0015466
log_hhinc_~j |   .0031201   .0030646     1.02   0.310     -.002922    .0091622
       _cons |  -.0215827   .0322324    -0.67   0.504    -.0851323    .0419669
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6707        6707           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 68 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     99,363
Absorbing 2 HDFE groups                           F(   2,    205) =      14.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9784
                                                  Adj R-squared   =     0.9768
                                                  Within R-sq.    =     0.0035
Number of clusters (dma_code) =        206        Root MSE        =     0.0904

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0197799   .0036829     5.37   0.000     .0125187    .0270411
log_hhinc_~j |   .0047855   .0031573     1.52   0.131    -.0014395    .0110105
       _cons |  -.0595127    .033127    -1.80   0.074     -.124826    .0058007
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      6707        6707           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout

. 
. reghdfe lprice post_merger_merging post_merger trend, abs(entity_effects) vce
> (cluster dma_code)
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,733
Absorbing 1 HDFE group                            F(   2,    205) =     167.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .028177   .0020067    14.04   0.000     .0242206    .0321334
       trend |  -.0036071   .0002599   -13.88   0.000    -.0041195   -.0030947
       _cons |    .725535   .0022588   321.21   0.000     .7210816    .7299885
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl1

. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
> , abs(entity_effects) vce(cluster dma_code)
(dropped 336 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =    102,635
Absorbing 1 HDFE group                            F(   3,    205) =     111.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9707
                                                  Adj R-squared   =     0.9684
                                                  Within R-sq.    =     0.0057
Number of clusters (dma_code) =        206        Root MSE        =     0.1267

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0281815    .002015    13.99   0.000     .0242087    .0321543
log_hhinc_~j |   .0020443   .0014119     1.45   0.149    -.0007394     .004828
       trend |   -.003619   .0002598   -13.93   0.000    -.0041312   -.0031068
       _cons |    .704815    .014656    48.09   0.000     .6759191    .7337109
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      7446        7446           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl2

. 
. esttab tabl1 tabl2 using `2'/did_stata_table_`3'.tex, replace se r2 ar2 title
> ("Reduced Form Price Effects") mtitles("DMA/Product FE" "DMA/Product, Demogra
> phics")
(note: file ../output//did_stata_table_quarter.tex not found)
(output written to ../output//did_stata_table_quarter.tex)

. 
. 
. est clear

. 
. 
. 
. 
. exit, STATA clear
