
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Sandbox/Nested_Logit.do ../
> ../../All/m_1973045020_2/intermediate ../output/ quarter Nested_Logit Linear_
> FE 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. /* *args: routine          = `4' */
. /* *args: spec             = `5' */
. 
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_1973045020_2/intermediate

. log using `2'/compute_demand_`3', text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_1973045020_2/intermediate/.
> ./output//compute_demand_quarter.log
  log type:  text
 opened on:  20 Aug 2020, 18:33:59

. 
. import delimited "demand_`3'.csv", encoding(ISO-8859-1)
(26 vars, 492,148 obs)

. 
. /*Install Packages*/
. 
. ssc install outreg2, replace
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ranktest, replace
checking ranktest consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ivreg2, replace
checking ivreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools, replace
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe, replace
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout, replace
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ivreghdfe, replace
checking ivreghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. 
. di "`4'"
Nested_Logit

. di "`5'"
Linear_FE

. 
. if "`4'" == "Nested_Logit" {
. 
.         if "`5'" == "Linear_FE" {
. 
.                 eststo clear
.                 *IVHDFE WITH FIRST STAGE
.                 eststo: ivreghdfe logsj_logs0 (prices log_within_nest_shares 
> = demand*), abs(dma_code upc) cluster(dma_code) first savefirst savefprefix(s
> t1)
(MWFE estimator converged in 5 iterations)

Stored estimation results
-------------------------
-------------------------------------------------------------------------------
        name | command      depvar       npar  title 
-------------+-----------------------------------------------------------------
   st1prices | ivreg2       prices          3  First-stage regression: prices
st1log_wit~s | ivreg2       log_within~s    3  First-stage regression:
             |                                 log_within_nest_shares
-------------------------------------------------------------------------------

First-stage regressions
-----------------------


First-stage regression of prices:

Statistics robust to heteroskedasticity and clustering on dma_code
Number of obs =                 491771
Number of clusters (dma_code) =    205
------------------------------------------------------------------------------
             |               Robust
      prices |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
demand_ins~0 |  -.0000459   1.65e-06   -27.78   0.000    -.0000492   -.0000427
demand_ins~1 |   .1004186   .0024863    40.39   0.000     .0955454    .1052917
demand_ins~2 |  -.0168135   .0009108   -18.46   0.000    -.0185988   -.0150283
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  3,   204) =  1067.37
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  2,   204) =   660.05
  Prob > F      =   0.0000


First-stage regression of log_within_nest_shares:

Statistics robust to heteroskedasticity and clustering on dma_code
Number of obs =                 491771
Number of clusters (dma_code) =    205
------------------------------------------------------------------------------
             |               Robust
log_within~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
demand_ins~0 |  -9.64e-06   7.47e-07   -12.91   0.000    -.0000111   -8.18e-06
demand_ins~1 |  -.0595804   .0015969   -37.31   0.000    -.0627103   -.0564506
demand_ins~2 |  -.0003418   .0001859    -1.84   0.066    -.0007062    .0000226
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  3,   204) =   627.78
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  2,   204) =   560.64
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  3,   204)  P-val | SW Chi-sq(  2) P-val | SW F(  2,   204)
prices       |    1067.37    0.0000 |     1326.99   0.0000 |      660.05
log_within_n |     627.78    0.0000 |     1127.13   0.0000 |      560.64

NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                    5% maximal IV relative bias    13.91
                                   10% maximal IV relative bias     9.08
                                   20% maximal IV relative bias     6.46
                                   30% maximal IV relative bias     5.39
                                   10% maximal IV size             22.30
                                   15% maximal IV size             12.83
                                   20% maximal IV size              9.54
                                   25% maximal IV size              7.80
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(2)=175.53   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                    1725.29
Kleibergen-Paap Wald rk F statistic                               350.11

Stock-Yogo weak ID test critical values for K1=2 and L1=3:
                                   10% maximal IV size             13.43
                                   15% maximal IV size              8.18
                                   20% maximal IV size              6.40
                                   25% maximal IV size              5.45
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(3,204)=     791.43     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(3)=   2386.69     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(3)=    185.40     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  =        205
Number of observations               N  =     491771
Number of regressors                 K  =          2
Number of endogenous regressors      K1 =          2
Number of instruments                L  =          3
Number of excluded instruments       L1 =          3

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on dma_code

Number of clusters (dma_code) =    205                Number of obs =   491771
                                                      F(  2,   204) =  3277.39
                                                      Prob > F      =   0.0000
Total (centered) SS     =  765404.9981                Centered R2   =   0.9416
Total (uncentered) SS   =  765404.9981                Uncentered R2 =   0.9416
Residual SS             =  44694.27579                Root MSE      =    .3015

------------------------------------------------------------------------------
             |               Robust
 logsj_logs0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      prices |  -.1093285   .0048041   -22.76   0.000    -.1188005   -.0998565
log_within~s |   .9593785   .0145031    66.15   0.000     .9307833    .9879736
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            175.528
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):             1725.287
                         (Kleibergen-Paap rk Wald F statistic):        350.113
Stock-Yogo weak ID test critical values: 10% maximal IV size             13.43
                                         15% maximal IV size              8.18
                                         20% maximal IV size              6.40
                                         25% maximal IV size              5.45
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):        63.051
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         prices log_within_nest_shares
Excluded instruments: demand_instruments0 demand_instruments1
                      demand_instruments2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    dma_code |       205         205           0    *|
         upc |       155           0         155     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(est1 stored)
.                 esttab est1 st1* using `2'/demand_results_`3'.tex, replace
(output written to ../output//demand_results_quarter.tex)
.                 outreg2 est1 st1* using `2'/demand_results_`3'.txt, replace
dir : seeout
. 
. 
.         }
. 
.         else if "`5'" == "Chars" {
. 
.                 eststo clear
.                 *IVHDFE WITH FIRST STAGE
.                 eststo: ivreghdfe logsj_logs0 chars* (prices log_within_nest_
> shares = demand*), abs(dma_code) cluster(dma_code) first savefirst savefprefi
> x(st1)
.                 esttab est1 st1* using `2'/demand_results_`3'.tex, replace
.                 outreg2 est1 st1* using `2'/demand_results_`3'.txt, replace
. 
. 
.         }
. }

. 
. 
. else if "`4'" == "Logit" {
. 
.         if "`5'" == "Linear_FE" {
. 
.                 eststo clear
.                 *IVHDFE WITH FIRST STAGE
.                 eststo: ivreghdfe logsj_logs0 (prices = demand*), abs(dma_cod
> e upc) cluster(dma_code) first savefirst savefprefix(st1)
.                 esttab est1 st1* using `2'/demand_results_`3'.tex, replace
.                 outreg2 est1 st1* using `2'/demand_results_`3'.txt, replace
.         
. 
.         }
. 
.         else if "`5'" == "Chars" {
. 
.                 eststo clear
.                 *IVHDFE WITH FIRST STAGE
.                 eststo: ivreghdfe logsj_logs0 chars* (prices = demand*), abs(
> dma_code) cluster(dma_code) first savefirst savefprefix(st1)
.                 esttab est1 st1* using `2'/demand_results_`3'.tex, replace
.                 outreg2 est1 st1* using `2'/demand_results_`3'.txt, replace
. 
. 
.         }
. }

. 
. 
. 
. 
. exit, STATA clear
