
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Main/did_test2_brandlevel.d
> o ../../../All/m_2724494020_1/intermediate ../output/ month 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_2724494020_1/intermediate

. log using `2'/did_stata_`3', text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_2724494020_1/intermediate/.
> ./output//did_stata_month.log
  log type:  text
 opened on:   1 Jan 2021, 01:13:01

. 
. import delimited "stata_did_`3'.csv", encoding(ISO-8859-1)
(23 vars, 633,508 obs)

. 
. /*Install Packages*/
. 
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /* Fixed Effects */
. egen entity_effects = group(brand_code_uc dma_code)

. egen time_effects = group(year `3') /* same goes for month*/

. egen time_calendar = group(`3') /* same goes for month*/

. 
. 
. /* WEIGHTING SCHEMES */
. gen pre_vol = volume * (1 - post_merger)

. gen weights_0 = 1 /*to add weights that won't change things*/

. egen weights_1 = total(pre_vol), by(brand_code_uc)

. egen weights_2 = total(pre_vol), by(dma_code)

. egen weights_3 = total(pre_vol), by(brand_code_uc dma_code)

. replace weights_1 = round(weights_1)
(602,517 real changes made)

. replace weights_2 = round(weights_2)
(633,508 real changes made)

. replace weights_3 = round(weights_3)
(624,344 real changes made)

. 
. /*Naive Variables*/
. gen np_dhhi = post_merger*dhhi

. gen np_HHI = post_merger*post_hhi

. 
. 
. 
. forval x = 0/3 {
  2. 
. * No Fixed-Effects
. reg lprice post_merger_merging post_merger trend [aw = weights_`x'], vce(clus
> ter dma_code)
  3. est sto NO_FE_`x'
  4. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE") replace
  5. 
. * Product/Market Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> entity_effects) vce(cluster dma_code)
  6. est sto PM_FE_`x'
  7. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE") append
  8. 
. 
. * Product/Market and Time Fixed-Effects
. reghdfe lprice post_merger_merging [aw = weights_`x'], abs(entity_effects tim
> e_effects) vce(cluster dma_code)
  9. est sto PMT_FE_`x'
 10. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE") append
 11. 
. 
. * Calendar Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> time_calendar entity_effects) vce(cluster dma_code)
 12. est sto PMT_C_`x'
 13. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE") append
 14. 
. * Dma-Specific Time Trends
. reghdfe lprice post_merger_merging post_merger [aw = weights_`x'], abs(dma_co
> de##c.trend entity_effects) vce(cluster dma_code)
 15. est sto PMT_t_`x'
 16. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends") append
 17. 
. 
. *MAJOR*
. 
. * No Fixed-Effects, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend [aw = weig
> hts_`x'], vce(cluster dma_code)
 18. est sto NO_FE_M_`x'
 19. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Major") append
 20. 
. 
. * Product/market Fixed-Effects (Time Trend)
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(entity_effects) vce(cluster dma_code)
 21. est sto PM_FE_M_`x'
 22. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, Major") append
 23. 
. 
. * Product/market and Time Fixed-Effects
. reghdfe lprice post_merger_merging post_merger_major [aw = weights_`x'], abs(
> entity_effects time_effects) vce(cluster dma_code)
 24. est sto PMT_FE_M_`x'
 25. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Major") append
 26. 
. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 27. est sto PMT_C_M_`x'
 28. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Major") append
 29. 
. reghdfe lprice post_merger_merging post_merger post_merger_major [aw = weight
> s_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
 30. est sto PMT_t_M_`x'
 31. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Major") append
 32. 
. /******************************/
. /******************************/
. /******************************/
. 
. *DHHI
. 
. * No Fixed-Effects, DHHI
. reg lprice post_merger_dhhi post_merger trend [aw = weights_`x'], vce(cluster
>  dma_code)
 33. est sto NO_FE_DHHI_`x'
 34. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, DHHI") append
 35. 
. * Product/market Fixed-Effects, DHHI
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(ent
> ity_effects) vce(cluster dma_code)
 36. est sto PM_FE_DHHI_`x'
 37. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, DHHI") append
 38. 
. *Product/market and Time Fixed-Effects, DHHI.
. reghdfe lprice post_merger_dhhi [aw = weights_`x'], abs(entity_effects time_e
> ffects) vce(cluster dma_code)
 39. est sto PMT_FE_DHHHI_`x'
 40. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Major") append
 41. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(tim
> e_calendar entity_effects) vce(cluster dma_code)
 42. est sto PMT_C_DHHI_`x'
 43. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, DHHI") append
 44. 
. reghdfe lprice post_merger_dhhi post_merger [aw = weights_`x'], abs(dma_code#
> #c.trend entity_effects) vce(cluster dma_code)
 45. est sto PMT_t_DHHI_`x'
 46. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, DHHI") append
 47. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. *NAIVE SPECIFICATIONS
. 
. 
. *No FE
. 
. *No Fixed-Effects naive DHHI and post-HHI
. reg lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`x'],
>  vce(cluster dma_code)
 48. est sto np_D_H_`x'
 49. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Naive DHHI & post HHI") append
 50. 
. *No Fixed-Effects naive post-HHI
. reg lprice post_merger post_hhi  np_HHI trend [aw = weights_`x'], vce(cluster
>  dma_code)
 51. est sto np_H_`x'
 52. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Naive post HHI") append
 53. 
. *No Fixed-Effects naive DHHI
. reg lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], vce(cluster dma
> _code)
 54. est sto np_D_`x'
 55. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Naive DHHI") append
 56. 
. *Product/market FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI trend [aw = weights_`x'], abs(entit
> y_effects) vce(cluster dma_code)
 57. est sto PM_FE_np_D_H_`x'
 58. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI & post HHI") append
 59. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice post_merger np_HHI trend [aw = weights_`x'], abs(entity_effect
> s) vce(cluster dma_code)
 60. est sto PM_FE_np_H_`x'
 61. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive post HHI") append
 62. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice post_merger np_dhhi trend [aw = weights_`x'], abs(entity_effec
> ts) vce(cluster dma_code)
 63. est sto PM_FE_np_D_`x'
 64. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI") append
 65. 
. *Product/Market and Time FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice np_dhhi np_HHI [aw = weights_`x'], abs(entity_effects time_eff
> ects) vce(cluster dma_code)
 66. est sto PMT_FE_np_D_H_`x'
 67. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI & post HHI") append
 68. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice np_HHI [aw = weights_`x'], abs(entity_effects time_effects) vc
> e(cluster dma_code)
 69. est sto PMT_FE_np_H_`x'
 70. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive post HHI") append
 71. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice np_dhhi [aw = weights_`x'], abs(entity_effects time_effects) v
> ce(cluster dma_code)
 72. est sto PMT_FE_np_D_`x'
 73. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI") append
 74. 
. 
. /******************************/
. 
. *Calendar Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`
> x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 75. est sto PMT_FE_t_np_D_H_`x'
 76. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Naive DHHI & post HHI") append
 77. 
. *DMA-trends, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI [aw = weights_`x'], abs(dma_code##c
> .trend entity_effects) vce(cluster dma_code)
 78. est sto PMT_FE_t_np_D_H_`x'
 79. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Naive DHHI & post HHI") append
 80. 
. *Calendar Fixed-Effects, naive post-HHI
. reghdfe lprice post_hhi post_merger np_HHI trend [aw = weights_`x'], abs(time
> _calendar entity_effects) vce(cluster dma_code)
 81. est sto PMT_FE_t_np_H_`x'
 82. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Naive post HHI") append
 83. 
. *DMA-trends, naive post-HHI
. reghdfe lprice post_merger np_HHI [aw = weights_`x'], abs(dma_code##c.trend e
> ntity_effects) vce(cluster dma_code)
 84. est sto PMT_FE_t_np_H_`x'
 85. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Naive post HHI") append
 86. 
. *Calendar Fixed-Effects, naive DHHI
. reghdfe lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], abs(time_ca
> lendar entity_effects) vce(cluster dma_code)
 87. est sto PMT_FE_t_np_D_`x'
 88. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Naive DHHI") append
 89. 
. *DMA-trends, naive DHHI
. reghdfe lprice post_merger np_dhhi [aw = weights_`x'], abs(dma_code##c.trend 
> entity_effects) vce(cluster dma_code)
 90. est sto PMT_FE_t_np_D_`x'
 91. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Naive DHHI") append
 92. 
. 
. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. 
. 
. * No Fixed-Effects, Demographics
. reg lprice post_merger_merging post_merger log_hhinc_per_person_adj trend [aw
>  = weights_`x'], vce(cluster dma_code)
 93. est sto NO_FE_d_`x'
 94. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Demographics") append
 95. 
. * Product/market Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 96. *note: this one  seemed to have both Time F-E and Time-Trends*
. est sto PM_FE_d_`x'
 97. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Demographics") append
 98. 
. * Product/market and Time Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging log_hhinc_per_person_adj [aw = weights_`x'
> ], abs(entity_effects time_effects) vce(cluster dma_code)
 99. est sto PMT_FE_d_`x'
100. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Demographics") append
101. 
. 
. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
102. est sto PMT_C_d_`x'
103. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Demographics") append
104. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj [aw =
>  weights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
105. est sto PMT_t_d_`x'
106. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Demographics") append
107. 
. 
. 
. * No Fixed-Effects, Demographics, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend log_hhinc_
> per_person_adj [aw = weights_`x'], vce(cluster dma_code)
108. est sto NO_FE_d_M_`x'
109. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Major, Demographics") append
110. 
. *Products/market Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger post_merger_major trend log_hh
> inc_per_person_adj [aw = weights_`x'], abs(entity_effects) vce(cluster dma_co
> de)
111. est sto PM_FE_d_M_`x'
112. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, Major, Demographics") append
113. 
. *Products/market and Time Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger_major log_hhinc_per_person_adj
>  [aw = weights_`x'], abs(entity_effects time_effects) vce(cluster dma_code)
114. est sto PMT_FE_d_M_`x'
115. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Major, Demographics") append
116. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj trend [aw = weights_`x'], abs(time_calendar entity_effects) vce(
> cluster dma_code)
117. est sto PMT_C_d_M_`x'
118. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Major, Demographics") append
119. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj [aw = weights_`x'], abs(dma_code##c.trend entity_effects) vce(cl
> uster dma_code)
120. est sto PMT_t_d_M_`x'
121. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Major, Demographics") append
122. 
. /******************************/
. /******************************/
. /******************************/
. 
. *No Fixed-Effects, DHHI, Demographics
. reg lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [aw = 
> weights_`x'], vce(cluster dma_code)
123. est sto NO_FE_DHHI_d_`x'
124. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, DHHI, Demographics") append
125. 
. *Product/market Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(entity_effects) vce(cluster dma_code)
126. est sto PM_FE_DHHI_d_`x'
127. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, DHHI, Demographics") append
128. 
. *Product/market and Time Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi log_hhinc_per_person_adj [aw = weights_`x'], 
> abs(entity_effects time_effects) vce(cluster dma_code)
129. est sto PMT_FE_DHHI_d_`x'
130. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, DHHI, Demographics") append
131. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
132. est sto PMT_C_d_D_`x'
133. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, DHHI, Demographics") append
134. 
. reghdfe lprice post_merger_dhhi post_merger log_hhinc_per_person_adj [aw = we
> ights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
135. est sto PMT_t_d_D_`x'
136. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, DHHI, Demographics") append
137. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. est clear
138. 
. 
. }
(sum of wgt is   6.3351e+05)

Linear regression                               Number of obs     =    633,508
                                                F(3, 205)         =    6065.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0260
                                                Root MSE          =     .42096

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.7813566    .005842  -133.75   0.000    -.7928747   -.7698385
 post_merger |   .0464305   .0020092    23.11   0.000     .0424692    .0503919
       trend |   .0019911   .0000884    22.52   0.000     .0018168    .0021654
       _cons |   3.564635   .0039531   901.74   0.000     3.556842    3.572429
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =     466.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5306
                                                  Adj R-squared   =     0.5278
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0241799   .0055326    -4.37   0.000     -.035088   -.0132717
 post_merger |   .0233342   .0014822    15.74   0.000     .0204119    .0262564
       trend |   .0009274   .0000544    17.04   0.000     .0008201    .0010347
       _cons |   3.600424   .0011264  3196.29   0.000     3.598203    3.602644
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =      30.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5369
                                                  Adj R-squared   =     0.5341
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0301784   .0054207    -5.57   0.000    -.0408659   -.0194909
       _cons |   3.636033   .0000227  1.6e+05   0.000     3.635989    3.636078
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     468.39
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5284
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0238683   .0055484    -4.30   0.000    -.0348076    -.012929
 post_merger |   .0217429   .0015543    13.99   0.000     .0186784    .0248074
       trend |   .0009876   .0000558    17.70   0.000     .0008776    .0010976
       _cons |   3.599705   .0011257  3197.87   0.000     3.597486    3.601925
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     120.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5311
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   -.024859   .0056865    -4.37   0.000    -.0360705   -.0136475
 post_merger |   .0231701   .0014957    15.49   0.000     .0202211    .0261191
       _cons |   3.624134   .0007612  4761.10   0.000     3.622634    3.625635
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.3351e+05)

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =    7073.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0997
                                                Root MSE          =     .40471

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.6095809    .006861   -88.85   0.000    -.6231081   -.5960536
 post_merger |  -.1344364   .0030729   -43.75   0.000    -.1404949   -.1283779
post_merg~or |   .3254447   .0051554    63.13   0.000     .3152802    .3356091
       trend |   .0023852   .0000756    31.54   0.000     .0022361    .0025343
       _cons |   3.559517   .0038359   927.95   0.000     3.551954     3.56708
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   4,    205) =     888.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5353
                                                  Adj R-squared   =     0.5325
                                                  Within R-sq.    =     0.0161
Number of clusters (dma_code) =        206        Root MSE        =     0.2916

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0404812   .0062886     6.44   0.000     .0280825    .0528798
 post_merger |  -.0416943   .0024607   -16.94   0.000    -.0465458   -.0368427
post_merg~or |   .1212767   .0033516    36.19   0.000     .1146687    .1278846
       trend |   .0009432   .0000543    17.37   0.000     .0008362    .0010503
       _cons |   3.600636   .0011654  3089.73   0.000     3.598339    3.602934
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     764.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5417
                                                  Adj R-squared   =     0.5389
                                                  Within R-sq.    =     0.0104
Number of clusters (dma_code) =        206        Root MSE        =     0.2896

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0352006   .0061747     5.70   0.000     .0230266    .0473746
post_merg~or |   .1227466   .0034146    35.95   0.000     .1160144    .1294788
       _cons |   3.602919   .0009273  3885.19   0.000     3.601091    3.604748
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   4,    205) =     898.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5359
                                                  Adj R-squared   =     0.5331
                                                  Within R-sq.    =     0.0161
Number of clusters (dma_code) =        206        Root MSE        =     0.2914

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0407948   .0063032     6.47   0.000     .0283675    .0532222
 post_merger |  -.0431912   .0024448   -17.67   0.000    -.0480114    -.038371
post_merg~or |   .1213023   .0033543    36.16   0.000      .114689    .1279156
       trend |   .0010023   .0000562    17.82   0.000     .0008914    .0011132
       _cons |    3.59989    .001166  3087.33   0.000     3.597592    3.602189
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     615.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5358
                                                  Adj R-squared   =     0.5327
                                                  Within R-sq.    =     0.0105
Number of clusters (dma_code) =        206        Root MSE        =     0.2915

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0391294   .0063841     6.13   0.000     .0265424    .0517163
 post_merger |  -.0423312   .0024399   -17.35   0.000    -.0471417   -.0375207
post_merg~or |   .1221162   .0033001    37.00   0.000     .1156098    .1286226
       _cons |    3.62477   .0007681  4719.28   0.000     3.623256    3.626284
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.3351e+05)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(2, 205)         =     584.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0120
                                                Root MSE          =     .42395

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0381701   .0019389    19.69   0.000     .0343473    .0419928
       trend |   .0020687   .0000937    22.08   0.000     .0018839    .0022534
       _cons |   3.563628   .0039913   892.84   0.000     3.555759    3.571498
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   2,    205) =     648.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5306
                                                  Adj R-squared   =     0.5278
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2931

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0230807   .0014686    15.72   0.000     .0201853    .0259761
       trend |   .0009282   .0000544    17.05   0.000     .0008208    .0010355
       _cons |   3.600433   .0011254  3199.23   0.000     3.598214    3.602652
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5369
                                                  Adj R-squared   =     0.5341
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |   3.635907   1.12e-16  3.2e+16   0.000     3.635907    3.635907
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     651.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5284
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0214961    .001544    13.92   0.000     .0184521    .0245402
       trend |   .0009882   .0000558    17.70   0.000     .0008782    .0010982
       _cons |   3.599717   .0011245  3201.24   0.000     3.597499    3.601934
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     239.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5310
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0229107   .0014818    15.46   0.000     .0199893    .0258322
       _cons |   3.624164   .0007595  4771.50   0.000     3.622666    3.625661
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.3351e+05)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =     387.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0157
                                                Root MSE          =     .42317

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0841213    .010923     7.70   0.000     .0625856     .105657
    post_hhi |   .3673846   .0355021    10.35   0.000     .2973884    .4373808
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   -.129417   .0292642    -4.42   0.000    -.1871144   -.0717195
       trend |   .0020521   .0000936    21.91   0.000     .0018675    .0022367
       _cons |   3.433134   .0128234   267.72   0.000     3.407851    3.458416
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   6.3351e+05)

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =     387.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0157
                                                Root MSE          =     .42317

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0841213    .010923     7.70   0.000     .0625856     .105657
    post_hhi |   .3673846   .0355021    10.35   0.000     .2973884    .4373808
      np_HHI |   -.129417   .0292642    -4.42   0.000    -.1871144   -.0717195
       trend |   .0020521   .0000936    21.91   0.000     .0018675    .0022367
       _cons |   3.433134   .0128234   267.72   0.000     3.407851    3.458416
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   6.3351e+05)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(2, 205)         =     584.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0120
                                                Root MSE          =     .42395

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0381701   .0019389    19.69   0.000     .0343473    .0419928
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0020687   .0000937    22.08   0.000     .0018839    .0022534
       _cons |   3.563628   .0039913   892.84   0.000     3.555759    3.571498
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =     453.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5306
                                                  Adj R-squared   =     0.5278
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0326237   .0065358     4.99   0.000     .0197378    .0455097
     np_dhhi |          0  (omitted)
      np_HHI |  -.0268224   .0174218    -1.54   0.125    -.0611712    .0075264
       trend |   .0009294   .0000545    17.06   0.000      .000822    .0010368
       _cons |   3.600431   .0011164  3224.95   0.000      3.59823    3.602632
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =     453.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5306
                                                  Adj R-squared   =     0.5278
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0326237   .0065358     4.99   0.000     .0197378    .0455097
      np_HHI |  -.0268224   .0174218    -1.54   0.125    -.0611712    .0075264
       trend |   .0009294   .0000545    17.06   0.000      .000822    .0010368
       _cons |   3.600431   .0011164  3224.95   0.000      3.59823    3.602632
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   2,    205) =     648.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5306
                                                  Adj R-squared   =     0.5278
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2931

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0230807   .0014686    15.72   0.000     .0201853    .0259761
     np_dhhi |          0  (omitted)
       trend |   .0009282   .0000544    17.05   0.000     .0008208    .0010355
       _cons |   3.600433   .0011254  3199.23   0.000     3.598214    3.602652
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       1.66
Statistics robust to heteroskedasticity           Prob > F        =     0.1994
                                                  R-squared       =     0.5369
                                                  Adj R-squared   =     0.5341
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |  -.0225042   .0174816    -1.29   0.199    -.0569709    .0119625
       _cons |   3.640035   .0032068  1135.09   0.000     3.633713    3.646358
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       1.66
Statistics robust to heteroskedasticity           Prob > F        =     0.1994
                                                  R-squared       =     0.5369
                                                  Adj R-squared   =     0.5341
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0225042   .0174816    -1.29   0.199    -.0569709    .0119625
       _cons |   3.640035   .0032068  1135.09   0.000     3.633713    3.646358
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5369
                                                  Adj R-squared   =     0.5341
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |   3.635907   1.12e-16  3.2e+16   0.000     3.635907    3.635907
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     453.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5284
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0310981   .0065531     4.75   0.000     .0181779    .0440182
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.0269796   .0174093    -1.55   0.123    -.0613039    .0073447
       trend |   .0009893   .0000558    17.71   0.000     .0008792    .0010994
       _cons |   3.599716   .0011176  3220.95   0.000     3.597512    3.601919
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     120.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5310
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0225751   .0068699     3.29   0.001     .0090303    .0361199
     np_dhhi |          0  (omitted)
      np_HHI |   .0009414   .0184601     0.05   0.959    -.0354546    .0373373
       _cons |   3.624163   .0007586  4777.33   0.000     3.622667    3.625659
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     453.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5284
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0310981   .0065531     4.75   0.000     .0181779    .0440182
      np_HHI |  -.0269796   .0174093    -1.55   0.123    -.0613039    .0073447
       trend |   .0009893   .0000558    17.71   0.000     .0008792    .0010994
       _cons |   3.599716   .0011176  3220.95   0.000     3.597512    3.601919
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     120.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5310
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0225751   .0068699     3.29   0.001     .0090303    .0361199
      np_HHI |   .0009414   .0184601     0.05   0.959    -.0354546    .0373373
       _cons |   3.624163   .0007586  4777.33   0.000     3.622667    3.625659
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     651.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5284
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0214961    .001544    13.92   0.000     .0184521    .0245402
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0009882   .0000558    17.70   0.000     .0008782    .0010982
       _cons |   3.599717   .0011245  3201.24   0.000     3.597499    3.601934
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     239.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5310
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0229107   .0014818    15.46   0.000     .0199893    .0258322
     np_dhhi |          0  (omitted)
       _cons |   3.624164   .0007595  4771.50   0.000     3.622666    3.625661
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.3281e+05)

Linear regression                               Number of obs     =    632,806
                                                F(4, 205)         =    4614.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0260
                                                Root MSE          =     .42101

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.7813774   .0058393  -133.81   0.000    -.7928903   -.7698646
 post_merger |   .0462289   .0020218    22.86   0.000     .0422427    .0502152
log_hhinc_~j |   .0033646    .002925     1.15   0.251    -.0024024    .0091316
       trend |   .0019836   .0000888    22.33   0.000     .0018084    .0021587
       _cons |   3.530824   .0294198   120.02   0.000      3.47282    3.588828
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   4,    205) =     344.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5308
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0241853    .005538    -4.37   0.000    -.0351041   -.0132665
 post_merger |   .0230169   .0015049    15.30   0.000     .0200499    .0259839
log_hhinc_~j |   .0045257    .001462     3.10   0.002     .0016431    .0074082
       trend |    .000919   .0000543    16.92   0.000     .0008119    .0010262
       _cons |   3.554946   .0148771   238.95   0.000     3.525615    3.584278
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   2,    205) =      16.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5370
                                                  Adj R-squared   =     0.5342
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0302291    .005422    -5.58   0.000    -.0409192    -.019539
log_hhinc_~j |   .0018564   .0009088     2.04   0.042     .0000646    .0036483
       _cons |   3.617265    .009212   392.67   0.000     3.599102    3.635427
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   4,    205) =     346.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5313
                                                  Adj R-squared   =     0.5285
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0238748    .005554    -4.30   0.000    -.0348251   -.0129245
 post_merger |   .0214052   .0015831    13.52   0.000      .018284    .0245264
log_hhinc_~j |   .0044178   .0014785     2.99   0.003     .0015029    .0073328
       trend |   .0009803   .0000561    17.48   0.000     .0008697    .0010909
       _cons |   3.555303   .0150547   236.16   0.000     3.525621    3.584985
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =      84.17
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5281
                                                  Within R-sq.    =     0.0005
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0248192   .0056874    -4.36   0.000    -.0360325   -.0136059
 post_merger |   .0227345    .001523    14.93   0.000     .0197319    .0257372
log_hhinc_~j |   .0049401   .0014066     3.51   0.001     .0021668    .0077134
       _cons |   3.574315   .0141808   252.05   0.000     3.546356    3.602274
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.3281e+05)

Linear regression                               Number of obs     =    632,806
                                                F(5, 205)         =    5774.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0998
                                                Root MSE          =     .40474

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.6095963   .0068628   -88.83   0.000    -.6231271   -.5960655
 post_merger |  -.1346835   .0030706   -43.86   0.000    -.1407375   -.1286296
post_merg~or |   .3254598   .0051545    63.14   0.000     .3152972    .3356223
       trend |   .0023769   .0000761    31.24   0.000     .0022269    .0025269
log_hhinc_~j |   .0038481   .0028566     1.35   0.179     -.001784    .0094802
       _cons |   3.520842   .0286996   122.68   0.000     3.464258    3.577427
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   5,    205) =     706.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5354
                                                  Adj R-squared   =     0.5327
                                                  Within R-sq.    =     0.0162
Number of clusters (dma_code) =        206        Root MSE        =     0.2916

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0404772    .006291     6.43   0.000     .0280739    .0528805
 post_merger |  -.0420337   .0024385   -17.24   0.000    -.0468416   -.0372259
post_merg~or |   .1212933   .0033499    36.21   0.000     .1146886     .127898
       trend |   .0009343   .0000542    17.24   0.000     .0008274    .0010412
log_hhinc_~j |   .0048137     .00152     3.17   0.002     .0018167    .0078106
       _cons |    3.55226    .015469   229.64   0.000     3.521762    3.582759
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =     523.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5418
                                                  Adj R-squared   =     0.5391
                                                  Within R-sq.    =     0.0104
Number of clusters (dma_code) =        206        Root MSE        =     0.2896

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0351393   .0061752     5.69   0.000     .0229642    .0473144
post_merg~or |   .1227433   .0034173    35.92   0.000     .1160057    .1294808
log_hhinc_~j |   .0020983   .0009326     2.25   0.026     .0002596    .0039369
       _cons |   3.581663   .0093702   382.24   0.000     3.563189    3.600138
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   5,    205) =     714.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5360
                                                  Adj R-squared   =     0.5333
                                                  Within R-sq.    =     0.0162
Number of clusters (dma_code) =        206        Root MSE        =     0.2914

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0407889   .0063059     6.47   0.000     .0283561    .0532216
 post_merger |  -.0435541   .0024218   -17.98   0.000    -.0483289   -.0387793
post_merg~or |   .1213182   .0033528    36.18   0.000     .1147077    .1279287
log_hhinc_~j |   .0047056   .0015331     3.07   0.002     .0016829    .0077282
       trend |   .0009947   .0000565    17.60   0.000     .0008832    .0011061
       _cons |    3.55259    .015614   227.53   0.000     3.521805    3.583375
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   4,    205) =     472.10
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5360
                                                  Adj R-squared   =     0.5329
                                                  Within R-sq.    =     0.0106
Number of clusters (dma_code) =        206        Root MSE        =     0.2915

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0391613   .0063853     6.13   0.000      .026572    .0517505
 post_merger |  -.0427651   .0024277   -17.62   0.000    -.0475517   -.0379786
post_merg~or |    .122103   .0033018    36.98   0.000     .1155932    .1286128
log_hhinc_~j |   .0050804   .0014552     3.49   0.001     .0022113    .0079495
       _cons |   3.573532   .0146625   243.72   0.000     3.544623     3.60244
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.3281e+05)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    632,806
                                                F(3, 205)         =     390.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0121
                                                Root MSE          =     .42401

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0379713   .0019495    19.48   0.000     .0341276     .041815
       trend |   .0020612   .0000941    21.90   0.000     .0018757    .0022467
log_hhinc_~j |   .0033136   .0029553     1.12   0.263    -.0025131    .0091402
       _cons |    3.53033   .0297738   118.57   0.000     3.471628    3.589032
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   3,    205) =     428.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5308
                                                  Adj R-squared   =     0.5280
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0227631   .0014924    15.25   0.000     .0198207    .0257055
       trend |   .0009198   .0000544    16.92   0.000     .0008126     .001027
log_hhinc_~j |   .0045243   .0014624     3.09   0.002      .001641    .0074076
       _cons |    3.55497   .0148807   238.90   0.000     3.525631    3.584309
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   1,    205) =       4.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0428
                                                  R-squared       =     0.5370
                                                  Adj R-squared   =     0.5342
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2911

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |   .0018552   .0009103     2.04   0.043     .0000604      .00365
       _cons |   3.617151   .0092284   391.96   0.000     3.598956    3.635345
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =     430.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5313
                                                  Adj R-squared   =     0.5285
                                                  Within R-sq.    =     0.0062
Number of clusters (dma_code) =        206        Root MSE        =     0.2929

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    .021158    .001574    13.44   0.000     .0180548    .0242613
       trend |    .000981   .0000561    17.48   0.000     .0008703    .0010916
log_hhinc_~j |   .0044162   .0014789     2.99   0.003     .0015005     .007332
       _cons |    3.55533   .0150584   236.10   0.000     3.525641    3.585019
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   2,    205) =     125.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5312
                                                  Adj R-squared   =     0.5281
                                                  Within R-sq.    =     0.0005
Number of clusters (dma_code) =        206        Root MSE        =     0.2930

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0224753   .0015101    14.88   0.000     .0194979    .0254527
log_hhinc_~j |   .0049409    .001406     3.51   0.001     .0021688     .007713
       _cons |   3.574336   .0141743   252.17   0.000      3.54639    3.602282
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3124e+12)

Linear regression                               Number of obs     =    633,508
                                                F(3, 205)         =    7098.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0196
                                                Root MSE          =     .37176

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.8654104   .0060226  -143.69   0.000    -.8772846   -.8535363
 post_merger |   .0461262   .0017373    26.55   0.000     .0427009    .0495516
       trend |   .0021387   .0000639    33.48   0.000     .0020127    .0022646
       _cons |   3.643674   .0029634  1229.57   0.000     3.637831    3.649516
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =    1045.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2109
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   -.056328   .0053626   -10.50   0.000    -.0669008   -.0457551
 post_merger |   .0366621   .0018219    20.12   0.000     .0330701    .0402542
       trend |   .0017362   .0000616    28.17   0.000     .0016147    .0018577
       _cons |   3.658913   .0012433  2942.95   0.000     3.656462    3.661364
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     157.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2210
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0653515   .0052156   -12.53   0.000    -.0756345   -.0550684
       _cons |   3.723054   8.87e-07  4.2e+06   0.000     3.723052    3.723056
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =    1102.74
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2126
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3341

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0558621   .0053886   -10.37   0.000    -.0664862    -.045238
 post_merger |   .0321622   .0020356    15.80   0.000     .0281489    .0361756
       trend |   .0019024   .0000647    29.40   0.000     .0017748      .00203
       _cons |   3.657005   .0012206  2996.17   0.000     3.654598    3.659411
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     225.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2117
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3344

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0547421   .0054786    -9.99   0.000    -.0655437   -.0439406
 post_merger |   .0365037   .0018353    19.89   0.000     .0328852    .0401222
       _cons |   3.703774   .0009692  3821.67   0.000     3.701863    3.705684
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3124e+12)

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =    9726.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1108
                                                Root MSE          =     .35404

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.5369706   .0064647   -83.06   0.000    -.5497164   -.5242248
 post_merger |   -.281953   .0026551  -106.19   0.000    -.2871877   -.2767183
post_merg~or |   .4026535   .0031776   126.72   0.000     .3963885    .4089185
       trend |    .002123   .0000605    35.09   0.000     .0020037    .0022423
       _cons |   3.643877   .0028952  1258.60   0.000     3.638169    3.649585
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   4,    205) =     967.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2174
                                                  Adj R-squared   =     0.2127
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        206        Root MSE        =     0.3331

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0660947   .0059412    11.12   0.000     .0543809    .0778085
 post_merger |  -.0863272   .0026127   -33.04   0.000    -.0914785    -.081176
post_merg~or |   .1525655   .0031659    48.19   0.000     .1463236    .1588073
       trend |   .0017606   .0000616    28.58   0.000     .0016391    .0018821
       _cons |   3.657513   .0012328  2966.90   0.000     3.655082    3.659943
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =    1266.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2324
                                                  Adj R-squared   =     0.2278
                                                  Within R-sq.    =     0.0088
Number of clusters (dma_code) =        206        Root MSE        =     0.3299

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0605724   .0057414    10.55   0.000     .0492527    .0718921
post_merg~or |   .1571689   .0032038    49.06   0.000     .1508522    .1634857
       _cons |   3.655344   .0013802  2648.37   0.000     3.652623    3.658065
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   4,    205) =    1052.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2191
                                                  Adj R-squared   =     0.2145
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        206        Root MSE        =     0.3328

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0665894   .0059666    11.16   0.000     .0548257    .0783531
 post_merger |  -.0907851   .0025538   -35.55   0.000    -.0958202   -.0857501
post_merg~or |   .1526287   .0031661    48.21   0.000     .1463864    .1588711
       trend |    .001926    .000065    29.63   0.000     .0017978    .0020541
       _cons |   3.655575   .0012093  3022.89   0.000      3.65319    3.657959
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     807.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2182
                                                  Adj R-squared   =     0.2130
                                                  Within R-sq.    =     0.0090
Number of clusters (dma_code) =        206        Root MSE        =     0.3331

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0670245   .0060262    11.12   0.000     .0551431    .0789059
 post_merger |  -.0863981   .0026385   -32.75   0.000    -.0916002    -.081196
post_merg~or |   .1524348   .0031674    48.13   0.000     .1461899    .1586797
       _cons |   3.703011   .0009997  3704.10   0.000      3.70104    3.704982
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3124e+12)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(2, 205)         =    1753.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0186
                                                Root MSE          =     .37193

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0457721   .0017352    26.38   0.000     .0423509    .0491932
       trend |   .0021418    .000064    33.48   0.000     .0020156    .0022679
       _cons |   3.643633   .0029638  1229.39   0.000      3.63779    3.649477
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   2,    205) =    1556.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2109
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0366387   .0018216    20.11   0.000     .0330472    .0402303
       trend |   .0017363   .0000616    28.17   0.000     .0016148    .0018578
       _cons |   3.658914   .0012433  2942.80   0.000     3.656462    3.661365
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2209
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |   3.723043   8.44e-17  4.4e+16   0.000     3.723043    3.723043
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =    1638.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2126
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3341

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0321393   .0020353    15.79   0.000     .0281265    .0361522
       trend |   .0019025   .0000647    29.40   0.000     .0017749      .00203
       _cons |   3.657005   .0012206  2996.02   0.000     3.654599    3.659412
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     395.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2117
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3344

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |    .036481    .001835    19.88   0.000     .0328632    .0400989
       _cons |   3.703776   .0009691  3821.85   0.000     3.701866    3.705687
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3124e+12)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =     891.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0187
                                                Root MSE          =     .37193

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0526597    .008021     6.57   0.000     .0368455    .0684739
    post_hhi |    -.01409   .0363335    -0.39   0.699    -.0857252    .0575452
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.0191689   .0205992    -0.93   0.353    -.0597823    .0214445
       trend |   .0021432    .000064    33.47   0.000     .0020169    .0022695
       _cons |   3.648697   .0135134   270.00   0.000     3.622054     3.67534
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   2.3124e+12)

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =     891.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0187
                                                Root MSE          =     .37193

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0526597    .008021     6.57   0.000     .0368455    .0684739
    post_hhi |    -.01409   .0363335    -0.39   0.699    -.0857252    .0575452
      np_HHI |  -.0191689   .0205992    -0.93   0.353    -.0597823    .0214445
       trend |   .0021432    .000064    33.47   0.000     .0020169    .0022695
       _cons |   3.648697   .0135134   270.00   0.000     3.622054     3.67534
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   2.3124e+12)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(2, 205)         =    1753.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0186
                                                Root MSE          =     .37193

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0457721   .0017352    26.38   0.000     .0423509    .0491932
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0021418    .000064    33.48   0.000     .0020156    .0022679
       _cons |   3.643633   .0029638  1229.39   0.000      3.63779    3.649477
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =    1065.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2110
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0150
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0212967   .0071892     2.96   0.003     .0071225    .0354709
     np_dhhi |          0  (omitted)
      np_HHI |   .0426149   .0185042     2.30   0.022      .006132    .0790978
       trend |   .0017346   .0000615    28.22   0.000     .0016134    .0018558
       _cons |   3.658936   .0012311  2972.03   0.000     3.656509    3.661364
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =    1065.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2110
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0150
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0212967   .0071892     2.96   0.003     .0071225    .0354709
      np_HHI |   .0426149   .0185042     2.30   0.022      .006132    .0790978
       trend |   .0017346   .0000615    28.22   0.000     .0016134    .0018558
       _cons |   3.658936   .0012311  2972.03   0.000     3.656509    3.661364
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   2,    205) =    1556.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2109
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0366387   .0018216    20.11   0.000     .0330472    .0402303
     np_dhhi |          0  (omitted)
       trend |   .0017363   .0000616    28.17   0.000     .0016148    .0018578
       _cons |   3.658914   .0012433  2942.80   0.000     3.656462    3.661365
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       5.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0193
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2210
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |   .0445937   .0189137     2.36   0.019     .0073034     .081884
       _cons |   3.714543   .0036052  1030.32   0.000     3.707435    3.721651
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       5.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0193
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2210
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   .0445937   .0189137     2.36   0.019     .0073034     .081884
       _cons |   3.714543   .0036052  1030.32   0.000     3.707435    3.721651
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2209
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |   3.723043   8.44e-17  4.4e+16   0.000     3.723043    3.723043
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =    1120.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2127
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3341

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0168197   .0072415     2.32   0.021     .0025422    .0310971
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |   .0425422   .0184955     2.30   0.022     .0060764     .079008
       trend |   .0019009   .0000646    29.44   0.000     .0017736    .0020282
       _cons |   3.657026   .0012085  3026.17   0.000     3.654644    3.659409
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     228.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2117
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3344

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0230605   .0091736     2.51   0.013     .0049737    .0411473
     np_dhhi |          0  (omitted)
      np_HHI |   .0372319   .0235315     1.58   0.115     -.009163    .0836267
       _cons |   3.703767    .000963  3846.18   0.000     3.701868    3.705666
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =    1120.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2127
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3341

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0168197   .0072415     2.32   0.021     .0025422    .0310971
      np_HHI |   .0425422   .0184955     2.30   0.022     .0060764     .079008
       trend |   .0019009   .0000646    29.44   0.000     .0017736    .0020282
       _cons |   3.657026   .0012085  3026.17   0.000     3.654644    3.659409
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     228.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2117
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3344

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0230605   .0091736     2.51   0.013     .0049737    .0411473
      np_HHI |   .0372319   .0235315     1.58   0.115     -.009163    .0836267
       _cons |   3.703767    .000963  3846.18   0.000     3.701868    3.705666
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =    1638.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2126
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3341

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0321393   .0020353    15.79   0.000     .0281265    .0361522
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0019025   .0000647    29.40   0.000     .0017749      .00203
       _cons |   3.657005   .0012206  2996.02   0.000     3.654599    3.659412
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     395.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2117
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3344

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .036481    .001835    19.88   0.000     .0328632    .0400989
     np_dhhi |          0  (omitted)
       _cons |   3.703776   .0009691  3821.85   0.000     3.701866    3.705687
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3097e+12)

Linear regression                               Number of obs     =    632,806
                                                F(4, 205)         =    5491.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0195
                                                Root MSE          =     .37181

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.8654364   .0060149  -143.88   0.000    -.8772954   -.8535775
 post_merger |   .0457625   .0017955    25.49   0.000     .0422225    .0493025
log_hhinc_~j |   .0036262   .0031426     1.15   0.250    -.0025697    .0098221
       trend |   .0021322   .0000644    33.11   0.000     .0020052    .0022592
       _cons |   3.607323   .0317824   113.50   0.000     3.544661    3.669985
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   4,    205) =     772.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2110
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0563162    .005368   -10.49   0.000    -.0668999   -.0457326
 post_merger |   .0364159   .0018636    19.54   0.000     .0327415    .0400902
log_hhinc_~j |   .0033518   .0016625     2.02   0.045      .000074    .0066295
       trend |   .0017298   .0000615    28.14   0.000     .0016086     .001851
       _cons |   3.625293    .016763   216.27   0.000     3.592243    3.658343
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   2,    205) =      78.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2210
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   -.065389   .0052165   -12.53   0.000    -.0756739   -.0551041
log_hhinc_~j |   .0003613   .0010893     0.33   0.740    -.0017863     .002509
       _cons |   3.719508   .0110453   336.75   0.000     3.697731    3.741285
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   4,    205) =     815.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2127
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3342

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0558511   .0053941   -10.35   0.000    -.0664862    -.045216
 post_merger |   .0319172   .0020825    15.33   0.000     .0278113    .0360231
log_hhinc_~j |   .0032708   .0016756     1.95   0.052    -.0000329    .0065745
       trend |   .0018963   .0000648    29.26   0.000     .0017685     .002024
       _cons |   3.624198   .0168985   214.47   0.000     3.590881    3.657516
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =     152.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2118
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0547084   .0054786    -9.99   0.000      -.06551   -.0439069
 post_merger |   .0361016   .0018925    19.08   0.000     .0323703    .0398328
log_hhinc_~j |   .0046396   .0017776     2.61   0.010     .0011349    .0081443
       _cons |   3.657037   .0178606   204.75   0.000     3.621823    3.692251
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3097e+12)

Linear regression                               Number of obs     =    632,806
                                                F(5, 205)         =    7904.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1109
                                                Root MSE          =     .35406

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.5369918   .0064629   -83.09   0.000    -.5497339   -.5242496
 post_merger |  -.2823353   .0026803  -105.34   0.000    -.2876199   -.2770508
post_merg~or |    .402661    .003177   126.74   0.000     .3963973    .4089248
       trend |   .0021162   .0000611    34.64   0.000     .0019958    .0022367
log_hhinc_~j |   .0038135   .0031322     1.22   0.225    -.0023619    .0099888
       _cons |   3.605643   .0316761   113.83   0.000      3.54319    3.668095
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   5,    205) =     768.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2174
                                                  Adj R-squared   =     0.2128
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        206        Root MSE        =     0.3332

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0660979   .0059446    11.12   0.000     .0543775    .0778182
 post_merger |  -.0865729   .0026358   -32.84   0.000    -.0917696   -.0813761
post_merg~or |    .152555   .0031715    48.10   0.000      .146302     .158808
       trend |   .0017541   .0000615    28.54   0.000     .0016329    .0018753
log_hhinc_~j |    .003437   .0016772     2.05   0.042     .0001301    .0067438
       _cons |   3.623033    .016903   214.34   0.000     3.589708    3.656359
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =     844.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2324
                                                  Adj R-squared   =     0.2278
                                                  Within R-sq.    =     0.0088
Number of clusters (dma_code) =        206        Root MSE        =     0.3300

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0605231   .0057424    10.54   0.000     .0492014    .0718448
post_merg~or |   .1571562   .0032096    48.96   0.000     .1508282    .1634842
log_hhinc_~j |   .0004055   .0010861     0.37   0.709    -.0017358    .0025468
       _cons |   3.651277   .0111824   326.52   0.000      3.62923    3.673324
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   5,    205) =     836.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2191
                                                  Adj R-squared   =     0.2145
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        206        Root MSE        =     0.3328

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0665917   .0059701    11.15   0.000      .054821    .0783623
 post_merger |  -.0910312   .0025816   -35.26   0.000     -.096121   -.0859414
post_merg~or |   .1526185   .0031718    48.12   0.000      .146365     .158872
log_hhinc_~j |   .0033551   .0016879     1.99   0.048     .0000273    .0066829
       trend |   .0019198   .0000651    29.50   0.000     .0017915    .0020481
       _cons |   3.621918   .0170127   212.89   0.000     3.588375     3.65546
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   4,    205) =     603.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2182
                                                  Adj R-squared   =     0.2131
                                                  Within R-sq.    =     0.0090
Number of clusters (dma_code) =        206        Root MSE        =     0.3331

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0670457    .006027    11.12   0.000      .055163    .0789285
 post_merger |  -.0867925   .0026727   -32.47   0.000    -.0920621    -.081523
post_merg~or |   .1524188   .0031723    48.05   0.000     .1461644    .1586733
log_hhinc_~j |   .0047069   .0018083     2.60   0.010     .0011417    .0082721
       _cons |   3.655594   .0181638   201.26   0.000     3.619783    3.691406
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.3097e+12)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    632,806
                                                F(3, 205)         =    1151.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0186
                                                Root MSE          =     .37198

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0454085   .0017931    25.32   0.000     .0418731    .0489439
       trend |   .0021353   .0000645    33.11   0.000     .0020082    .0022625
log_hhinc_~j |   .0036231   .0031424     1.15   0.250    -.0025724    .0098187
       _cons |   3.607313   .0317806   113.51   0.000     3.544655    3.669972
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   3,    205) =    1023.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2110
                                                  Adj R-squared   =     0.2063
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0363924   .0018633    19.53   0.000     .0327186    .0400662
       trend |   .0017299   .0000615    28.14   0.000     .0016087    .0018511
log_hhinc_~j |   .0033516   .0016625     2.02   0.045     .0000737    .0066294
       _cons |   3.625296   .0167634   216.26   0.000     3.592245    3.658347
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   1,    205) =       0.11
Statistics robust to heteroskedasticity           Prob > F        =     0.7406
                                                  R-squared       =     0.2256
                                                  Adj R-squared   =     0.2210
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.3314

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |   .0003611   .0010895     0.33   0.741    -.0017869    .0025092
       _cons |   3.719499   .0110473   336.69   0.000     3.697718     3.74128
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 3 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =    1077.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2127
                                                  Adj R-squared   =     0.2080
                                                  Within R-sq.    =     0.0149
Number of clusters (dma_code) =        206        Root MSE        =     0.3342

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0318943   .0020823    15.32   0.000     .0277889    .0359997
       trend |   .0018963   .0000648    29.27   0.000     .0017686    .0020241
log_hhinc_~j |   .0032705   .0016757     1.95   0.052    -.0000332    .0065743
       _cons |   3.624202    .016899   214.46   0.000     3.590883     3.65752
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   2,    205) =     202.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2118
                                                  Adj R-squared   =     0.2066
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        206        Root MSE        =     0.3345

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0360789   .0018922    19.07   0.000     .0323482    .0398095
log_hhinc_~j |   .0046396   .0017775     2.61   0.010     .0011351    .0081441
       _cons |   3.657039   .0178596   204.77   0.000     3.621827    3.692251
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7952e+10)

Linear regression                               Number of obs     =    633,508
                                                F(3, 205)         =    2326.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0272
                                                Root MSE          =     .44254

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.7724559   .0113581   -68.01   0.000    -.7948495   -.7500624
 post_merger |   .0612992   .0052034    11.78   0.000     .0510401    .0715582
       trend |   .0020069   .0001063    18.89   0.000     .0017974    .0022164
       _cons |   3.542235   .0053604   660.81   0.000     3.531667    3.552804
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =     183.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5510
                                                  Adj R-squared   =     0.5483
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0247538   .0110072    -2.25   0.026    -.0464556    -.003052
 post_merger |   .0282337   .0020908    13.50   0.000     .0241115    .0323558
       trend |   .0007576   .0000783     9.68   0.000     .0006032    .0009119
       _cons |    3.58817   .0018853  1903.20   0.000     3.584453    3.591887
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       7.39
Statistics robust to heteroskedasticity           Prob > F        =     0.0071
                                                  R-squared       =     0.5566
                                                  Adj R-squared   =     0.5540
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2996

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0307814   .0113216    -2.72   0.007    -.0531032   -.0084597
       _cons |   3.622249    .000049  7.4e+04   0.000     3.622152    3.622345
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     178.16
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5516
                                                  Adj R-squared   =     0.5489
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3013

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0244835   .0109967    -2.23   0.027    -.0461646   -.0028025
 post_merger |    .025662    .002429    10.56   0.000      .020873    .0304509
       trend |   .0008529   .0000882     9.67   0.000      .000679    .0010267
       _cons |   3.587058   .0019106  1877.44   0.000     3.583291    3.590825
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =      95.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5514
                                                  Adj R-squared   =     0.5484
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0266241   .0111678    -2.38   0.018    -.0486427   -.0046056
 post_merger |    .028156   .0021024    13.39   0.000     .0240108    .0323011
       _cons |    3.60764   .0010704  3370.50   0.000     3.605529     3.60975
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7952e+10)

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =    3091.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1050
                                                Root MSE          =     .42449

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.5900359   .0130201   -45.32   0.000    -.6157063   -.5643654
 post_merger |  -.1279606   .0070363   -18.19   0.000    -.1418334   -.1140879
post_merg~or |   .3493894   .0073644    47.44   0.000     .3348698     .363909
       trend |   .0023023   .0000827    27.86   0.000     .0021393    .0024652
       _cons |   3.538388   .0051753   683.71   0.000     3.528184    3.548591
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   4,    205) =     400.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5552
                                                  Adj R-squared   =     0.5526
                                                  Within R-sq.    =     0.0152
Number of clusters (dma_code) =        206        Root MSE        =     0.3001

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0372743   .0120733     3.09   0.002     .0134705     .061078
 post_merger |  -.0340062   .0036587    -9.29   0.000    -.0412198   -.0267926
post_merg~or |   .1205204   .0047837    25.19   0.000     .1110889    .1299519
       trend |   .0007665     .00008     9.59   0.000     .0006089    .0009242
       _cons |    3.58765   .0018944  1893.80   0.000     3.583915    3.591386
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     385.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5610
                                                  Adj R-squared   =     0.5584
                                                  Within R-sq.    =     0.0099
Number of clusters (dma_code) =        206        Root MSE        =     0.2982

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0323337    .012407     2.61   0.010     .0078721    .0567953
post_merg~or |   .1228362   .0048428    25.36   0.000     .1132881    .1323842
       _cons |   3.589081    .001324  2710.74   0.000      3.58647    3.591691
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   4,    205) =     394.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5558
                                                  Adj R-squared   =     0.5531
                                                  Within R-sq.    =     0.0152
Number of clusters (dma_code) =        206        Root MSE        =     0.2999

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0375602   .0120552     3.12   0.002     .0137921    .0613283
 post_merger |  -.0365343   .0038709    -9.44   0.000    -.0441663   -.0289024
post_merg~or |   .1205744   .0047889    25.18   0.000     .1111326    .1300161
       trend |   .0008621   .0000908     9.50   0.000     .0006831    .0010411
       _cons |   3.586495   .0019102  1877.51   0.000     3.582729    3.590261
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     330.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5556
                                                  Adj R-squared   =     0.5527
                                                  Within R-sq.    =     0.0100
Number of clusters (dma_code) =        206        Root MSE        =     0.3001

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0348454   .0121037     2.88   0.004     .0109816    .0587092
 post_merger |  -.0343727   .0036211    -9.49   0.000     -.041512   -.0272334
post_merg~or |   .1210433   .0047212    25.64   0.000     .1117349    .1303517
       _cons |   3.607363   .0011488  3140.05   0.000     3.605098    3.609628
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7952e+10)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(2, 205)         =     264.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0145
                                                Root MSE          =     .44543

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0530715   .0050792    10.45   0.000     .0430573    .0630858
       trend |   .0020798   .0001147    18.14   0.000     .0018537    .0023058
       _cons |   3.541286   .0054318   651.96   0.000     3.530576    3.551995
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   2,    205) =     223.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5510
                                                  Adj R-squared   =     0.5483
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0279707   .0020419    13.70   0.000     .0239449    .0319965
       trend |    .000758   .0000783     9.69   0.000     .0006037    .0009123
       _cons |   3.588187   .0018796  1909.05   0.000     3.584481    3.591893
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5566
                                                  Adj R-squared   =     0.5540
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2996

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
       _cons |   3.622115   1.22e-16  3.0e+16   0.000     3.622115    3.622115
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     222.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5516
                                                  Adj R-squared   =     0.5489
                                                  Within R-sq.    =     0.0058
Number of clusters (dma_code) =        206        Root MSE        =     0.3013

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0254062   .0023971    10.60   0.000     .0206801    .0301323
       trend |   .0008531   .0000881     9.68   0.000     .0006795    .0010268
       _cons |   3.587078   .0019041  1883.84   0.000     3.583323    3.590832
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     184.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5514
                                                  Adj R-squared   =     0.5484
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0278737    .002053    13.58   0.000      .023826    .0319215
       _cons |   3.607671   .0010639  3390.94   0.000     3.605573    3.609768
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7952e+10)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =     187.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0168
                                                Root MSE          =      .4449

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0940535   .0154204     6.10   0.000     .0636506    .1244563
    post_hhi |   .3596917   .0582451     6.18   0.000     .2448555     .474528
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.1208455   .0439308    -2.75   0.006    -.2074597   -.0342313
       trend |   .0020712   .0001153    17.97   0.000     .0018439    .0022985
       _cons |   3.419091   .0216899   157.64   0.000     3.376328    3.461855
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   4.7952e+10)

Linear regression                               Number of obs     =    633,508
                                                F(4, 205)         =     187.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0168
                                                Root MSE          =      .4449

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0940535   .0154204     6.10   0.000     .0636506    .1244563
    post_hhi |   .3596917   .0582451     6.18   0.000     .2448555     .474528
      np_HHI |  -.1208455   .0439308    -2.75   0.006    -.2074597   -.0342313
       trend |   .0020712   .0001153    17.97   0.000     .0018439    .0022985
       _cons |   3.419091   .0216899   157.64   0.000     3.376328    3.461855
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   4.7952e+10)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    633,508
                                                F(2, 205)         =     264.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0145
                                                Root MSE          =     .44543

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0530715   .0050792    10.45   0.000     .0430573    .0630858
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0020798   .0001147    18.14   0.000     .0018537    .0023058
       _cons |   3.541286   .0054318   651.96   0.000     3.530576    3.551995
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =     150.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5510
                                                  Adj R-squared   =     0.5483
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0371463   .0105413     3.52   0.001      .016363    .0579296
     np_dhhi |          0  (omitted)
      np_HHI |  -.0269816   .0297085    -0.91   0.365    -.0855549    .0315916
       trend |   .0007586   .0000783     9.69   0.000     .0006043    .0009129
       _cons |    3.58819   .0018851  1903.44   0.000     3.584473    3.591906
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   3,    205) =     150.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5510
                                                  Adj R-squared   =     0.5483
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0371463   .0105413     3.52   0.001      .016363    .0579296
      np_HHI |  -.0269816   .0297085    -0.91   0.365    -.0855549    .0315916
       trend |   .0007586   .0000783     9.69   0.000     .0006043    .0009129
       _cons |    3.58819   .0018851  1903.44   0.000     3.584473    3.591906
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 1 HDFE group                            F(   2,    205) =     223.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5510
                                                  Adj R-squared   =     0.5483
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0279707   .0020419    13.70   0.000     .0239449    .0319965
     np_dhhi |          0  (omitted)
       trend |    .000758   .0000783     9.69   0.000     .0006037    .0009123
       _cons |   3.588187   .0018796  1909.05   0.000     3.584481    3.591893
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       0.63
Statistics robust to heteroskedasticity           Prob > F        =     0.4275
                                                  R-squared       =     0.5566
                                                  Adj R-squared   =     0.5540
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2996

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
      np_HHI |  -.0236481   .0297416    -0.80   0.427    -.0822867    .0349904
       _cons |   3.626299   .0052612   689.25   0.000     3.615926    3.636672
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =       0.63
Statistics robust to heteroskedasticity           Prob > F        =     0.4275
                                                  R-squared       =     0.5566
                                                  Adj R-squared   =     0.5540
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2996

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0236481   .0297416    -0.80   0.427    -.0822867    .0349904
       _cons |   3.626299   .0052612   689.25   0.000     3.615926    3.636672
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   0,    205) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5566
                                                  Adj R-squared   =     0.5540
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2996

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |          0  (omitted)
       _cons |   3.622115   1.22e-16  3.0e+16   0.000     3.622115    3.622115
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     150.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5516
                                                  Adj R-squared   =     0.5489
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3013

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0346014    .010671     3.24   0.001     .0135624    .0556403
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
      np_HHI |  -.0270334   .0296332    -0.91   0.363    -.0854584    .0313916
       trend |   .0008537    .000088     9.70   0.000     .0006801    .0010272
       _cons |   3.587081   .0019174  1870.78   0.000     3.583301    3.590862
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     100.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5514
                                                  Adj R-squared   =     0.5484
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0339444   .0091705     3.70   0.000     .0158639    .0520249
     np_dhhi |          0  (omitted)
      np_HHI |  -.0178247   .0242276    -0.74   0.463    -.0655919    .0299425
       _cons |   3.607678    .001062  3397.18   0.000     3.605584    3.609772
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   3,    205) =     150.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5516
                                                  Adj R-squared   =     0.5489
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3013

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0346014    .010671     3.24   0.001     .0135624    .0556403
      np_HHI |  -.0270334   .0296332    -0.91   0.363    -.0854584    .0313916
       trend |   .0008537    .000088     9.70   0.000     .0006801    .0010272
       _cons |   3.587081   .0019174  1870.78   0.000     3.583301    3.590862
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     100.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5514
                                                  Adj R-squared   =     0.5484
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0339444   .0091705     3.70   0.000     .0158639    .0520249
      np_HHI |  -.0178247   .0242276    -0.74   0.463    -.0655919    .0299425
       _cons |   3.607678    .001062  3397.18   0.000     3.605584    3.609772
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   2,    205) =     222.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5516
                                                  Adj R-squared   =     0.5489
                                                  Within R-sq.    =     0.0058
Number of clusters (dma_code) =        206        Root MSE        =     0.3013

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0254062   .0023971    10.60   0.000     .0206801    .0301323
        dhhi |          0  (omitted)
     np_dhhi |          0  (omitted)
       trend |   .0008531   .0000881     9.68   0.000     .0006795    .0010268
       _cons |   3.587078   .0019041  1883.84   0.000     3.583323    3.590832
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)
note: np_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    633,497
Absorbing 2 HDFE groups                           F(   1,    205) =     184.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5514
                                                  Adj R-squared   =     0.5484
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0278737    .002053    13.58   0.000      .023826    .0319215
     np_dhhi |          0  (omitted)
       _cons |   3.607671   .0010639  3390.94   0.000     3.605573    3.609768
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7856e+10)

Linear regression                               Number of obs     =    632,806
                                                F(4, 205)         =    1751.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0272
                                                Root MSE          =     .44268

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.7723968   .0114103   -67.69   0.000    -.7948934   -.7499003
 post_merger |    .061448   .0052329    11.74   0.000     .0511308    .0717651
log_hhinc_~j |   .0012887   .0051957     0.25   0.804    -.0089551    .0115326
       trend |   .0020006   .0001073    18.64   0.000      .001789    .0022122
       _cons |   3.529065   .0510008    69.20   0.000     3.428512    3.629619
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   4,    205) =     138.72
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5513
                                                  Adj R-squared   =     0.5486
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0247356   .0110282    -2.24   0.026    -.0464788   -.0029923
 post_merger |   .0282513   .0020996    13.46   0.000     .0241118    .0323909
log_hhinc_~j |  -.0011398   .0028276    -0.40   0.687    -.0067148    .0044352
       trend |   .0007582   .0000791     9.58   0.000     .0006022    .0009143
       _cons |   3.599846   .0286088   125.83   0.000     3.543441    3.656251
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   2,    205) =       3.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0234
                                                  R-squared       =     0.5569
                                                  Adj R-squared   =     0.5542
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2997

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0308425   .0113163    -2.73   0.007    -.0531538   -.0085313
log_hhinc_~j |   .0009513   .0013475     0.71   0.481    -.0017055    .0036082
       _cons |   3.612561   .0138111   261.57   0.000     3.585331    3.639791
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   4,    205) =     134.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5518
                                                  Adj R-squared   =     0.5491
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3014

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0244609   .0110172    -2.22   0.027    -.0461824   -.0027394
 post_merger |   .0257617    .002442    10.55   0.000     .0209471    .0305764
log_hhinc_~j |  -.0013028   .0028632    -0.46   0.650    -.0069478    .0043423
       trend |    .000851   .0000894     9.52   0.000     .0006747    .0010273
       _cons |   3.600429   .0289699   124.28   0.000     3.543311    3.657546
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =      63.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5517
                                                  Adj R-squared   =     0.5487
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0265928   .0111811    -2.38   0.018    -.0486374   -.0045481
 post_merger |   .0280231   .0021197    13.22   0.000     .0238438    .0322024
log_hhinc_~j |   -.000771   .0029358    -0.26   0.793    -.0065592    .0050172
       _cons |   3.615648   .0299212   120.84   0.000     3.556656    3.674641
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7856e+10)

Linear regression                               Number of obs     =    632,806
                                                F(5, 205)         =    2601.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1051
                                                Root MSE          =      .4246

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.5899957   .0130548   -45.19   0.000    -.6157346   -.5642568
 post_merger |  -.1278082    .007047   -18.14   0.000    -.1417021   -.1139144
post_merg~or |   .3493863    .007368    47.42   0.000     .3348596    .3639131
       trend |   .0022969   .0000833    27.56   0.000     .0021326    .0024612
log_hhinc_~j |   .0009322   .0050563     0.18   0.854    -.0090369    .0109013
       _cons |   3.528849   .0496104    71.13   0.000     3.431037    3.626661
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   5,    205) =     319.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5555
                                                  Adj R-squared   =     0.5528
                                                  Within R-sq.    =     0.0152
Number of clusters (dma_code) =        206        Root MSE        =     0.3001

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0372457   .0120991     3.08   0.002     .0133911    .0611002
 post_merger |  -.0339385   .0036775    -9.23   0.000    -.0411892   -.0266879
post_merg~or |   .1204588   .0047962    25.12   0.000     .1110025    .1299151
       trend |   .0007669   .0000809     9.48   0.000     .0006074    .0009265
log_hhinc_~j |  -.0010493   .0029364    -0.36   0.721    -.0068388    .0047402
       _cons |   3.598396   .0296317   121.44   0.000     3.539974    3.656818
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =     260.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5613
                                                  Adj R-squared   =     0.5586
                                                  Within R-sq.    =     0.0099
Number of clusters (dma_code) =        206        Root MSE        =     0.2982

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0322405   .0124017     2.60   0.010     .0077893    .0566916
post_merg~or |   .1228112   .0048564    25.29   0.000     .1132363    .1323861
log_hhinc_~j |   .0010849   .0013401     0.81   0.419    -.0015572     .003727
       _cons |   3.577964   .0139704   256.11   0.000      3.55042    3.605508
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   5,    205) =     314.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5560
                                                  Adj R-squared   =     0.5534
                                                  Within R-sq.    =     0.0152
Number of clusters (dma_code) =        206        Root MSE        =     0.2999

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0375358   .0120806     3.11   0.002     .0137178    .0613539
 post_merger |  -.0363838    .003896    -9.34   0.000    -.0440652   -.0287025
post_merg~or |   .1205132   .0048016    25.10   0.000     .1110463    .1299801
log_hhinc_~j |  -.0012029   .0029654    -0.41   0.685    -.0070494    .0046436
       trend |   .0008599   .0000921     9.33   0.000     .0006782    .0010416
       _cons |   3.598839   .0299183   120.29   0.000     3.539852    3.657826
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   4,    205) =     249.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5559
                                                  Adj R-squared   =     0.5530
                                                  Within R-sq.    =     0.0100
Number of clusters (dma_code) =        206        Root MSE        =     0.3001

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0348396    .012122     2.87   0.004     .0109398    .0587394
 post_merger |  -.0344595    .003651    -9.44   0.000    -.0416578   -.0272613
post_merg~or |   .1209792   .0047307    25.57   0.000     .1116522    .1303063
log_hhinc_~j |  -.0008494   .0030507    -0.28   0.781    -.0068642    .0051654
       _cons |   3.616168   .0310441   116.49   0.000     3.554962    3.677375
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       206         206           0    *|
 dma_code#c.trend |       206           0         206    ?|
   entity_effects |      3722        3722           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.7856e+10)
note: post_merger_dhhi omitted because of collinearity

Linear regression                               Number of obs     =    632,806
                                                F(3, 205)         =     183.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0145
                                                Root MSE          =     .44557

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0532098   .0051126    10.41   0.000     .0431299    .0632898
       trend |   .0020721   .0001162    17.83   0.000     .0018429    .0023013
log_hhinc_~j |   .0019279   .0053159     0.36   0.717    -.0085529    .0124088
       _cons |   3.521604   .0521895    67.48   0.000     3.418707    3.624501
------------------------------------------------------------------------------
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 1 HDFE group                            F(   3,    205) =     153.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5512
                                                  Adj R-squared   =     0.5486
                                                  Within R-sq.    =     0.0059
Number of clusters (dma_code) =        206        Root MSE        =     0.3015

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0279877   .0020502    13.65   0.000     .0239455    .0320298
       trend |   .0007587   .0000791     9.59   0.000     .0006027    .0009147
log_hhinc_~j |  -.0011338   .0028252    -0.40   0.689     -.006704    .0044364
       _cons |   3.599802   .0285844   125.94   0.000     3.543445    3.656159
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   1,    205) =       0.50
Statistics robust to heteroskedasticity           Prob > F        =     0.4781
                                                  R-squared       =     0.5569
                                                  Adj R-squared   =     0.5542
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        206        Root MSE        =     0.2997

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
log_hhinc_~j |   .0009574   .0013473     0.71   0.478    -.0016989    .0036137
       _cons |   3.612365   .0138126   261.53   0.000     3.585132    3.639598
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      3722        3722           0    *|
   time_effects |        51           0          51     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    632,795
Absorbing 2 HDFE groups                           F(   3,    205) =     152.11
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5518
                                                  Adj R-squared   =     0.5491
                                                  Within R-sq.    =     0.0058
Number of clusters (dma_code) =        206        Root MSE        =     0.3014

                             (Std. Err. adjusted for 206 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |          0  (omitted)
 post_merger |   .0255051   .0024096    10.58   0.000     .0207543     .030256
       trend |   .0008512   .0000894     9.53   0.000     .0006751    .0010274
log_hhinc_~j |  -.0012972   .0028608    -0.45   0.651    -.0069376    .0043433
       _cons |   3.600391   .0289472   124.38   0.000     3.543319    3.657463
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |        12           0          12     |
 entity_effects |      3722        3722           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 11 singleton observations)
