
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Main/did_test2.do ../../../
> All/m_1785984020_2/intermediate ../output/ quarter 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_1785984020_2/intermediate

. log using `2'/did_stata_`3', text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_1785984020_2/intermediate/.
> ./output//did_stata_quarter.log
  log type:  text
 opened on:  20 Aug 2020, 23:00:37

. 
. import delimited "stata_did_`3'.csv", encoding(ISO-8859-1)
(23 vars, 64,428 obs)

. 
. /*Install Packages*/
. 
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /* Fixed Effects */
. egen entity_effects = group(upc dma_code)

. egen time_effects = group(year `3') /* same goes for month*/

. egen time_calendar = group(`3') /* same goes for month*/

. 
. 
. /* WEIGHTING SCHEMES */
. gen pre_vol = volume * (1 - post_merger)

. gen weights_0 = 1 /*to add weights that won't change things*/

. egen weights_1 = total(pre_vol), by(upc)

. egen weights_2 = total(pre_vol), by(dma_code)

. egen weights_3 = total(pre_vol), by(upc dma_code)

. replace weights_1 = round(weights_1)
(55,656 real changes made)

. replace weights_2 = round(weights_2)
(58,113 real changes made)

. replace weights_3 = round(weights_3)
(60,564 real changes made)

. 
. /*Naive Variables*/
. gen np_dhhi = post_merger*dhhi

. gen np_HHI = post_merger*post_hhi

. 
. 
. 
. forval x = 0/3 {
  2. 
. * No Fixed-Effects
. reg lprice post_merger_merging post_merger trend [aw = weights_`x'], vce(clus
> ter dma_code)
  3. est sto NO_FE_`x'
  4. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> ") replace
  5. 
. * Product/Market Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> entity_effects) vce(cluster dma_code)
  6. est sto PM_FE_`x'
  7. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE") append
  8. 
. 
. * Product/Market and Time Fixed-Effects
. reghdfe lprice post_merger_merging [aw = weights_`x'], abs(entity_effects tim
> e_effects) vce(cluster dma_code)
  9. est sto PMT_FE_`x'
 10. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE") append
 11. 
. 
. * Calendar Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> time_calendar entity_effects) vce(cluster dma_code)
 12. est sto PMT_C_`x'
 13. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE") append
 14. 
. * Dma-Specific Time Trends
. reghdfe lprice post_merger_merging post_merger [aw = weights_`x'], abs(dma_co
> de##c.trend entity_effects) vce(cluster dma_code)
 15. est sto PMT_t_`x'
 16. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends") append
 17. 
. 
. *MAJOR*
. 
. * No Fixed-Effects, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend [aw = weig
> hts_`x'], vce(cluster dma_code)
 18. est sto NO_FE_M_`x'
 19. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Major") append
 20. 
. 
. * Product/market Fixed-Effects (Time Trend)
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(entity_effects) vce(cluster dma_code)
 21. est sto PM_FE_M_`x'
 22. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, Major") append
 23. 
. 
. * Product/market and Time Fixed-Effects
. reghdfe lprice post_merger_merging post_merger_major [aw = weights_`x'], abs(
> entity_effects time_effects) vce(cluster dma_code)
 24. est sto PMT_FE_M_`x'
 25. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major") append
 26. 
. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 27. est sto PMT_C_M_`x'
 28. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Major") append
 29. 
. reghdfe lprice post_merger_merging post_merger post_merger_major [aw = weight
> s_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
 30. est sto PMT_t_M_`x'
 31. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Major") append
 32. 
. /******************************/
. /******************************/
. /******************************/
. 
. *DHHI
. 
. * No Fixed-Effects, DHHI
. reg lprice post_merger_dhhi post_merger trend [aw = weights_`x'], vce(cluster
>  dma_code)
 33. est sto NO_FE_DHHI_`x'
 34. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , DHHI") append
 35. 
. * Product/market Fixed-Effects, DHHI
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(ent
> ity_effects) vce(cluster dma_code)
 36. est sto PM_FE_DHHI_`x'
 37. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, DHHI") append
 38. 
. *Product/market and Time Fixed-Effects, DHHI.
. reghdfe lprice post_merger_dhhi [aw = weights_`x'], abs(entity_effects time_e
> ffects) vce(cluster dma_code)
 39. est sto PMT_FE_DHHHI_`x'
 40. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major") append
 41. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(tim
> e_calendar entity_effects) vce(cluster dma_code)
 42. est sto PMT_C_DHHI_`x'
 43. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, DHHI") append
 44. 
. reghdfe lprice post_merger_dhhi post_merger [aw = weights_`x'], abs(dma_code#
> #c.trend entity_effects) vce(cluster dma_code)
 45. est sto PMT_t_DHHI_`x'
 46. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, DHHI") append
 47. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. *NAIVE SPECIFICATIONS
. 
. 
. *No FE
. 
. *No Fixed-Effects naive DHHI and post-HHI
. reg lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`x'],
>  vce(cluster dma_code)
 48. est sto np_D_H_`x'
 49. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive DHHI & post HHI") append
 50. 
. *No Fixed-Effects naive post-HHI
. reg lprice post_merger post_hhi  np_HHI trend [aw = weights_`x'], vce(cluster
>  dma_code)
 51. est sto np_H_`x'
 52. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive post HHI") append
 53. 
. *No Fixed-Effects naive DHHI
. reg lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], vce(cluster dma
> _code)
 54. est sto np_D_`x'
 55. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Naive DHHI") append
 56. 
. *Product/market FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI trend [aw = weights_`x'], abs(entit
> y_effects) vce(cluster dma_code)
 57. est sto PM_FE_np_D_H_`x'
 58. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI & post HHI") append
 59. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice post_merger np_HHI trend [aw = weights_`x'], abs(entity_effect
> s) vce(cluster dma_code)
 60. est sto PM_FE_np_H_`x'
 61. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive post HHI") append
 62. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice post_merger np_dhhi trend [aw = weights_`x'], abs(entity_effec
> ts) vce(cluster dma_code)
 63. est sto PM_FE_np_D_`x'
 64. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI") append
 65. 
. *Product/Market and Time FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice np_dhhi np_HHI [aw = weights_`x'], abs(entity_effects time_eff
> ects) vce(cluster dma_code)
 66. est sto PMT_FE_np_D_H_`x'
 67. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI & post HHI") append
 68. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice np_HHI [aw = weights_`x'], abs(entity_effects time_effects) vc
> e(cluster dma_code)
 69. est sto PMT_FE_np_H_`x'
 70. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive post HHI") append
 71. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice np_dhhi [aw = weights_`x'], abs(entity_effects time_effects) v
> ce(cluster dma_code)
 72. est sto PMT_FE_np_D_`x'
 73. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Naive DHHI") append
 74. 
. 
. /******************************/
. 
. *Calendar Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`
> x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 75. est sto PMT_FE_t_np_D_H_`x'
 76. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive DHHI & post HHI") append
 77. 
. *DMA-trends, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI [aw = weights_`x'], abs(dma_code##c
> .trend entity_effects) vce(cluster dma_code)
 78. est sto PMT_FE_t_np_D_H_`x'
 79. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive DHHI & post HHI") append
 80. 
. *Calendar Fixed-Effects, naive post-HHI
. reghdfe lprice post_hhi post_merger np_HHI trend [aw = weights_`x'], abs(time
> _calendar entity_effects) vce(cluster dma_code)
 81. est sto PMT_FE_t_np_H_`x'
 82. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive post HHI") append
 83. 
. *DMA-trends, naive post-HHI
. reghdfe lprice post_merger np_HHI [aw = weights_`x'], abs(dma_code##c.trend e
> ntity_effects) vce(cluster dma_code)
 84. est sto PMT_FE_t_np_H_`x'
 85. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive post HHI") append
 86. 
. *Calendar Fixed-Effects, naive DHHI
. reghdfe lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], abs(time_ca
> lendar entity_effects) vce(cluster dma_code)
 87. est sto PMT_FE_t_np_D_`x'
 88. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Naive DHHI") append
 89. 
. *DMA-trends, naive DHHI
. reghdfe lprice post_merger np_dhhi [aw = weights_`x'], abs(dma_code##c.trend 
> entity_effects) vce(cluster dma_code)
 90. est sto PMT_FE_t_np_D_`x'
 91. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Naive DHHI") append
 92. 
. 
. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. 
. 
. * No Fixed-Effects, Demographics
. reg lprice post_merger_merging post_merger log_hhinc_per_person_adj trend [aw
>  = weights_`x'], vce(cluster dma_code)
 93. est sto NO_FE_d_`x'
 94. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Demographics") append
 95. 
. * Product/market Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 96. *note: this one  seemed to have both Time F-E and Time-Trends*
. est sto PM_FE_d_`x'
 97. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roducts FE, Demographics") append
 98. 
. * Product/market and Time Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging log_hhinc_per_person_adj [aw = weights_`x'
> ], abs(entity_effects time_effects) vce(cluster dma_code)
 99. est sto PMT_FE_d_`x'
100. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Demographics") append
101. 
. 
. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
102. est sto PMT_C_d_`x'
103. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Demographics") append
104. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj [aw =
>  weights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
105. est sto PMT_t_d_`x'
106. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Demographics") append
107. 
. 
. 
. * No Fixed-Effects, Demographics, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend log_hhinc_
> per_person_adj [aw = weights_`x'], vce(cluster dma_code)
108. est sto NO_FE_d_M_`x'
109. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , Major, Demographics") append
110. 
. *Products/market Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger post_merger_major trend log_hh
> inc_per_person_adj [aw = weights_`x'], abs(entity_effects) vce(cluster dma_co
> de)
111. est sto PM_FE_d_M_`x'
112. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, Major, Demographics") append
113. 
. *Products/market and Time Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger_major log_hhinc_per_person_adj
>  [aw = weights_`x'], abs(entity_effects time_effects) vce(cluster dma_code)
114. est sto PMT_FE_d_M_`x'
115. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, Major, Demographics") append
116. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj trend [aw = weights_`x'], abs(time_calendar entity_effects) vce(
> cluster dma_code)
117. est sto PMT_C_d_M_`x'
118. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, Major, Demographics") append
119. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj [aw = weights_`x'], abs(dma_code##c.trend entity_effects) vce(cl
> uster dma_code)
120. est sto PMT_t_d_M_`x'
121. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, Major, Demographics") append
122. 
. /******************************/
. /******************************/
. /******************************/
. 
. *No Fixed-Effects, DHHI, Demographics
. reg lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [aw = 
> weights_`x'], vce(cluster dma_code)
123. est sto NO_FE_DHHI_d_`x'
124. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("No FE
> , DHHI, Demographics") append
125. 
. *Product/market Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(entity_effects) vce(cluster dma_code)
126. est sto PM_FE_DHHI_d_`x'
127. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct FE, DHHI, Demographics") append
128. 
. *Product/market and Time Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi log_hhinc_per_person_adj [aw = weights_`x'], 
> abs(entity_effects time_effects) vce(cluster dma_code)
129. est sto PMT_FE_DHHI_d_`x'
130. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Time 
> FE, DHHI, Demographics") append
131. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
132. est sto PMT_C_d_D_`x'
133. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("Calen
> dar FE, DHHI, Demographics") append
134. 
. reghdfe lprice post_merger_dhhi post_merger log_hhinc_per_person_adj [aw = we
> ights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
135. est sto PMT_t_d_D_`x'
136. outreg2 using `2'/did_stata_`3'_`x'.txt, stats(coef se pval) ctitle("DMA/P
> roduct Trends, DHHI, Demographics") append
137. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. est clear
138. 
. 
. }
(sum of wgt is   6.4428e+04)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(2, 201)         =      32.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0011
                                                Root MSE          =     .53474

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0210466   .0048713    -4.32   0.000    -.0306521   -.0114411
       trend |   .0056958   .0007049     8.08   0.000     .0043059    .0070857
       _cons |   1.585604   .0104787   151.32   0.000     1.564942    1.606267
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   2,    201) =      89.40
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0065
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0257514   .0027109    -9.50   0.000    -.0310969   -.0204059
       trend |   .0043399   .0003477    12.48   0.000     .0036544    .0050255
       _cons |   1.601321    .002399   667.49   0.000      1.59659    1.606051
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   0,    201) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9431
                                                  Adj R-squared   =     0.9374
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        202        Root MSE        =     0.1330

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   1.619371   1.29e-16  1.3e+16   0.000     1.619371    1.619371
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =     111.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9420
                                                  Adj R-squared   =     0.9362
                                                  Within R-sq.    =     0.0072
Number of clusters (dma_code) =        202        Root MSE        =     0.1343

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0330373   .0029139   -11.34   0.000    -.0387829   -.0272916
       trend |   .0049227   .0003562    13.82   0.000     .0042203    .0056251
       _cons |   1.601015      .0024   667.10   0.000     1.596283    1.605747
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =      91.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0261464   .0027269    -9.59   0.000    -.0315233   -.0207694
       _cons |   1.633838   .0015087  1082.93   0.000     1.630863    1.636812
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.4428e+04)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(3, 201)         =     108.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0199
                                                Root MSE          =      .5297

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0596105   .0081251     7.34   0.000     .0435891     .075632
post_merg~or |  -.2015323   .0138981   -14.50   0.000    -.2289371   -.1741275
       trend |   .0056046     .00073     7.68   0.000     .0041651     .007044
       _cons |   1.585883   .0104713   151.45   0.000     1.565236    1.606531
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      71.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9419
                                                  Adj R-squared   =     0.9361
                                                  Within R-sq.    =     0.0080
Number of clusters (dma_code) =        202        Root MSE        =     0.1344

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0167931   .0036868    -4.55   0.000    -.0240628   -.0095234
post_merg~or |  -.0218817   .0051189    -4.27   0.000    -.0319754   -.0117881
       trend |   .0043704   .0003473    12.58   0.000     .0036855    .0050552
       _cons |   1.600956    .002419   661.82   0.000     1.596186    1.605726
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =      18.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        202        Root MSE        =     0.1329

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0219399   .0051298    -4.28   0.000     -.032055   -.0118247
       _cons |   1.624202   .0011295  1437.99   0.000     1.621975    1.626429
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      87.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9421
                                                  Adj R-squared   =     0.9363
                                                  Within R-sq.    =     0.0086
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0241516   .0038537    -6.27   0.000    -.0317506   -.0165527
post_merg~or |  -.0216814   .0051141    -4.24   0.000    -.0317655   -.0115973
       trend |    .004954   .0003557    13.93   0.000     .0042526    .0056554
       _cons |    1.60064   .0024202   661.36   0.000     1.595868    1.605412
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      66.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9434
                                                  Adj R-squared   =     0.9373
                                                  Within R-sq.    =     0.0046
Number of clusters (dma_code) =        202        Root MSE        =     0.1331

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0157411   .0036885    -4.27   0.000    -.0230142    -.008468
post_merg~or |  -.0254695    .005299    -4.81   0.000    -.0359183   -.0150206
       _cons |   1.633688   .0014968  1091.46   0.000     1.630737     1.63664
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.4428e+04)

Linear regression                               Number of obs     =     64,428
                                                F(3, 201)         =      26.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0014
                                                Root MSE          =     .53466

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   6.369026   1.379226     4.62   0.000     3.649419    9.088633
 post_merger |  -.0227285   .0049714    -4.57   0.000    -.0325312   -.0129257
       trend |   .0057071   .0007061     8.08   0.000     .0043149    .0070994
       _cons |   1.585569   .0104812   151.28   0.000     1.564902    1.606237
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      63.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0067
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   1.585538   .6574699     2.41   0.017     .2891152    2.881962
 post_merger |  -.0261697   .0027378    -9.56   0.000    -.0315683   -.0207711
       trend |    .004343   .0003479    12.48   0.000      .003657     .005029
       _cons |   1.601312   .0023911   669.69   0.000     1.596597    1.606026
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       5.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0163
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        202        Root MSE        =     0.1330

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   1.629718   .6727513     2.42   0.016     .3031623    2.956274
       _cons |   1.619147   .0000925  1.7e+04   0.000     1.618965     1.61933
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      77.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9420
                                                  Adj R-squared   =     0.9362
                                                  Within R-sq.    =     0.0073
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   1.564136   .6566525     2.38   0.018      .269325    2.858948
 post_merger |  -.0334487   .0029383   -11.38   0.000    -.0392426   -.0276548
       trend |   .0049258   .0003564    13.82   0.000      .004223    .0056285
       _cons |   1.601005   .0023937   668.85   0.000     1.596285    1.605725
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      65.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0027
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   -1.17271   .3583364    -3.27   0.001     -1.87929   -.4661287
 post_merger |  -.0258332   .0027531    -9.38   0.000    -.0312619   -.0204045
       _cons |   1.633826   .0015084  1083.16   0.000     1.630851      1.6368
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.4428e+04)

Linear regression                               Number of obs     =     64,428
                                                F(6, 201)         =      13.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0017
                                                Root MSE          =     .53461

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0036582   .0151798    -0.24   0.810    -.0335904    .0262739
    post_hhi |  -.0201105    .051927    -0.39   0.699    -.1225021    .0822811
        dhhi |   .9573656   .9938764     0.96   0.337    -1.002396    2.917127
     np_dhhi |   4.704191   1.309885     3.59   0.000     2.121312     7.28707
      np_HHI |  -.0372197   .0296151    -1.26   0.210    -.0956158    .0211764
       trend |   .0057202   .0007044     8.12   0.000     .0043313    .0071091
       _cons |   1.595299   .0291765    54.68   0.000     1.537767     1.65283
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   6.4428e+04)

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =      17.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0014
                                                Root MSE          =     .53466

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0005802   .0149645     0.04   0.969    -.0289274    .0300877
    post_hhi |   -.021586   .0510641    -0.42   0.673     -.122276    .0791039
      np_HHI |  -.0432292   .0293544    -1.47   0.142    -.1011113     .014653
       trend |   .0057107    .000703     8.12   0.000     .0043244     .007097
       _cons |   1.596335    .028438    56.13   0.000      1.54026    1.652411
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   6.4428e+04)

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =      20.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0014
                                                Root MSE          =     .53466

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0224047     .00493    -4.54   0.000    -.0321258   -.0126836
        dhhi |   1.176555   .7634091     1.54   0.125    -.3287627    2.681873
     np_dhhi |   5.192476   1.463207     3.55   0.000     2.307271    8.077681
       trend |   .0057083   .0007063     8.08   0.000     .0043157    .0071009
       _cons |   1.585233   .0106169   149.31   0.000     1.564298    1.606168
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   4,    201) =      49.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0071
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0099441   .0074914    -1.33   0.186     -.024716    .0048278
     np_dhhi |   1.189031   .5309495     2.24   0.026     .1420854    2.235977
      np_HHI |  -.0320785   .0140926    -2.28   0.024    -.0598668   -.0042902
       trend |   .0043479   .0003476    12.51   0.000     .0036625    .0050333
       _cons |   1.601258   .0023758   673.98   0.000     1.596573    1.605943
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      60.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0071
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0088235    .007337    -1.20   0.231    -.0232909    .0056439
      np_HHI |  -.0336842   .0139164    -2.42   0.016     -.061125   -.0062433
       trend |   .0043459   .0003475    12.51   0.000     .0036607    .0050311
       _cons |   1.601262   .0023809   672.55   0.000     1.596567    1.605957
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      63.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0067
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0261697   .0027378    -9.56   0.000    -.0315683   -.0207711
     np_dhhi |   1.585538   .6574699     2.41   0.017     .2891152    2.881962
       trend |    .004343   .0003479    12.48   0.000      .003657     .005029
       _cons |   1.601312   .0023911   669.69   0.000     1.596597    1.606026
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =       7.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0008
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0006
Number of clusters (dma_code) =        202        Root MSE        =     0.1329

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   1.237982   .5458134     2.27   0.024     .1617275    2.314237
      np_HHI |   -.031692   .0140051    -2.26   0.025    -.0593078   -.0040762
       _cons |   1.627999   .0039115   416.21   0.000     1.620287    1.635712
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       5.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0168
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0005
Number of clusters (dma_code) =        202        Root MSE        =     0.1329

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0333639   .0138365    -2.41   0.017    -.0606472   -.0060806
       _cons |   1.628634   .0038413   423.98   0.000     1.621059    1.636208
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       5.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0163
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        202        Root MSE        =     0.1330

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   1.629718   .6727513     2.42   0.016     .3031623    2.956274
       _cons |   1.619147   .0000925  1.7e+04   0.000     1.618965     1.61933
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   4,    201) =      59.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9421
                                                  Adj R-squared   =     0.9363
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0172682   .0076028    -2.27   0.024    -.0322596   -.0022767
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   1.168782   .5307759     2.20   0.029     .1221791    2.215386
      np_HHI |   -.031986   .0141171    -2.27   0.025    -.0598226   -.0041494
       trend |   .0049306   .0003561    13.85   0.000     .0042286    .0056327
       _cons |    1.60095   .0023806   672.49   0.000     1.596256    1.605645
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      77.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0029
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0050191   .0076453    -0.66   0.512    -.0200944    .0100562
     np_dhhi |  -1.654815   .2553241    -6.48   0.000    -2.158272   -1.151358
      np_HHI |  -.0412116   .0144938    -2.84   0.005     -.069791   -.0126322
       _cons |   1.633817   .0014743  1108.18   0.000      1.63091    1.636724
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      75.70
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9421
                                                  Adj R-squared   =     0.9363
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.0161675   .0074496    -2.17   0.031    -.0308569    -.001478
      np_HHI |  -.0335643     .01394    -2.41   0.017    -.0610517   -.0060769
       trend |   .0049287   .0003559    13.85   0.000     .0042268    .0056305
       _cons |   1.600955   .0023846   671.36   0.000     1.596253    1.605657
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      50.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0028
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0066541   .0075461    -0.88   0.379    -.0215338    .0082255
      np_HHI |  -.0388346   .0143782    -2.70   0.008    -.0671861   -.0104831
       _cons |   1.633834   .0014772  1106.04   0.000     1.630921    1.636747
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      77.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9420
                                                  Adj R-squared   =     0.9362
                                                  Within R-sq.    =     0.0073
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0334487   .0029383   -11.38   0.000    -.0392426   -.0276548
        dhhi |          0  (omitted)
     np_dhhi |   1.564136   .6566525     2.38   0.018      .269325    2.858948
       trend |   .0049258   .0003564    13.82   0.000      .004223    .0056285
       _cons |   1.601005   .0023937   668.85   0.000     1.596285    1.605725
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      65.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0027
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0258332   .0027531    -9.38   0.000    -.0312619   -.0204045
     np_dhhi |   -1.17271   .3583364    -3.27   0.001     -1.87929   -.4661287
       _cons |   1.633826   .0015084  1083.16   0.000     1.630851      1.6368
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.4428e+04)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(3, 201)         =      21.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0022
                                                Root MSE          =     .53447

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0219485   .0050823    -4.32   0.000      -.03197    -.011927
log_hhinc_~j |   .0828132   .0382527     2.16   0.032     .0073851    .1582413
       trend |   .0059606   .0007439     8.01   0.000     .0044938    .0074274
       _cons |   .7383648   .3906007     1.89   0.060    -.0318358    1.508565
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      66.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0069
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0259298   .0027102    -9.57   0.000    -.0312738   -.0205858
log_hhinc_~j |   .0215683   .0086972     2.48   0.014     .0044188    .0387178
       trend |   .0044016    .000347    12.68   0.000     .0037173     .005086
       _cons |   1.380685   .0887376    15.56   0.000     1.205709    1.555661
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       0.11
Statistics robust to heteroskedasticity           Prob > F        =     0.7398
                                                  R-squared       =     0.9431
                                                  Adj R-squared   =     0.9374
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        202        Root MSE        =     0.1330

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |   .0025672   .0077201     0.33   0.740    -.0126556    .0177899
       _cons |   1.593153   .0788449    20.21   0.000     1.437684    1.748622
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      79.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9420
                                                  Adj R-squared   =     0.9362
                                                  Within R-sq.    =     0.0074
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0330584    .002921   -11.32   0.000     -.038818   -.0272987
log_hhinc_~j |   .0185095   .0087427     2.12   0.035     .0012703    .0357488
       trend |   .0049595   .0003574    13.88   0.000     .0042548    .0056641
       _cons |   1.411716   .0892053    15.83   0.000     1.235818    1.587614
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      52.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0031
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0263833    .002747    -9.60   0.000    -.0317998   -.0209667
log_hhinc_~j |   .0296774   .0080022     3.71   0.000     .0138984    .0454564
       _cons |   1.330875   .0817331    16.28   0.000      1.16971    1.492039
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.4428e+04)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =      79.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0207
                                                Root MSE          =     .52949

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0583428    .008306     7.02   0.000     .0419648    .0747208
post_merg~or |  -.2003451   .0139962   -14.31   0.000    -.2279433   -.1727469
       trend |   .0058378   .0007678     7.60   0.000     .0043239    .0073518
log_hhinc_~j |   .0727769   .0378859     1.92   0.056    -.0019278    .1474817
       _cons |   .8413206    .387111     2.17   0.031      .078001     1.60464
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   4,    201) =      56.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9419
                                                  Adj R-squared   =     0.9361
                                                  Within R-sq.    =     0.0084
Number of clusters (dma_code) =        202        Root MSE        =     0.1344

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0169688   .0036712    -4.62   0.000    -.0242078   -.0097298
post_merg~or |  -.0218889   .0051234    -4.27   0.000    -.0319914   -.0117865
       trend |   .0044322   .0003469    12.78   0.000     .0037482    .0051162
log_hhinc_~j |   .0216006   .0087069     2.48   0.014      .004432    .0387692
       _cons |   1.379989    .088851    15.53   0.000     1.204789    1.555188
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 7 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =       9.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        202        Root MSE        =     0.1329

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0219406   .0051305    -4.28   0.000    -.0320572    -.011824
log_hhinc_~j |   .0025968   .0077314     0.34   0.737    -.0126482    .0178418
       _cons |   1.597681   .0788106    20.27   0.000      1.44228    1.753083
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   4,    201) =      67.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9421
                                                  Adj R-squared   =     0.9363
                                                  Within R-sq.    =     0.0089
Number of clusters (dma_code) =        202        Root MSE        =     0.1341

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0241703   .0038494    -6.28   0.000    -.0317608   -.0165798
post_merg~or |  -.0216874    .005118    -4.24   0.000    -.0317793   -.0115956
log_hhinc_~j |   .0185407   .0087506     2.12   0.035     .0012859    .0357956
       trend |   .0049908   .0003571    13.98   0.000     .0042868    .0056949
       _cons |   1.411022   .0893017    15.80   0.000     1.234934     1.58711
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      46.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9435
                                                  Adj R-squared   =     0.9374
                                                  Within R-sq.    =     0.0051
Number of clusters (dma_code) =        202        Root MSE        =     0.1331

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0159665   .0036801    -4.34   0.000    -.0232229     -.00871
post_merg~or |  -.0255003   .0053012    -4.81   0.000    -.0359535   -.0150471
log_hhinc_~j |   .0298175   .0079837     3.73   0.000     .0140749    .0455601
       _cons |   1.329295   .0815517    16.30   0.000     1.168489    1.490102
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.4428e+04)

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =      20.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0025
                                                Root MSE          =     .53438

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   6.679942   1.309519     5.10   0.000     4.097784      9.2621
 post_merger |  -.0237257   .0051982    -4.56   0.000    -.0339756   -.0134757
       trend |   .0059764   .0007457     8.01   0.000      .004506    .0074468
log_hhinc_~j |   .0840293    .038178     2.20   0.029     .0087485      .15931
       _cons |   .7258871   .3898359     1.86   0.064    -.0428055     1.49458
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   4,    201) =      53.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0070
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   1.529029    .615896     2.48   0.014     .3145827    2.743475
 post_merger |  -.0263309   .0027375    -9.62   0.000    -.0317287   -.0209331
       trend |   .0044038   .0003472    12.68   0.000     .0037191    .0050884
log_hhinc_~j |   .0212863   .0086832     2.45   0.015     .0041645    .0384081
       _cons |    1.38356   .0885927    15.62   0.000      1.20887    1.558251
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =       2.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0527
                                                  R-squared       =     0.9432
                                                  Adj R-squared   =     0.9375
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        202        Root MSE        =     0.1330

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |    1.62366   .6674592     2.43   0.016     .3075394     2.93978
log_hhinc_~j |   .0022556   .0076811     0.29   0.769    -.0128904    .0174015
       _cons |   1.596112   .0784493    20.35   0.000     1.441423    1.750801
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   4,    201) =      62.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9421
                                                  Adj R-squared   =     0.9363
                                                  Within R-sq.    =     0.0075
Number of clusters (dma_code) =        202        Root MSE        =     0.1342

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   1.515831   .6210295     2.44   0.016     .2912628      2.7404
 post_merger |  -.0334568   .0029452   -11.36   0.000    -.0392643   -.0276492
       trend |   .0049619   .0003575    13.88   0.000      .004257    .0056668
log_hhinc_~j |   .0182294   .0087308     2.09   0.038     .0010138     .035445
       _cons |   1.414571   .0890812    15.88   0.000     1.238918    1.590225
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      44.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9433
                                                  Adj R-squared   =     0.9372
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        202        Root MSE        =     0.1332

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   -1.15193   .3890487    -2.96   0.003     -1.91907   -.3847894
 post_merger |  -.0260754   .0027738    -9.40   0.000    -.0315448   -.0206061
log_hhinc_~j |   .0296534   .0080056     3.70   0.000     .0138677    .0454391
       _cons |   1.331108   .0817671    16.28   0.000     1.169877    1.492339
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     63,695
                                                F(2, 201)         =      26.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0011
                                                Root MSE          =     .42798

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0259316   .0045896    -5.65   0.000    -.0349815   -.0168816
       trend |   .0051737   .0007218     7.17   0.000     .0037505    .0065969
       _cons |   1.602805    .009005   177.99   0.000     1.585048    1.620561
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   2,    201) =      72.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9328
                                                  Adj R-squared   =     0.9261
                                                  Within R-sq.    =     0.0121
Number of clusters (dma_code) =        202        Root MSE        =     0.1157

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0337803    .003561    -9.49   0.000     -.040802   -.0267586
       trend |    .005109   .0004424    11.55   0.000     .0042367    .0059813
       _cons |   1.609278   .0027026   595.45   0.000     1.603949    1.614607
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   0,    201) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9374
                                                  Adj R-squared   =     0.9312
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        202        Root MSE        =     0.1116

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   1.628488   5.70e-16  2.9e+15   0.000     1.628488    1.628488
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      97.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9332
                                                  Adj R-squared   =     0.9266
                                                  Within R-sq.    =     0.0136
Number of clusters (dma_code) =        202        Root MSE        =     0.1154

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0423748   .0038159   -11.10   0.000    -.0498992   -.0348504
       trend |    .005819   .0004353    13.37   0.000     .0049606    .0066773
       _cons |    1.60877   .0026323   611.17   0.000     1.603579     1.61396
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   1,    201) =      90.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9367
                                                  Adj R-squared   =     0.9300
                                                  Within R-sq.    =     0.0063
Number of clusters (dma_code) =        202        Root MSE        =     0.1126

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.033804   .0035516    -9.52   0.000    -.0408071   -.0268008
       _cons |   1.647215   .0019675   837.19   0.000     1.643335    1.651095
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     63,695
                                                F(3, 201)         =      23.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0073
                                                Root MSE          =     .42666

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0313523    .011217     2.80   0.006     .0092342    .0534704
post_merg~or |  -.0924803   .0162679    -5.68   0.000     -.124558   -.0604027
       trend |   .0050565   .0007374     6.86   0.000     .0036025    .0065104
       _cons |   1.603157    .009057   177.01   0.000     1.585298    1.621016
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   3,    201) =      64.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9333
                                                  Adj R-squared   =     0.9268
                                                  Within R-sq.    =     0.0209
Number of clusters (dma_code) =        202        Root MSE        =     0.1152

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0610171   .0058039   -10.51   0.000    -.0724615   -.0495727
post_merg~or |   .0442341   .0057378     7.71   0.000     .0329202    .0555481
       trend |   .0050963   .0004418    11.53   0.000      .004225    .0059675
       _cons |   1.609514   .0027197   591.80   0.000     1.604151    1.614877
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   1,    201) =      60.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9380
                                                  Adj R-squared   =     0.9319
                                                  Within R-sq.    =     0.0097
Number of clusters (dma_code) =        202        Root MSE        =     0.1111

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0446711   .0057605     7.75   0.000     .0333124    .0560299
       _cons |   1.613392   .0019466   828.82   0.000     1.609554    1.617231
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      78.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9338
                                                  Adj R-squared   =     0.9272
                                                  Within R-sq.    =     0.0225
Number of clusters (dma_code) =        202        Root MSE        =     0.1148

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0697913   .0060586   -11.52   0.000    -.0817379   -.0578447
post_merg~or |   .0444337   .0057341     7.75   0.000     .0331269    .0557405
       trend |   .0058111    .000434    13.39   0.000     .0049554    .0066667
       _cons |   1.609002   .0026392   609.66   0.000     1.603798    1.614206
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      60.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9373
                                                  Adj R-squared   =     0.9306
                                                  Within R-sq.    =     0.0153
Number of clusters (dma_code) =        202        Root MSE        =     0.1121

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0625335   .0056995   -10.97   0.000     -.073772    -.051295
post_merg~or |   .0465109   .0053756     8.65   0.000     .0359111    .0571107
       _cons |   1.647414   .0019694   836.49   0.000      1.64353    1.651297
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)

Linear regression                               Number of obs     =     63,695
                                                F(3, 201)         =      18.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0011
                                                Root MSE          =     .42798

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .5200859   .8029584     0.65   0.518    -1.063217    2.103389
 post_merger |  -.0260387   .0045939    -5.67   0.000    -.0350972   -.0169802
       trend |   .0051737   .0007218     7.17   0.000     .0037505    .0065969
       _cons |   1.602805    .009005   177.99   0.000     1.585049    1.620561
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   3,    201) =      57.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9328
                                                  Adj R-squared   =     0.9262
                                                  Within R-sq.    =     0.0132
Number of clusters (dma_code) =        202        Root MSE        =     0.1157

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   4.348979   1.017403     4.27   0.000     2.342828    6.355131
 post_merger |  -.0346775   .0036115    -9.60   0.000    -.0417988   -.0275562
       trend |   .0051071   .0004423    11.55   0.000      .004235    .0059793
       _cons |   1.609291   .0026746   601.68   0.000     1.604017    1.614565
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   1,    201) =      18.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9375
                                                  Adj R-squared   =     0.9313
                                                  Within R-sq.    =     0.0012
Number of clusters (dma_code) =        202        Root MSE        =     0.1116

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   4.344436    1.01831     4.27   0.000     2.336496    6.352376
       _cons |    1.62799   .0001167  1.4e+04   0.000      1.62776     1.62822
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      72.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9332
                                                  Adj R-squared   =     0.9266
                                                  Within R-sq.    =     0.0147
Number of clusters (dma_code) =        202        Root MSE        =     0.1153

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   4.351368   1.019444     4.27   0.000      2.34119    6.361546
 post_merger |  -.0432738   .0038624   -11.20   0.000    -.0508899   -.0356578
       trend |   .0058172   .0004353    13.36   0.000     .0049589    .0066755
       _cons |   1.608782   .0026061   617.31   0.000     1.603643    1.613921
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =     122.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9368
                                                  Adj R-squared   =     0.9300
                                                  Within R-sq.    =     0.0064
Number of clusters (dma_code) =        202        Root MSE        =     0.1126

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -2.597812   .3906593    -6.65   0.000    -3.368129   -1.827496
 post_merger |  -.0332641   .0035801    -9.29   0.000    -.0403234   -.0262048
       _cons |   1.647214   .0019623   839.41   0.000     1.643344    1.651083
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)

Linear regression                               Number of obs     =     63,695
                                                F(6, 201)         =      10.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0013
                                                Root MSE          =     .42796

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0285645   .0137575    -2.08   0.039     -.055692   -.0014369
    post_hhi |  -.0004278   .0493897    -0.01   0.993    -.0978161    .0969606
        dhhi |  -4.267909    1.80604    -2.36   0.019    -7.829126   -.7066929
     np_dhhi |   4.827001   1.753114     2.75   0.006     1.370148    8.283855
      np_HHI |   .0030952   .0251042     0.12   0.902    -.0464061    .0525965
       trend |   .0051716   .0007212     7.17   0.000     .0037495    .0065937
       _cons |    1.60394    .027062    59.27   0.000     1.550578    1.657301
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   1.7569e+11)

Linear regression                               Number of obs     =     63,695
                                                F(4, 201)         =      13.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0011
                                                Root MSE          =     .42798

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0244325   .0136181    -1.79   0.074    -.0512851    .0024202
    post_hhi |   .0048455   .0487872     0.10   0.921     -.091355    .1010459
      np_HHI |  -.0028533   .0250007    -0.11   0.909    -.0521506    .0464439
       trend |   .0051727   .0007212     7.17   0.000     .0037507    .0065948
       _cons |   1.600267   .0265576    60.26   0.000     1.547899    1.652634
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   1.7569e+11)

Linear regression                               Number of obs     =     63,695
                                                F(4, 201)         =      15.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0013
                                                Root MSE          =     .42795

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0269235   .0046321    -5.81   0.000    -.0360573   -.0177897
        dhhi |  -4.261992   1.705725    -2.50   0.013    -7.625403   -.8985815
     np_dhhi |   4.782079   1.704397     2.81   0.006     1.421286    8.142872
       trend |   .0051715   .0007217     7.17   0.000     .0037484    .0065946
       _cons |   1.603714   .0090745   176.73   0.000     1.585821    1.621608
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   4,    201) =      46.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9329
                                                  Adj R-squared   =     0.9262
                                                  Within R-sq.    =     0.0140
Number of clusters (dma_code) =        202        Root MSE        =     0.1156

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0158108   .0097573    -1.62   0.107    -.0350506     .003429
     np_dhhi |   3.834782    .851659     4.50   0.000     2.155449    5.514114
      np_HHI |  -.0355966   .0167314    -2.13   0.035    -.0685883   -.0026049
       trend |   .0051065   .0004415    11.57   0.000      .004236     .005977
       _cons |   1.609303   .0026433   608.83   0.000     1.604091    1.614515
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   3,    201) =      49.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9328
                                                  Adj R-squared   =     0.9262
                                                  Within R-sq.    =     0.0132
Number of clusters (dma_code) =        202        Root MSE        =     0.1157

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0125087   .0095944    -1.30   0.194    -.0314272    .0064098
      np_HHI |  -.0403611   .0166301    -2.43   0.016     -.073153   -.0075693
       trend |   .0051081   .0004414    11.57   0.000     .0042377    .0059785
       _cons |   1.609293   .0026633   604.24   0.000     1.604042    1.614545
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   3,    201) =      57.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9328
                                                  Adj R-squared   =     0.9262
                                                  Within R-sq.    =     0.0132
Number of clusters (dma_code) =        202        Root MSE        =     0.1157

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0346775   .0036115    -9.60   0.000    -.0417988   -.0275562
     np_dhhi |   4.348979   1.017403     4.27   0.000     2.342828    6.355131
       trend |   .0051071   .0004423    11.55   0.000      .004235    .0059793
       _cons |   1.609291   .0026746   601.68   0.000     1.604017    1.614565
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      15.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9375
                                                  Adj R-squared   =     0.9314
                                                  Within R-sq.    =     0.0020
Number of clusters (dma_code) =        202        Root MSE        =     0.1115

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |    3.84263   .8545579     4.50   0.000     2.157581    5.527678
      np_HHI |  -.0347386   .0163845    -2.12   0.035    -.0670461   -.0024312
       _cons |   1.638197    .004813   340.37   0.000     1.628707    1.647688
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   1,    201) =       5.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0162
                                                  R-squared       =     0.9375
                                                  Adj R-squared   =     0.9313
                                                  Within R-sq.    =     0.0011
Number of clusters (dma_code) =        202        Root MSE        =     0.1116

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   -.039513   .0162976    -2.42   0.016    -.0716491   -.0073769
       _cons |   1.640032   .0047617   344.42   0.000     1.630643    1.649421
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   1,    201) =      18.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9375
                                                  Adj R-squared   =     0.9313
                                                  Within R-sq.    =     0.0012
Number of clusters (dma_code) =        202        Root MSE        =     0.1116

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   4.344436    1.01831     4.27   0.000     2.336496    6.352376
       _cons |    1.62799   .0001167  1.4e+04   0.000      1.62776     1.62822
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   4,    201) =      58.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9333
                                                  Adj R-squared   =     0.9267
                                                  Within R-sq.    =     0.0155
Number of clusters (dma_code) =        202        Root MSE        =     0.1153

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0244069   .0098405    -2.48   0.014    -.0438108    -.005003
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   3.837153    .853654     4.49   0.000     2.153887    5.520419
      np_HHI |  -.0355978   .0167473    -2.13   0.035    -.0686207   -.0025749
       trend |   .0058167   .0004344    13.39   0.000     .0049601    .0066733
       _cons |   1.608793   .0025755   624.65   0.000     1.603715    1.613872
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      62.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9368
                                                  Adj R-squared   =     0.9300
                                                  Within R-sq.    =     0.0066
Number of clusters (dma_code) =        202        Root MSE        =     0.1126

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0139717   .0109083    -1.28   0.202     -.035481    .0075377
     np_dhhi |   -3.12144   .5977447    -5.22   0.000    -4.300095   -1.942785
      np_HHI |  -.0364048   .0179202    -2.03   0.044    -.0717404   -.0010692
       _cons |   1.647222   .0019329   852.20   0.000     1.643411    1.651033
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      66.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9332
                                                  Adj R-squared   =     0.9266
                                                  Within R-sq.    =     0.0147
Number of clusters (dma_code) =        202        Root MSE        =     0.1153

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.0211015   .0096804    -2.18   0.030    -.0401898   -.0020133
      np_HHI |  -.0403653   .0166454    -2.43   0.016    -.0731872   -.0075433
       trend |   .0058182   .0004343    13.40   0.000     .0049618    .0066746
       _cons |   1.608784   .0025941   620.17   0.000     1.603669    1.613899
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      55.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9368
                                                  Adj R-squared   =     0.9300
                                                  Within R-sq.    =     0.0065
Number of clusters (dma_code) =        202        Root MSE        =     0.1126

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0166072   .0107918    -1.54   0.125    -.0378869    .0046725
      np_HHI |  -.0326343   .0178063    -1.83   0.068    -.0677454    .0024768
       _cons |   1.647223   .0019422   848.12   0.000     1.643393    1.651053
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      72.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9332
                                                  Adj R-squared   =     0.9266
                                                  Within R-sq.    =     0.0147
Number of clusters (dma_code) =        202        Root MSE        =     0.1153

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0432738   .0038624   -11.20   0.000    -.0508899   -.0356578
        dhhi |          0  (omitted)
     np_dhhi |   4.351368   1.019444     4.27   0.000      2.34119    6.361546
       trend |   .0058172   .0004353    13.36   0.000     .0049589    .0066755
       _cons |   1.608782   .0026061   617.31   0.000     1.603643    1.613921
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =     122.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9368
                                                  Adj R-squared   =     0.9300
                                                  Within R-sq.    =     0.0064
Number of clusters (dma_code) =        202        Root MSE        =     0.1126

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0332641   .0035801    -9.29   0.000    -.0403234   -.0262048
     np_dhhi |  -2.597812   .3906593    -6.65   0.000    -3.368129   -1.827496
       _cons |   1.647214   .0019623   839.41   0.000     1.643344    1.651083
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     63,695
                                                F(3, 201)         =      20.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0039
                                                Root MSE          =     .42737

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0272009   .0049106    -5.54   0.000    -.0368837   -.0175181
log_hhinc_~j |   .1107006   .0323764     3.42   0.001     .0468596    .1745416
       trend |   .0055184   .0007426     7.43   0.000     .0040541    .0069827
       _cons |   .4716804   .3309448     1.43   0.156    -.1808887    1.124249
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   3,    201) =      59.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9329
                                                  Adj R-squared   =     0.9263
                                                  Within R-sq.    =     0.0145
Number of clusters (dma_code) =        202        Root MSE        =     0.1156

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0343445   .0035826    -9.59   0.000    -.0414088   -.0272801
log_hhinc_~j |    .048952   .0142753     3.43   0.001     .0208034    .0771005
       trend |   .0052606   .0004363    12.06   0.000     .0044003     .006121
       _cons |     1.1091    .145218     7.64   0.000     .8227533    1.395446
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   1,    201) =       2.07
Statistics robust to heteroskedasticity           Prob > F        =     0.1521
                                                  R-squared       =     0.9374
                                                  Adj R-squared   =     0.9312
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        202        Root MSE        =     0.1116

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |    .014781   .0102808     1.44   0.152    -.0054911    .0350531
       _cons |   1.477705   .1048759    14.09   0.000     1.270906    1.684503
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      74.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9333
                                                  Adj R-squared   =     0.9267
                                                  Within R-sq.    =     0.0157
Number of clusters (dma_code) =        202        Root MSE        =     0.1152

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.042574   .0038448   -11.07   0.000    -.0501554   -.0349926
log_hhinc_~j |   .0457913   .0143841     3.18   0.002     .0174283    .0741544
       trend |   .0059197   .0004333    13.66   0.000     .0050652    .0067742
       _cons |   1.141009   .1463262     7.80   0.000     .8524773     1.42954
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      51.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9369
                                                  Adj R-squared   =     0.9302
                                                  Within R-sq.    =     0.0087
Number of clusters (dma_code) =        202        Root MSE        =     0.1125

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0344052   .0035866    -9.59   0.000    -.0414775    -.027333
log_hhinc_~j |    .054683   .0155031     3.53   0.001     .0241134    .0852527
       _cons |   1.089719    .158143     6.89   0.000     .7778868    1.401551
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     63,695
                                                F(4, 201)         =      21.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0102
                                                Root MSE          =     .42603

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0305549   .0112906     2.71   0.007     .0082917    .0528182
post_merg~or |  -.0932805    .016192    -5.76   0.000    -.1252085   -.0613524
       trend |   .0054065   .0007596     7.12   0.000     .0039087    .0069044
log_hhinc_~j |   .1127607   .0324075     3.48   0.001     .0488585    .1766629
       _cons |   .4509862   .3312952     1.36   0.175    -.2022738    1.104246
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   4,    201) =      62.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9335
                                                  Adj R-squared   =     0.9269
                                                  Within R-sq.    =     0.0233
Number of clusters (dma_code) =        202        Root MSE        =     0.1151

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0616369   .0057804   -10.66   0.000    -.0730349   -.0502389
post_merg~or |   .0443182   .0057124     7.76   0.000     .0330543     .055582
       trend |   .0052489    .000436    12.04   0.000     .0043891    .0061087
log_hhinc_~j |   .0492931   .0142216     3.47   0.001     .0212504    .0773358
       _cons |    1.10585    .144675     7.64   0.000     .8205746    1.391126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      32.90
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9380
                                                  Adj R-squared   =     0.9319
                                                  Within R-sq.    =     0.0100
Number of clusters (dma_code) =        202        Root MSE        =     0.1111

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |   .0446951   .0057505     7.77   0.000      .033356    .0560342
log_hhinc_~j |   .0151102   .0102364     1.48   0.141    -.0050743    .0352948
       _cons |   1.459243   .1042333    14.00   0.000     1.253712    1.664774
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   4,    201) =      71.10
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9339
                                                  Adj R-squared   =     0.9274
                                                  Within R-sq.    =     0.0247
Number of clusters (dma_code) =        202        Root MSE        =     0.1147

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0700372   .0060478   -11.58   0.000    -.0819624    -.058112
post_merg~or |    .044507   .0057099     7.79   0.000     .0332481     .055766
log_hhinc_~j |   .0461122   .0143177     3.22   0.001     .0178801    .0743444
       trend |   .0059125   .0004322    13.68   0.000     .0050603    .0067647
       _cons |   1.137963   .1456529     7.81   0.000     .8507592    1.425166
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =      47.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9375
                                                  Adj R-squared   =     0.9308
                                                  Within R-sq.    =     0.0177
Number of clusters (dma_code) =        202        Root MSE        =     0.1120

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0630705   .0056984   -11.07   0.000    -.0743069   -.0518342
post_merg~or |   .0464146   .0053883     8.61   0.000     .0357898    .0570395
log_hhinc_~j |   .0542514   .0154471     3.51   0.001     .0237923    .0847104
       _cons |   1.094318   .1575644     6.95   0.000      .783627    1.405009
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   1.7569e+11)

Linear regression                               Number of obs     =     63,695
                                                F(4, 201)         =      15.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0040
                                                Root MSE          =     .42738

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .8077498    .793849     1.02   0.310    -.7575907     2.37309
 post_merger |  -.0273682   .0049235    -5.56   0.000    -.0370765   -.0176598
       trend |   .0055186   .0007427     7.43   0.000     .0040542     .006983
log_hhinc_~j |   .1107804   .0323939     3.42   0.001     .0469048    .1746559
       _cons |   .4708659   .3311346     1.42   0.157    -.1820774    1.123809
------------------------------------------------------------------------------
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 1 HDFE group                            F(   4,    201) =      53.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9330
                                                  Adj R-squared   =     0.9264
                                                  Within R-sq.    =     0.0155
Number of clusters (dma_code) =        202        Root MSE        =     0.1155

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   4.200538   .9076406     4.63   0.000     2.410819    5.990257
 post_merger |  -.0352025    .003632    -9.69   0.000    -.0423642   -.0280408
       trend |   .0052565   .0004361    12.05   0.000     .0043966    .0061165
log_hhinc_~j |   .0482158   .0142578     3.38   0.001     .0201017    .0763299
       _cons |   1.116634   .1450312     7.70   0.000     .8306563    1.402612
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   2,    201) =      10.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9375
                                                  Adj R-squared   =     0.9313
                                                  Within R-sq.    =     0.0014
Number of clusters (dma_code) =        202        Root MSE        =     0.1116

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |    4.30139    .985271     4.37   0.000     2.358596    6.244183
log_hhinc_~j |   .0140061    .010175     1.38   0.170    -.0060574    .0340696
       _cons |   1.485117   .1037973    14.31   0.000     1.280446    1.689788
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5693        5693           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   4,    201) =      63.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9334
                                                  Adj R-squared   =     0.9268
                                                  Within R-sq.    =     0.0167
Number of clusters (dma_code) =        202        Root MSE        =     0.1152

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   4.212589   .9166966     4.60   0.000     2.405013    6.020164
 post_merger |  -.0434412   .0038889   -11.17   0.000    -.0511094   -.0357729
       trend |   .0059164   .0004332    13.66   0.000     .0050623    .0067705
log_hhinc_~j |   .0450496   .0143704     3.13   0.002     .0167135    .0733857
       _cons |   1.148597   .1461773     7.86   0.000     .8603594    1.436835
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5693        5693           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 400 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     63,295
Absorbing 2 HDFE groups                           F(   3,    201) =     117.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9369
                                                  Adj R-squared   =     0.9302
                                                  Within R-sq.    =     0.0088
Number of clusters (dma_code) =        202        Root MSE        =     0.1125

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -2.554792   .3470191    -7.36   0.000    -3.239057   -1.870527
 post_merger |  -.0338739   .0036196    -9.36   0.000    -.0410111   -.0267367
log_hhinc_~j |   .0546424   .0154969     3.53   0.001     .0240849    .0851998
       _cons |   1.090132   .1580811     6.90   0.000     .7784222    1.401842
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5693        5693           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(2, 201)         =       9.97
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0013
                                                Root MSE          =     .58768

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0006247   .0121865     0.05   0.959    -.0234051    .0246545
       trend |   .0044838   .0013111     3.42   0.001     .0018986     .007069
       _cons |   1.537396   .0273326    56.25   0.000     1.483501    1.591292
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   2,    201) =      49.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9486
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0107
Number of clusters (dma_code) =        202        Root MSE        =     0.1390

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0153316   .0066599    -2.30   0.022    -.0284639   -.0021993
       trend |   .0045422    .000455     9.98   0.000     .0036451    .0054393
       _cons |   1.549457    .004484   345.55   0.000     1.540615    1.558299
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   0,    201) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        202        Root MSE        =     0.1370

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   1.574523   1.88e-16  8.4e+15   0.000     1.574523    1.574523
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      57.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9437
                                                  Within R-sq.    =     0.0107
Number of clusters (dma_code) =        202        Root MSE        =     0.1386

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0231964   .0070612    -3.29   0.001    -.0371198   -.0092729
       trend |   .0052217   .0004874    10.71   0.000     .0042607    .0061828
       _cons |   1.548746   .0044769   345.95   0.000     1.539918    1.557573
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       5.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0208
                                                  R-squared       =     0.9494
                                                  Adj R-squared   =     0.9440
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        202        Root MSE        =     0.1383

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0155113   .0066559    -2.33   0.021    -.0286356    -.002387
       _cons |   1.582983     .00363   436.08   0.000     1.575825    1.590141
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(3, 201)         =      49.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0125
                                                Root MSE          =     .58438

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0664941   .0104725     6.35   0.000      .045844    .0871441
post_merg~or |   -.173549   .0200226    -8.67   0.000    -.2130303   -.1340677
       trend |   .0045844   .0013715     3.34   0.001       .00188    .0072887
       _cons |    1.53709    .027278    56.35   0.000     1.483302    1.590877
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      40.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9490
                                                  Adj R-squared   =     0.9439
                                                  Within R-sq.    =     0.0181
Number of clusters (dma_code) =        202        Root MSE        =     0.1384

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0043988   .0099646     0.44   0.659    -.0152498    .0240474
post_merg~or |  -.0502851   .0107804    -4.66   0.000    -.0715423    -.029028
       trend |   .0046556   .0004608    10.10   0.000     .0037469    .0055643
       _cons |   1.548421   .0046225   334.97   0.000     1.539307    1.557536
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =      22.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9505
                                                  Adj R-squared   =     0.9455
                                                  Within R-sq.    =     0.0078
Number of clusters (dma_code) =        202        Root MSE        =     0.1364

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0503709   .0105697    -4.77   0.000    -.0712127   -.0295291
       _cons |   1.585101   .0022196   714.15   0.000     1.580724    1.589478
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      46.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9492
                                                  Adj R-squared   =     0.9442
                                                  Within R-sq.    =     0.0181
Number of clusters (dma_code) =        202        Root MSE        =     0.1381

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0035204   .0102504    -0.34   0.732    -.0237325    .0166917
post_merg~or |  -.0499784   .0107217    -4.66   0.000    -.0711198    -.028837
       trend |   .0053312   .0004924    10.83   0.000     .0043601    .0063022
       _cons |   1.547704   .0046051   336.09   0.000     1.538624    1.556785
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      29.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9498
                                                  Adj R-squared   =     0.9444
                                                  Within R-sq.    =     0.0086
Number of clusters (dma_code) =        202        Root MSE        =     0.1377

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0046807   .0100938     0.46   0.643    -.0152226     .024584
post_merg~or |  -.0515219   .0113313    -4.55   0.000    -.0738653   -.0291784
       _cons |    1.58279   .0037423   422.94   0.000     1.575411    1.590169
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)

Linear regression                               Number of obs     =     64,428
                                                F(3, 201)         =       8.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0015
                                                Root MSE          =     .58762

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   13.34172   7.706949     1.73   0.085    -1.855123    28.53856
 post_merger |  -.0014458   .0120223    -0.12   0.904    -.0251517    .0222602
       trend |   .0044956   .0013103     3.43   0.001     .0019119    .0070793
       _cons |    1.53736   .0273445    56.22   0.000     1.483441    1.591279
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      33.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9486
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0107
Number of clusters (dma_code) =        202        Root MSE        =     0.1389

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.938954   2.573973     1.14   0.255      -2.1365    8.014408
 post_merger |  -.0157785   .0068841    -2.29   0.023    -.0293528   -.0022042
       trend |    .004546   .0004561     9.97   0.000     .0036467    .0054454
       _cons |   1.549435   .0044865   345.35   0.000     1.540588    1.558282
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       1.36
Statistics robust to heteroskedasticity           Prob > F        =     0.2452
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        202        Root MSE        =     0.1370

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   3.095965    2.65623     1.17   0.245    -2.141686    8.333615
       _cons |   1.574273   .0002148  7329.90   0.000      1.57385    1.574697
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      38.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9437
                                                  Within R-sq.    =     0.0108
Number of clusters (dma_code) =        202        Root MSE        =     0.1386

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.925255    2.59202     1.13   0.260    -2.185785    8.036294
 post_merger |  -.0236424    .007281    -3.25   0.001    -.0379994   -.0092854
       trend |   .0052257   .0004886    10.69   0.000     .0042622    .0061893
       _cons |   1.548723   .0044792   345.76   0.000     1.539891    1.557555
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      14.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9494
                                                  Adj R-squared   =     0.9440
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        202        Root MSE        =     0.1383

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -2.016932   1.448431    -1.39   0.165    -4.873001    .8391373
 post_merger |  -.0152067   .0067989    -2.24   0.026    -.0286131   -.0018003
       _cons |    1.58298   .0036182   437.51   0.000     1.575846    1.590115
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)

Linear regression                               Number of obs     =     64,428
                                                F(6, 201)         =       4.39
                                                Prob > F          =     0.0003
                                                R-squared         =     0.0016
                                                Root MSE          =      .5876

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0313556   .0272875     1.15   0.252    -.0224509    .0851621
    post_hhi |   .0398837   .0899763     0.44   0.658    -.1375349    .2173024
        dhhi |   6.188078   6.037393     1.02   0.307    -5.716675    18.09283
     np_dhhi |   6.392302   3.960479     1.61   0.108    -1.417116    14.20172
      np_HHI |  -.0630661   .0493702    -1.28   0.203    -.1604161    .0342839
       trend |   .0045071   .0013373     3.37   0.001     .0018702    .0071439
       _cons |   1.516308   .0535189    28.33   0.000     1.410777    1.621838
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   6.6408e+10)

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =       5.15
                                                Prob > F          =     0.0006
                                                R-squared         =     0.0014
                                                Root MSE          =     .58766

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0349439   .0265514     1.32   0.190    -.0174112     .087299
    post_hhi |   .0348892   .0882081     0.40   0.693    -.1390427    .2088212
      np_HHI |  -.0682089   .0483588    -1.41   0.160    -.1635645    .0271466
       trend |   .0045046   .0013373     3.37   0.001     .0018677    .0071415
       _cons |   1.519754   .0510648    29.76   0.000     1.419063    1.620446
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   6.6408e+10)

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =       6.12
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0015
                                                Root MSE          =     .58762

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0006775   .0123689    -0.05   0.956     -.025067    .0237119
        dhhi |   5.102545   5.226249     0.98   0.330    -5.202764    15.40785
     np_dhhi |   8.239164   4.337637     1.90   0.059    -.3139478    16.79228
       trend |   .0044947   .0013109     3.43   0.001     .0019099    .0070795
       _cons |   1.536602   .0279807    54.92   0.000     1.481429    1.591776
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   4,    201) =      25.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9486
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0113
Number of clusters (dma_code) =        202        Root MSE        =     0.1389

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0051729   .0158997     0.33   0.745    -.0261788    .0365246
     np_dhhi |   1.610062   2.196695     0.73   0.464    -2.721461    5.941585
      np_HHI |  -.0410559   .0264965    -1.55   0.123    -.0933026    .0111908
       trend |   .0045617   .0004584     9.95   0.000     .0036578    .0054655
       _cons |    1.54936   .0044596   347.42   0.000     1.540566    1.558154
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      34.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9486
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0113
Number of clusters (dma_code) =        202        Root MSE        =     0.1389

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0060582   .0152639     0.40   0.692    -.0240397    .0361562
      np_HHI |  -.0423232   .0259769    -1.63   0.105    -.0935454     .008899
       trend |   .0045601    .000458     9.96   0.000     .0036571    .0054632
       _cons |   1.549369     .00446   347.39   0.000     1.540575    1.558164
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      33.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9486
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0107
Number of clusters (dma_code) =        202        Root MSE        =     0.1389

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0157785   .0068841    -2.29   0.023    -.0293528   -.0022042
     np_dhhi |   2.938954   2.573973     1.14   0.255      -2.1365    8.014408
       trend |    .004546   .0004561     9.97   0.000     .0036467    .0054454
       _cons |   1.549435   .0044865   345.35   0.000     1.540588    1.558282
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =       2.23
Statistics robust to heteroskedasticity           Prob > F        =     0.1100
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0007
Number of clusters (dma_code) =        202        Root MSE        =     0.1369

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   1.764601   2.252132     0.78   0.434    -2.676235    6.205437
      np_HHI |  -.0411316   .0264785    -1.55   0.122    -.0933428    .0110796
       _cons |   1.585761   .0073927   214.50   0.000     1.571183    1.600338
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       2.68
Statistics robust to heteroskedasticity           Prob > F        =     0.1033
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0007
Number of clusters (dma_code) =        202        Root MSE        =     0.1369

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0425206   .0259849    -1.64   0.103    -.0937586    .0087173
       _cons |   1.586288   .0071893   220.65   0.000     1.572112    1.600464
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       1.36
Statistics robust to heteroskedasticity           Prob > F        =     0.2452
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        202        Root MSE        =     0.1370

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   3.095965    2.65623     1.17   0.245    -2.141686    8.333615
       _cons |   1.574273   .0002148  7329.90   0.000      1.57385    1.574697
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   4,    201) =      29.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9438
                                                  Within R-sq.    =     0.0114
Number of clusters (dma_code) =        202        Root MSE        =     0.1386

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0026907   .0161747    -0.17   0.868    -.0345846    .0292032
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   1.596328   2.212309     0.72   0.471    -2.765985     5.95864
      np_HHI |   -.041058    .026567    -1.55   0.124    -.0934438    .0113278
       trend |   .0052422   .0004908    10.68   0.000     .0042744      .00621
       _cons |   1.548642   .0044524   347.82   0.000     1.539863    1.557422
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =       7.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.9495
                                                  Adj R-squared   =     0.9440
                                                  Within R-sq.    =     0.0010
Number of clusters (dma_code) =        202        Root MSE        =     0.1383

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0044945   .0132269     0.34   0.734    -.0215868    .0305758
     np_dhhi |  -3.188322   1.811286    -1.76   0.080    -6.759883    .3832385
      np_HHI |  -.0386278    .022213    -1.74   0.084    -.0824283    .0051727
       _cons |   1.583017   .0035725   443.11   0.000     1.575973    1.590062
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      39.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9438
                                                  Within R-sq.    =     0.0113
Number of clusters (dma_code) =        202        Root MSE        =     0.1386

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |  -.0018124   .0155382    -0.12   0.907    -.0324511    .0288263
      np_HHI |  -.0423145   .0260495    -1.62   0.106    -.0936799    .0090509
       trend |   .0052405   .0004903    10.69   0.000     .0042737    .0062074
       _cons |   1.548652    .004453   347.78   0.000     1.539871    1.557432
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =       4.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0188
                                                  R-squared       =     0.9495
                                                  Adj R-squared   =     0.9440
                                                  Within R-sq.    =     0.0010
Number of clusters (dma_code) =        202        Root MSE        =     0.1383

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0026967   .0127071     0.21   0.832    -.0223596     .027753
      np_HHI |  -.0360237   .0217757    -1.65   0.100    -.0789617    .0069144
       _cons |   1.583019   .0035962   440.19   0.000     1.575928    1.590111
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 5 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      38.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9437
                                                  Within R-sq.    =     0.0108
Number of clusters (dma_code) =        202        Root MSE        =     0.1386

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0236424    .007281    -3.25   0.001    -.0379994   -.0092854
        dhhi |          0  (omitted)
     np_dhhi |   2.925255    2.59202     1.13   0.260    -2.185785    8.036294
       trend |   .0052257   .0004886    10.69   0.000     .0042622    .0061893
       _cons |   1.548723   .0044792   345.76   0.000     1.539891    1.557555
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      14.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9494
                                                  Adj R-squared   =     0.9440
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        202        Root MSE        =     0.1383

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0152067   .0067989    -2.24   0.026    -.0286131   -.0018003
     np_dhhi |  -2.016932   1.448431    -1.39   0.165    -4.873001    .8391373
       _cons |    1.58298   .0036182   437.51   0.000     1.575846    1.590115
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(3, 201)         =       6.75
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0020
                                                Root MSE          =     .58747

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0012104   .0113752    -0.11   0.915    -.0236404    .0212196
log_hhinc_~j |   .0765776   .0782764     0.98   0.329    -.0777706    .2309258
       trend |   .0048242   .0013781     3.50   0.001     .0021068    .0075416
       _cons |   .7464561   .8215505     0.91   0.365    -.8735071    2.366419
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      46.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9487
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0120
Number of clusters (dma_code) =        202        Root MSE        =     0.1389

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0161863    .005812    -2.78   0.006    -.0276467   -.0047259
log_hhinc_~j |   .0411683   .0114734     3.59   0.000     .0185447    .0637919
       trend |    .004707    .000473     9.95   0.000     .0037743    .0056398
       _cons |   1.124301   .1180265     9.53   0.000     .8915719     1.35703
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   1,    201) =       4.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0409
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        202        Root MSE        =     0.1369

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |   .0210434   .0102277     2.06   0.041     .0008761    .0412108
       _cons |   1.357584   .1054387    12.88   0.000     1.149676    1.565492
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      49.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9438
                                                  Within R-sq.    =     0.0119
Number of clusters (dma_code) =        202        Root MSE        =     0.1385

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0237599   .0062516    -3.80   0.000    -.0360871   -.0114328
log_hhinc_~j |   .0385578   .0115309     3.34   0.001     .0158208    .0612949
       trend |   .0053461   .0005092    10.50   0.000     .0043421    .0063502
       _cons |    1.15064   .1187307     9.69   0.000      .916522    1.384757
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      14.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9495
                                                  Adj R-squared   =     0.9441
                                                  Within R-sq.    =     0.0020
Number of clusters (dma_code) =        202        Root MSE        =     0.1382

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0163359   .0058175    -2.81   0.005    -.0278069   -.0048648
log_hhinc_~j |   .0406419   .0101847     3.99   0.000     .0205593    .0607245
       _cons |    1.16445   .1055477    11.03   0.000      .956327    1.372572
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =      40.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0131
                                                Root MSE          =      .5842

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0644871   .0099819     6.46   0.000     .0448045    .0841698
post_merg~or |  -.1727235   .0202342    -8.54   0.000    -.2126221   -.1328249
       trend |   .0048981   .0014463     3.39   0.001     .0020462    .0077499
log_hhinc_~j |   .0706744   .0781792     0.90   0.367    -.0834822    .2248309
       _cons |   .8071235   .8207239     0.98   0.327    -.8112098    2.425457
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   4,    201) =      34.10
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9491
                                                  Adj R-squared   =     0.9440
                                                  Within R-sq.    =     0.0194
Number of clusters (dma_code) =        202        Root MSE        =     0.1383

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0035206   .0089852     0.39   0.696    -.0141967    .0212379
post_merg~or |  -.0502065    .010847    -4.63   0.000    -.0715951   -.0288179
       trend |   .0048188   .0004847     9.94   0.000     .0038632    .0057745
log_hhinc_~j |   .0408119   .0115741     3.53   0.001     .0179898    .0636341
       _cons |   1.126947   .1192291     9.45   0.000     .8918468    1.362047
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =      11.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9505
                                                  Adj R-squared   =     0.9455
                                                  Within R-sq.    =     0.0081
Number of clusters (dma_code) =        202        Root MSE        =     0.1364

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0503261   .0106022    -4.75   0.000    -.0712319   -.0294203
log_hhinc_~j |   .0206257   .0105031     1.96   0.051    -.0000847    .0413361
       _cons |   1.372459   .1073847    12.78   0.000     1.160714    1.584204
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   4,    201) =      36.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9493
                                                  Adj R-squared   =     0.9442
                                                  Within R-sq.    =     0.0193
Number of clusters (dma_code) =        202        Root MSE        =     0.1380

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0041069   .0092899    -0.44   0.659    -.0224251    .0142114
post_merg~or |  -.0499077   .0107829    -4.63   0.000    -.0711699   -.0286455
log_hhinc_~j |   .0382166   .0116457     3.28   0.001     .0152533      .06118
       trend |   .0054543    .000519    10.51   0.000     .0044309    .0064778
       _cons |   1.153123    .120085     9.60   0.000     .9163348    1.389911
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      19.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9499
                                                  Adj R-squared   =     0.9445
                                                  Within R-sq.    =     0.0098
Number of clusters (dma_code) =        202        Root MSE        =     0.1377

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0038742   .0091042     0.43   0.671    -.0140777    .0218262
post_merg~or |  -.0515863   .0113859    -4.53   0.000    -.0740374   -.0291352
log_hhinc_~j |   .0409958    .010427     3.93   0.000     .0204355    .0615562
       _cons |   1.160612   .1081882    10.73   0.000     .9472822    1.373941
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   6.6408e+10)

Linear regression                               Number of obs     =     64,428
                                                F(4, 201)         =       6.25
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0022
                                                Root MSE          =     .58741

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |    13.0604   7.017068     1.86   0.064    -.7761141    26.89691
 post_merger |  -.0032264   .0112805    -0.29   0.775    -.0254697    .0190168
       trend |   .0048338    .001376     3.51   0.001     .0021204    .0075471
log_hhinc_~j |   .0761281    .078095     0.97   0.331    -.0778625    .2301187
       _cons |   .7510641   .8196349     0.92   0.361    -.8651218     2.36725
------------------------------------------------------------------------------
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   4,    201) =      35.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9487
                                                  Adj R-squared   =     0.9435
                                                  Within R-sq.    =     0.0121
Number of clusters (dma_code) =        202        Root MSE        =     0.1389

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.368122   2.183287     1.08   0.279    -1.936963    6.673208
 post_merger |  -.0165388   .0060172    -2.75   0.007    -.0284037    -.004674
       trend |   .0047087   .0004728     9.96   0.000     .0037763     .005641
log_hhinc_~j |   .0408038   .0115277     3.54   0.000     .0180729    .0635346
       _cons |   1.128048   .1186348     9.51   0.000     .8941191    1.361976
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   2,    201) =       2.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0600
                                                  R-squared       =     0.9501
                                                  Adj R-squared   =     0.9451
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        202        Root MSE        =     0.1369

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.804464   2.445159     1.15   0.253     -2.01699    7.625918
log_hhinc_~j |   .0205905   .0101869     2.02   0.045     .0005035    .0406774
       _cons |   1.362027   .1050066    12.97   0.000     1.154971    1.569083
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   4,    201) =      37.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9489
                                                  Adj R-squared   =     0.9438
                                                  Within R-sq.    =     0.0119
Number of clusters (dma_code) =        202        Root MSE        =     0.1385

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.390459   2.230475     1.07   0.285    -2.007672     6.78859
 post_merger |   -.024119   .0064545    -3.74   0.000    -.0368461   -.0113919
       trend |   .0053482   .0005091    10.51   0.000     .0043444     .006352
log_hhinc_~j |   .0381886   .0115972     3.29   0.001     .0153208    .0610563
       _cons |   1.154434   .1194602     9.66   0.000     .9188778     1.38999
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 404 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 2 HDFE groups                           F(   3,    201) =      17.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9495
                                                  Adj R-squared   =     0.9441
                                                  Within R-sq.    =     0.0020
Number of clusters (dma_code) =        202        Root MSE        =     0.1382

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -1.904676   1.300238    -1.46   0.145    -4.468532    .6591801
 post_merger |  -.0160477    .005942    -2.70   0.008    -.0277644    -.004331
log_hhinc_~j |   .0406189    .010176     3.99   0.000     .0205535    .0606844
       _cons |   1.164684   .1054378    11.05   0.000     .9567778     1.37259
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5818        5818           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     60,755
                                                F(2, 201)         =      27.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0027
                                                Root MSE          =     .53459

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.007074   .0078622    -0.90   0.369    -.0225769     .008429
       trend |   .0067759   .0010279     6.59   0.000      .004749    .0088028
       _cons |    1.43048   .0377032    37.94   0.000     1.356135    1.504825
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   2,    201) =      18.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9580
                                                  Adj R-squared   =     0.9542
                                                  Within R-sq.    =     0.0490
Number of clusters (dma_code) =        202        Root MSE        =     0.1146

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0104959   .0070256    -1.49   0.137    -.0243493    .0033574
       trend |   .0064731   .0010805     5.99   0.000     .0043425    .0086037
       _cons |   1.434697   .0071513   200.62   0.000     1.420596    1.448799
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   0,    201) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.9618
                                                  Adj R-squared   =     0.9583
                                                  Within R-sq.    =     0.0000
Number of clusters (dma_code) =        202        Root MSE        =     0.1093

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
       _cons |   1.476592   2.96e-17  5.0e+16   0.000     1.476592    1.476592
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =      23.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9584
                                                  Adj R-squared   =     0.9546
                                                  Within R-sq.    =     0.0417
Number of clusters (dma_code) =        202        Root MSE        =     0.1141

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0153374   .0069948    -2.19   0.029    -.0291301   -.0015448
       trend |    .006587   .0009574     6.88   0.000     .0046992    .0084749
       _cons |   1.436508   .0067769   211.97   0.000     1.423145    1.449871
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   1,    201) =       2.39
Statistics robust to heteroskedasticity           Prob > F        =     0.1240
                                                  R-squared       =     0.9629
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0007
Number of clusters (dma_code) =        202        Root MSE        =     0.1081

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0109103   .0070631    -1.54   0.124    -.0248375     .003017
       _cons |   1.482561   .0038646   383.63   0.000     1.474941    1.490182
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     60,755
                                                F(3, 201)         =      15.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0317
                                                Root MSE          =     .52676

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.1515228   .0396978    -3.82   0.000    -.2298003   -.0732452
post_merg~or |   .2507085   .0674434     3.72   0.000     .1177212    .3836959
       trend |   .0062809   .0009697     6.48   0.000     .0043689    .0081929
       _cons |   1.431984   .0374298    38.26   0.000     1.358178    1.505789
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   3,    201) =      20.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9588
                                                  Adj R-squared   =     0.9550
                                                  Within R-sq.    =     0.0661
Number of clusters (dma_code) =        202        Root MSE        =     0.1135

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0247129   .0098208     2.52   0.013      .005348    .0440779
post_merg~or |  -.0611621   .0120718    -5.07   0.000    -.0849658   -.0373584
       trend |   .0065696   .0010845     6.06   0.000     .0044311    .0087081
       _cons |   1.434525   .0067348   213.00   0.000     1.421246    1.447805
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   1,    201) =      25.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9626
                                                  Adj R-squared   =     0.9591
                                                  Within R-sq.    =     0.0196
Number of clusters (dma_code) =        202        Root MSE        =     0.1082

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0607654   .0120743    -5.03   0.000     -.084574   -.0369568
       _cons |   1.496266   .0039095   382.73   0.000     1.488558    1.503975
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =      23.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9591
                                                  Adj R-squared   =     0.9554
                                                  Within R-sq.    =     0.0591
Number of clusters (dma_code) =        202        Root MSE        =     0.1130

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |    .019807   .0101009     1.96   0.051    -.0001104    .0397244
post_merg~or |  -.0609562   .0120902    -5.04   0.000     -.084796   -.0371164
       trend |   .0066801   .0009603     6.96   0.000     .0047865    .0085737
       _cons |    1.43633   .0064105   224.06   0.000      1.42369    1.448971
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       6.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0013
                                                  R-squared       =     0.9630
                                                  Adj R-squared   =     0.9593
                                                  Within R-sq.    =     0.0038
Number of clusters (dma_code) =        202        Root MSE        =     0.1080

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0047825   .0117746     0.41   0.685    -.0184351    .0280001
post_merg~or |  -.0271748   .0115584    -2.35   0.020    -.0499661   -.0043835
       _cons |   1.482774    .003885   381.67   0.000     1.475113    1.490434
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)

Linear regression                               Number of obs     =     60,755
                                                F(3, 201)         =      18.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0028
                                                Root MSE          =     .53456

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   -7.39945   11.48423    -0.64   0.520    -30.04448    15.24558
 post_merger |  -.0059961   .0079119    -0.76   0.449    -.0215969    .0096048
       trend |   .0067727   .0010278     6.59   0.000     .0047461    .0087993
       _cons |    1.43049   .0377046    37.94   0.000     1.356142    1.504837
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   3,    201) =      13.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9580
                                                  Adj R-squared   =     0.9542
                                                  Within R-sq.    =     0.0491
Number of clusters (dma_code) =        202        Root MSE        =     0.1146

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.855211   3.152063     0.91   0.366    -3.360142    9.070563
 post_merger |  -.0109105   .0071188    -1.53   0.127    -.0249477    .0031267
       trend |   .0064739   .0010805     5.99   0.000     .0043434    .0086044
       _cons |   1.434696   .0071475   200.73   0.000     1.420603     1.44879
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   1,    201) =       0.82
Statistics robust to heteroskedasticity           Prob > F        =     0.3659
                                                  R-squared       =     0.9618
                                                  Adj R-squared   =     0.9583
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        202        Root MSE        =     0.1093

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.799374   3.089116     0.91   0.366    -3.291857    8.890604
       _cons |   1.476374   .0002404  6141.31   0.000       1.4759    1.476848
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =      17.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9584
                                                  Adj R-squared   =     0.9546
                                                  Within R-sq.    =     0.0419
Number of clusters (dma_code) =        202        Root MSE        =     0.1141

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.834162   3.143438     0.90   0.368    -3.364185    9.032508
 post_merger |  -.0157478   .0070822    -2.22   0.027    -.0297126   -.0017829
       trend |   .0065877   .0009573     6.88   0.000        .0047    .0084754
       _cons |   1.436507   .0067753   212.02   0.000     1.423147    1.449867
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       2.05
Statistics robust to heteroskedasticity           Prob > F        =     0.1310
                                                  R-squared       =     0.9629
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        202        Root MSE        =     0.1081

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -2.081036   2.040099    -1.02   0.309    -6.103778    1.941707
 post_merger |  -.0106042    .007122    -1.49   0.138    -.0246476    .0034391
       _cons |   1.482556   .0038656   383.53   0.000     1.474933    1.490178
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)

Linear regression                               Number of obs     =     60,755
                                                F(6, 201)         =      19.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0034
                                                Root MSE          =     .53442

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0573411   .0196303     2.92   0.004     .0186335    .0960488
    post_hhi |   .0407635   .2363719     0.17   0.863    -.4253232    .5068502
        dhhi |  -5.469973   9.862562    -0.55   0.580    -24.91733    13.97739
     np_dhhi |  -4.122195   2.795935    -1.47   0.142    -9.635321    1.390932
      np_HHI |  -.1224376   .0362509    -3.38   0.001    -.1939185   -.0509567
       trend |   .0068331   .0010489     6.51   0.000     .0047648    .0089015
       _cons |   1.409971   .1196062    11.79   0.000     1.174127    1.645815
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   2.1226e+09)

Linear regression                               Number of obs     =     60,755
                                                F(4, 201)         =      28.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0032
                                                Root MSE          =     .53447

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0552756    .019493     2.84   0.005     .0168385    .0937127
    post_hhi |   .0456585    .234264     0.19   0.846    -.4162719    .5075889
      np_HHI |  -.1195715   .0359971    -3.32   0.001    -.1905519   -.0485912
       trend |    .006834   .0010491     6.51   0.000     .0047655    .0089026
       _cons |   1.406561   .1178512    11.94   0.000     1.174177    1.638944
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   2.1226e+09)

Linear regression                               Number of obs     =     60,755
                                                F(4, 201)         =      14.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0029
                                                Root MSE          =     .53454

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0069733   .0078615    -0.89   0.376    -.0224748    .0085282
        dhhi |  -6.315178   10.07327    -0.63   0.531    -26.17801    13.54765
     np_dhhi |  -1.084282   2.406903    -0.45   0.653    -5.830302    3.661738
       trend |   .0067703   .0010276     6.59   0.000      .004744    .0087966
       _cons |   1.431493   .0381085    37.56   0.000     1.356349    1.506637
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   4,    201) =      15.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9584
                                                  Adj R-squared   =     0.9546
                                                  Within R-sq.    =     0.0586
Number of clusters (dma_code) =        202        Root MSE        =     0.1140

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0552111   .0227121     2.43   0.016     .0104265    .0999958
     np_dhhi |  -.5503363   2.182824    -0.25   0.801    -4.854508    3.753835
      np_HHI |  -.1255426   .0412449    -3.04   0.003    -.2068708   -.0442143
       trend |    .006535   .0010772     6.07   0.000      .004411    .0086589
       _cons |   1.434639   .0066577   215.48   0.000     1.421511    1.447767
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   3,    201) =      19.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9584
                                                  Adj R-squared   =     0.9546
                                                  Within R-sq.    =     0.0586
Number of clusters (dma_code) =        202        Root MSE        =     0.1140

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0548958   .0223111     2.46   0.015      .010902    .0988896
      np_HHI |  -.1250922   .0407766    -3.07   0.002     -.205497   -.0446873
       trend |   .0065349   .0010771     6.07   0.000     .0044109    .0086588
       _cons |   1.434639   .0066588   215.45   0.000     1.421509    1.447769
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   3,    201) =      13.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9580
                                                  Adj R-squared   =     0.9542
                                                  Within R-sq.    =     0.0491
Number of clusters (dma_code) =        202        Root MSE        =     0.1146

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0109105   .0071188    -1.53   0.127    -.0249477    .0031267
     np_dhhi |   2.855211   3.152063     0.91   0.366    -3.360142    9.070563
       trend |   .0064739   .0010805     5.99   0.000     .0043434    .0086044
       _cons |   1.434696   .0071475   200.73   0.000     1.420603     1.44879
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       4.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0106
                                                  R-squared       =     0.9622
                                                  Adj R-squared   =     0.9588
                                                  Within R-sq.    =     0.0108
Number of clusters (dma_code) =        202        Root MSE        =     0.1087

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |  -.5449495   2.152421    -0.25   0.800    -4.789172    3.699273
      np_HHI |   -.123303   .0413804    -2.98   0.003    -.2048982   -.0417077
       _cons |   1.512292   .0120169   125.85   0.000     1.488597    1.535988
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   1,    201) =       9.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0030
                                                  R-squared       =     0.9622
                                                  Adj R-squared   =     0.9588
                                                  Within R-sq.    =     0.0108
Number of clusters (dma_code) =        202        Root MSE        =     0.1087

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   -.122857   .0409042    -3.00   0.003    -.2035133   -.0422007
       _cons |   1.512121   .0118292   127.83   0.000     1.488796    1.535446
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   1,    201) =       0.82
Statistics robust to heteroskedasticity           Prob > F        =     0.3659
                                                  R-squared       =     0.9618
                                                  Adj R-squared   =     0.9583
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        202        Root MSE        =     0.1093

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   2.799374   3.089116     0.91   0.366    -3.291857    8.890604
       _cons |   1.476374   .0002404  6141.31   0.000       1.4759    1.476848
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   4,    201) =      17.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9588
                                                  Adj R-squared   =     0.9550
                                                  Within R-sq.    =     0.0515
Number of clusters (dma_code) =        202        Root MSE        =     0.1135

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .050164   .0229351     2.19   0.030     .0049396    .0953884
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |  -.5601843   2.179436    -0.26   0.797    -4.857675    3.737306
      np_HHI |  -.1251318   .0412757    -3.03   0.003    -.2065207   -.0437428
       trend |   .0066499    .000952     6.99   0.000     .0047728     .008527
       _cons |   1.436436   .0062445   230.03   0.000     1.424123     1.44875
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =      10.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9629
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0021
Number of clusters (dma_code) =        202        Root MSE        =     0.1081

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0326364   .0168811     1.93   0.055    -.0006504    .0659233
     np_dhhi |  -4.084311   1.290788    -3.16   0.002    -6.629533   -1.539089
      np_HHI |  -.0819137   .0255984    -3.20   0.002    -.1323896   -.0314377
       _cons |   1.482741   .0036392   407.43   0.000     1.475565    1.489917
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =      22.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9588
                                                  Adj R-squared   =     0.9550
                                                  Within R-sq.    =     0.0515
Number of clusters (dma_code) =        202        Root MSE        =     0.1135

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0498432   .0225246     2.21   0.028     .0054284    .0942581
      np_HHI |  -.1246733   .0408057    -3.06   0.003    -.2051354   -.0442113
       trend |   .0066498   .0009519     6.99   0.000     .0047727    .0085269
       _cons |   1.436436   .0062461   229.97   0.000      1.42412    1.448753
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       8.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0003
                                                  R-squared       =     0.9629
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0020
Number of clusters (dma_code) =        202        Root MSE        =     0.1081

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0302734   .0165599     1.83   0.069      -.00238    .0629269
      np_HHI |  -.0785522   .0253036    -3.10   0.002    -.1284468   -.0286576
       _cons |   1.482744   .0036481   406.44   0.000     1.475551    1.489938
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =      17.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9584
                                                  Adj R-squared   =     0.9546
                                                  Within R-sq.    =     0.0419
Number of clusters (dma_code) =        202        Root MSE        =     0.1141

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0157478   .0070822    -2.22   0.027    -.0297126   -.0017829
        dhhi |          0  (omitted)
     np_dhhi |   2.834162   3.143438     0.90   0.368    -3.364185    9.032508
       trend |   .0065877   .0009573     6.88   0.000        .0047    .0084754
       _cons |   1.436507   .0067753   212.02   0.000     1.423147    1.449867
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       2.05
Statistics robust to heteroskedasticity           Prob > F        =     0.1310
                                                  R-squared       =     0.9629
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        202        Root MSE        =     0.1081

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0106042    .007122    -1.49   0.138    -.0246476    .0034391
     np_dhhi |  -2.081036   2.040099    -1.02   0.309    -6.103778    1.941707
       _cons |   1.482556   .0038656   383.53   0.000     1.474933    1.490178
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     60,755
                                                F(3, 201)         =      17.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0138
                                                Root MSE          =     .53161

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0114328   .0103494    -1.10   0.271    -.0318401    .0089745
log_hhinc_~j |   .2736838   .1195543     2.29   0.023     .0379423    .5094253
       trend |   .0077134   .0016148     4.78   0.000     .0045292    .0108976
       _cons |  -1.389962   1.246837    -1.11   0.266     -3.84852    1.068597
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   3,    201) =      20.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9583
                                                  Adj R-squared   =     0.9545
                                                  Within R-sq.    =     0.0551
Number of clusters (dma_code) =        202        Root MSE        =     0.1142

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0117728   .0067746    -1.74   0.084    -.0251313    .0015856
log_hhinc_~j |    .072877   .0231422     3.15   0.002     .0272444    .1185096
       trend |   .0067293   .0011183     6.02   0.000     .0045241    .0089345
       _cons |   .6836801   .2363817     2.89   0.004     .2175741    1.149786
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   1,    201) =       4.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0407
                                                  R-squared       =     0.9619
                                                  Adj R-squared   =     0.9584
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        202        Root MSE        =     0.1092

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
log_hhinc_~j |    .035921   .0174363     2.06   0.041     .0015395    .0703024
       _cons |   1.107001   .1794015     6.17   0.000     .7532508    1.460752
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =      22.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9586
                                                  Adj R-squared   =     0.9548
                                                  Within R-sq.    =     0.0479
Number of clusters (dma_code) =        202        Root MSE        =     0.1137

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0161268    .006793    -2.37   0.019    -.0295214   -.0027321
log_hhinc_~j |   .0723458   .0230767     3.14   0.002     .0268424    .1178492
       trend |   .0067792   .0010272     6.60   0.000     .0047538    .0088047
       _cons |   .6911607   .2358201     2.93   0.004      .226162    1.156159
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       5.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0073
                                                  R-squared       =     0.9630
                                                  Adj R-squared   =     0.9593
                                                  Within R-sq.    =     0.0046
Number of clusters (dma_code) =        202        Root MSE        =     0.1079

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0119361   .0067424    -1.77   0.078     -.025231    .0013588
log_hhinc_~j |   .0591124   .0233732     2.53   0.012     .0130244    .1052004
       _cons |   .8749159   .2407253     3.63   0.000      .400245    1.349587
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)
note: post_merger_merging omitted because of collinearity

Linear regression                               Number of obs     =     60,755
                                                F(4, 201)         =       8.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0416
                                                Root MSE          =     .52407

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   -.152752   .0403683    -3.78   0.000    -.2323517   -.0731523
post_merg~or |   .2456873   .0660234     3.72   0.000     .1154999    .3758746
       trend |   .0071774   .0015349     4.68   0.000     .0041508     .010204
log_hhinc_~j |   .2588313   .1139576     2.27   0.024     .0341255    .4835371
       _cons |  -1.235426   1.187126    -1.04   0.299    -3.576244    1.105391
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   4,    201) =      22.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9591
                                                  Adj R-squared   =     0.9553
                                                  Within R-sq.    =     0.0723
Number of clusters (dma_code) =        202        Root MSE        =     0.1131

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0234445   .0095349     2.46   0.015     .0046432    .0422458
post_merg~or |  -.0611784   .0119025    -5.14   0.000    -.0846482   -.0377086
       trend |    .006826   .0011198     6.10   0.000     .0046181     .009034
log_hhinc_~j |   .0729315   .0216084     3.38   0.001     .0303234    .1155397
       _cons |   .6829466   .2205307     3.10   0.002     .2480961    1.117797
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =      14.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9626
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0213
Number of clusters (dma_code) =        202        Root MSE        =     0.1081

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
post_merg~or |  -.0607785   .0119799    -5.07   0.000    -.0844009   -.0371561
log_hhinc_~j |   .0360124   .0161176     2.23   0.027      .004231    .0677937
       _cons |    1.12574   .1654066     6.81   0.000     .7995854    1.451895
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 4 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   4,    201) =      23.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9594
                                                  Adj R-squared   =     0.9557
                                                  Within R-sq.    =     0.0652
Number of clusters (dma_code) =        202        Root MSE        =     0.1127

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0190284   .0098371     1.93   0.054    -.0003687    .0384255
post_merg~or |  -.0609762   .0119222    -5.11   0.000    -.0844848   -.0374675
log_hhinc_~j |   .0724127   .0215146     3.37   0.001     .0299894    .1148361
       trend |   .0068725   .0010286     6.68   0.000     .0048443    .0089006
       _cons |   .6902935   .2197167     3.14   0.002     .2570481    1.123539
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =       6.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.9631
                                                  Adj R-squared   =     0.9595
                                                  Within R-sq.    =     0.0077
Number of clusters (dma_code) =        202        Root MSE        =     0.1078

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |   .0038421   .0111919     0.34   0.732    -.0182265    .0259108
post_merg~or |   -.027331   .0116945    -2.34   0.020    -.0503907   -.0042713
log_hhinc_~j |   .0593836   .0228108     2.60   0.010     .0144044    .1043628
       _cons |   .8723415    .235076     3.71   0.000       .40881    1.335873
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.1226e+09)

Linear regression                               Number of obs     =     60,755
                                                F(4, 201)         =      13.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0139
                                                Root MSE          =     .53158

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -7.681194   13.48377    -0.57   0.570    -34.26899     18.9066
 post_merger |  -.0103155   .0107124    -0.96   0.337    -.0314385    .0108076
       trend |   .0077104   .0016161     4.77   0.000     .0045236    .0108971
log_hhinc_~j |   .2737857   .1195187     2.29   0.023     .0381143     .509457
       _cons |  -1.391002   1.246494    -1.12   0.266    -3.848883     1.06688
------------------------------------------------------------------------------
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 1 HDFE group                            F(   4,    201) =      17.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9583
                                                  Adj R-squared   =     0.9545
                                                  Within R-sq.    =     0.0552
Number of clusters (dma_code) =        202        Root MSE        =     0.1142

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.095668    2.59301     0.81   0.420    -3.017324    7.208661
 post_merger |  -.0120709   .0068369    -1.77   0.079     -.025552    .0014103
       trend |   .0067286   .0011181     6.02   0.000      .004524    .0089332
log_hhinc_~j |   .0725234   .0231882     3.13   0.002     .0268001    .1182468
       _cons |   .6873231   .2368979     2.90   0.004     .2201992    1.154447
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   2,    201) =       2.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0829
                                                  R-squared       =     0.9619
                                                  Adj R-squared   =     0.9584
                                                  Within R-sq.    =     0.0018
Number of clusters (dma_code) =        202        Root MSE        =     0.1092

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.429545   2.813475     0.86   0.389    -3.118167    7.977257
log_hhinc_~j |   .0354979   .0174521     2.03   0.043     .0010851    .0699106
       _cons |   1.111166   .1795552     6.19   0.000     .7571121    1.465219
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5086        5086           0    *|
   time_effects |        16           0          16     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   4,    201) =      18.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9587
                                                  Adj R-squared   =     0.9549
                                                  Within R-sq.    =     0.0480
Number of clusters (dma_code) =        202        Root MSE        =     0.1137

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   2.080968   2.588825     0.80   0.422    -3.023772    7.185707
 post_merger |  -.0164242   .0068491    -2.40   0.017    -.0299295    -.002919
       trend |   .0067788   .0010267     6.60   0.000     .0047542    .0088033
log_hhinc_~j |    .071994    .023121     3.11   0.002     .0264032    .1175847
       _cons |   .6947846   .2363201     2.94   0.004     .2287999    1.160769
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      5086        5086           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 243 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =     60,512
Absorbing 2 HDFE groups                           F(   3,    201) =       3.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0125
                                                  R-squared       =     0.9630
                                                  Adj R-squared   =     0.9593
                                                  Within R-sq.    =     0.0046
Number of clusters (dma_code) =        202        Root MSE        =     0.1079

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -1.967688   2.120933    -0.93   0.355    -6.149822    2.214445
 post_merger |  -.0116463   .0068035    -1.71   0.088    -.0250616     .001769
log_hhinc_~j |   .0590893   .0233782     2.53   0.012     .0129912    .1051873
       _cons |   .8751486   .2407673     3.63   0.000      .400395    1.349902
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      5086        5086           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout

. 
. reghdfe lprice post_merger_merging post_merger trend, abs(entity_effects) vce
> (cluster dma_code)
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   2,    201) =      89.40
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0065
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0257514   .0027109    -9.50   0.000    -.0310969   -.0204059
       trend |   .0043399   .0003477    12.48   0.000     .0036544    .0050255
       _cons |   1.601321    .002399   667.49   0.000      1.59659    1.606051
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl1

. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
> , abs(entity_effects) vce(cluster dma_code)
(dropped 404 singleton observations)
(MWFE estimator converged in 1 iterations)
note: post_merger_merging omitted because of collinearity

HDFE Linear regression                            Number of obs   =     64,024
Absorbing 1 HDFE group                            F(   3,    201) =      66.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9418
                                                  Adj R-squared   =     0.9360
                                                  Within R-sq.    =     0.0069
Number of clusters (dma_code) =        202        Root MSE        =     0.1345

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |          0  (omitted)
 post_merger |  -.0259298   .0027102    -9.57   0.000    -.0312738   -.0205858
log_hhinc_~j |   .0215683   .0086972     2.48   0.014     .0044188    .0387178
       trend |   .0044016    .000347    12.68   0.000     .0037173     .005086
       _cons |   1.380685   .0887376    15.56   0.000     1.205709    1.555661
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      5818        5818           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl2

. 
. esttab tabl1 tabl2 using `2'/did_stata_table_`3'.tex, replace se r2 ar2 title
> ("Reduced Form Price Effects") mtitles("DMA/Product FE" "DMA/Product, Demogra
> phics") addnote("Data frequency: `3'.")
(note: file ../output//did_stata_table_quarter.tex not found)
(output written to ../output//did_stata_table_quarter.tex)

. 
. 
. est clear

. 
. 
. 
. 
. exit, STATA clear
