
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

25-user 4-core Stata network perpetual license:
       Serial number:  501406210780
         Licensed to:  NUIT ART - Research Computing
                       Anton Verlygo (anton@northwestern.edu)

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /projects/b1048/gillanes/Mergers/Codes/Mergers/Main/did_test2_brandlevel.d
> o ../../../All/m_1912896020_1/intermediate ../output/ quarter 

. 
. clear all

. 
. set more off

. 
. est clear

. 
. /* *args: input_path       = `1' */
. /* *args: output_path      = `2' */
. /* *args: month_or_quarter = `3' */
. 
. cd `1'
/projects/b1048/gillanes/Mergers/All/m_1912896020_1/intermediate

. log using `2'/did_stata_`3', text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /projects/b1048/gillanes/Mergers/All/m_1912896020_1/intermediate/.
> ./output//did_stata_quarter.log
  log type:  text
 opened on:  18 Sep 2020, 02:10:48

. 
. import delimited "stata_did_`3'.csv", encoding(ISO-8859-1)
(23 vars, 284,105 obs)

. 
. /*Install Packages*/
. 
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ftools
checking ftools consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install reghdfe
checking reghdfe consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /* Fixed Effects */
. egen entity_effects = group(brand_code_uc dma_code)

. egen time_effects = group(year `3') /* same goes for month*/

. egen time_calendar = group(`3') /* same goes for month*/

. 
. 
. /* WEIGHTING SCHEMES */
. gen pre_vol = volume * (1 - post_merger)

. gen weights_0 = 1 /*to add weights that won't change things*/

. egen weights_1 = total(pre_vol), by(brand_code_uc)

. egen weights_2 = total(pre_vol), by(dma_code)

. egen weights_3 = total(pre_vol), by(brand_code_uc dma_code)

. replace weights_1 = round(weights_1)
(5,860 real changes made)

. replace weights_2 = round(weights_2)
(107,244 real changes made)

. replace weights_3 = round(weights_3)
(250,854 real changes made)

. 
. /*Naive Variables*/
. gen np_dhhi = post_merger*dhhi
(584 missing values generated)

. gen np_HHI = post_merger*post_hhi
(584 missing values generated)

. 
. 
. 
. forval x = 0/3 {
  2. 
. * No Fixed-Effects
. reg lprice post_merger_merging post_merger trend [aw = weights_`x'], vce(clus
> ter dma_code)
  3. est sto NO_FE_`x'
  4. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE") replace
  5. 
. * Product/Market Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> entity_effects) vce(cluster dma_code)
  6. est sto PM_FE_`x'
  7. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE") append
  8. 
. 
. * Product/Market and Time Fixed-Effects
. reghdfe lprice post_merger_merging [aw = weights_`x'], abs(entity_effects tim
> e_effects) vce(cluster dma_code)
  9. est sto PMT_FE_`x'
 10. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE") append
 11. 
. 
. * Calendar Fixed-Effects
. reghdfe lprice post_merger_merging post_merger trend [aw = weights_`x'], abs(
> time_calendar entity_effects) vce(cluster dma_code)
 12. est sto PMT_C_`x'
 13. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE") append
 14. 
. * Dma-Specific Time Trends
. reghdfe lprice post_merger_merging post_merger [aw = weights_`x'], abs(dma_co
> de##c.trend entity_effects) vce(cluster dma_code)
 15. est sto PMT_t_`x'
 16. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends") append
 17. 
. 
. *MAJOR*
. 
. * No Fixed-Effects, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend [aw = weig
> hts_`x'], vce(cluster dma_code)
 18. est sto NO_FE_M_`x'
 19. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Major") append
 20. 
. 
. * Product/market Fixed-Effects (Time Trend)
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(entity_effects) vce(cluster dma_code)
 21. est sto PM_FE_M_`x'
 22. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, Major") append
 23. 
. 
. * Product/market and Time Fixed-Effects
. reghdfe lprice post_merger_merging post_merger_major [aw = weights_`x'], abs(
> entity_effects time_effects) vce(cluster dma_code)
 24. est sto PMT_FE_M_`x'
 25. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Major") append
 26. 
. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major trend [aw = 
> weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 27. est sto PMT_C_M_`x'
 28. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Major") append
 29. 
. reghdfe lprice post_merger_merging post_merger post_merger_major [aw = weight
> s_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
 30. est sto PMT_t_M_`x'
 31. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Major") append
 32. 
. /******************************/
. /******************************/
. /******************************/
. 
. *DHHI
. 
. * No Fixed-Effects, DHHI
. reg lprice post_merger_dhhi post_merger trend [aw = weights_`x'], vce(cluster
>  dma_code)
 33. est sto NO_FE_DHHI_`x'
 34. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, DHHI") append
 35. 
. * Product/market Fixed-Effects, DHHI
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(ent
> ity_effects) vce(cluster dma_code)
 36. est sto PM_FE_DHHI_`x'
 37. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, DHHI") append
 38. 
. *Product/market and Time Fixed-Effects, DHHI.
. reghdfe lprice post_merger_dhhi [aw = weights_`x'], abs(entity_effects time_e
> ffects) vce(cluster dma_code)
 39. est sto PMT_FE_DHHHI_`x'
 40. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Major") append
 41. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend [aw = weights_`x'], abs(tim
> e_calendar entity_effects) vce(cluster dma_code)
 42. est sto PMT_C_DHHI_`x'
 43. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, DHHI") append
 44. 
. reghdfe lprice post_merger_dhhi post_merger [aw = weights_`x'], abs(dma_code#
> #c.trend entity_effects) vce(cluster dma_code)
 45. est sto PMT_t_DHHI_`x'
 46. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, DHHI") append
 47. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. *NAIVE SPECIFICATIONS
. 
. 
. *No FE
. 
. *No Fixed-Effects naive DHHI and post-HHI
. reg lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`x'],
>  vce(cluster dma_code)
 48. est sto np_D_H_`x'
 49. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Naive DHHI & post HHI") append
 50. 
. *No Fixed-Effects naive post-HHI
. reg lprice post_merger post_hhi  np_HHI trend [aw = weights_`x'], vce(cluster
>  dma_code)
 51. est sto np_H_`x'
 52. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Naive post HHI") append
 53. 
. *No Fixed-Effects naive DHHI
. reg lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], vce(cluster dma
> _code)
 54. est sto np_D_`x'
 55. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Naive DHHI") append
 56. 
. *Product/market FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI trend [aw = weights_`x'], abs(entit
> y_effects) vce(cluster dma_code)
 57. est sto PM_FE_np_D_H_`x'
 58. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI & post HHI") append
 59. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice post_merger np_HHI trend [aw = weights_`x'], abs(entity_effect
> s) vce(cluster dma_code)
 60. est sto PM_FE_np_H_`x'
 61. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive post HHI") append
 62. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice post_merger np_dhhi trend [aw = weights_`x'], abs(entity_effec
> ts) vce(cluster dma_code)
 63. est sto PM_FE_np_D_`x'
 64. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI") append
 65. 
. *Product/Market and Time FE
. 
. *Product/market Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice np_dhhi np_HHI [aw = weights_`x'], abs(entity_effects time_eff
> ects) vce(cluster dma_code)
 66. est sto PMT_FE_np_D_H_`x'
 67. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI & post HHI") append
 68. 
. *Product/market Fixed-Effects, naive post-HHI
. reghdfe lprice np_HHI [aw = weights_`x'], abs(entity_effects time_effects) vc
> e(cluster dma_code)
 69. est sto PMT_FE_np_H_`x'
 70. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive post HHI") append
 71. 
. *Product/market Fixed-Effects, naive DHHI
. reghdfe lprice np_dhhi [aw = weights_`x'], abs(entity_effects time_effects) v
> ce(cluster dma_code)
 72. est sto PMT_FE_np_D_`x'
 73. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Naive DHHI") append
 74. 
. 
. /******************************/
. 
. *Calendar Fixed-Effects, naive DHHI and post-HHI
. reghdfe lprice post_merger post_hhi dhhi np_dhhi np_HHI trend [aw = weights_`
> x'], abs(time_calendar entity_effects) vce(cluster dma_code)
 75. est sto PMT_FE_t_np_D_H_`x'
 76. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Naive DHHI & post HHI") append
 77. 
. *DMA-trends, naive DHHI and post-HHI
. reghdfe lprice post_merger np_dhhi np_HHI [aw = weights_`x'], abs(dma_code##c
> .trend entity_effects) vce(cluster dma_code)
 78. est sto PMT_FE_t_np_D_H_`x'
 79. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Naive DHHI & post HHI") append
 80. 
. *Calendar Fixed-Effects, naive post-HHI
. reghdfe lprice post_hhi post_merger np_HHI trend [aw = weights_`x'], abs(time
> _calendar entity_effects) vce(cluster dma_code)
 81. est sto PMT_FE_t_np_H_`x'
 82. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Naive post HHI") append
 83. 
. *DMA-trends, naive post-HHI
. reghdfe lprice post_merger np_HHI [aw = weights_`x'], abs(dma_code##c.trend e
> ntity_effects) vce(cluster dma_code)
 84. est sto PMT_FE_t_np_H_`x'
 85. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Naive post HHI") append
 86. 
. *Calendar Fixed-Effects, naive DHHI
. reghdfe lprice post_merger dhhi np_dhhi trend [aw = weights_`x'], abs(time_ca
> lendar entity_effects) vce(cluster dma_code)
 87. est sto PMT_FE_t_np_D_`x'
 88. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Naive DHHI") append
 89. 
. *DMA-trends, naive DHHI
. reghdfe lprice post_merger np_dhhi [aw = weights_`x'], abs(dma_code##c.trend 
> entity_effects) vce(cluster dma_code)
 90. est sto PMT_FE_t_np_D_`x'
 91. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Naive DHHI") append
 92. 
. 
. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. 
. 
. * No Fixed-Effects, Demographics
. reg lprice post_merger_merging post_merger log_hhinc_per_person_adj trend [aw
>  = weights_`x'], vce(cluster dma_code)
 93. est sto NO_FE_d_`x'
 94. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Demographics") append
 95. 
. * Product/market Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(entity_effects) vce(cluster dma_code)
 96. *note: this one  seemed to have both Time F-E and Time-Trends*
. est sto PM_FE_d_`x'
 97. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Products FE, Demographics") append
 98. 
. * Product/market and Time Fixed-Effects, Demographics
. reghdfe lprice post_merger_merging log_hhinc_per_person_adj [aw = weights_`x'
> ], abs(entity_effects time_effects) vce(cluster dma_code)
 99. est sto PMT_FE_d_`x'
100. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Demographics") append
101. 
. 
. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
>  [aw = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
102. est sto PMT_C_d_`x'
103. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Demographics") append
104. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj [aw =
>  weights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
105. est sto PMT_t_d_`x'
106. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Demographics") append
107. 
. 
. 
. * No Fixed-Effects, Demographics, but with Major
. reg lprice post_merger_merging post_merger post_merger_major trend log_hhinc_
> per_person_adj [aw = weights_`x'], vce(cluster dma_code)
108. est sto NO_FE_d_M_`x'
109. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, Major, Demographics") append
110. 
. *Products/market Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger post_merger_major trend log_hh
> inc_per_person_adj [aw = weights_`x'], abs(entity_effects) vce(cluster dma_co
> de)
111. est sto PM_FE_d_M_`x'
112. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, Major, Demographics") append
113. 
. *Products/market and Time Fixed-Effects, Major, Demographics
. reghdfe lprice post_merger_merging post_merger_major log_hhinc_per_person_adj
>  [aw = weights_`x'], abs(entity_effects time_effects) vce(cluster dma_code)
114. est sto PMT_FE_d_M_`x'
115. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, Major, Demographics") append
116. 
. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj trend [aw = weights_`x'], abs(time_calendar entity_effects) vce(
> cluster dma_code)
117. est sto PMT_C_d_M_`x'
118. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, Major, Demographics") append
119. 
. reghdfe lprice post_merger_merging post_merger post_merger_major log_hhinc_pe
> r_person_adj [aw = weights_`x'], abs(dma_code##c.trend entity_effects) vce(cl
> uster dma_code)
120. est sto PMT_t_d_M_`x'
121. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, Major, Demographics") append
122. 
. /******************************/
. /******************************/
. /******************************/
. 
. *No Fixed-Effects, DHHI, Demographics
. reg lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [aw = 
> weights_`x'], vce(cluster dma_code)
123. est sto NO_FE_DHHI_d_`x'
124. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("No FE, DHHI, Demographics") append
125. 
. *Product/market Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(entity_effects) vce(cluster dma_code)
126. est sto PM_FE_DHHI_d_`x'
127. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product FE, DHHI, Demographics") append
128. 
. *Product/market and Time Fixed-Effects, DHHI, Demographics
. reghdfe lprice post_merger_dhhi log_hhinc_per_person_adj [aw = weights_`x'], 
> abs(entity_effects time_effects) vce(cluster dma_code)
129. est sto PMT_FE_DHHI_d_`x'
130. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Time FE, DHHI, Demographics") append
131. 
. 
. reghdfe lprice post_merger_dhhi post_merger trend log_hhinc_per_person_adj [a
> w = weights_`x'], abs(time_calendar entity_effects) vce(cluster dma_code)
132. est sto PMT_C_d_D_`x'
133. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("Calendar FE, DHHI, Demographics") append
134. 
. reghdfe lprice post_merger_dhhi post_merger log_hhinc_per_person_adj [aw = we
> ights_`x'], abs(dma_code##c.trend entity_effects) vce(cluster dma_code)
135. est sto PMT_t_d_D_`x'
136. outreg2 using `2'/brandlevel_did_stata_`3'_`x'.txt, stats(coef se pval) ct
> itle("DMA/Product Trends, DHHI, Demographics") append
137. 
. /******************************/
. /******************************/
. /******************************/
. 
. 
. 
. 
. est clear
138. 
. 
. }
(sum of wgt is   2.8411e+05)

Linear regression                               Number of obs     =    284,105
                                                F(3, 203)         =    2438.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0499
                                                Root MSE          =       .288

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.1843443   .0022444   -82.14   0.000    -.1887696   -.1799189
 post_merger |   .0923273    .001402    65.85   0.000      .089563    .0950916
       trend |   .0019584   .0002029     9.65   0.000     .0015583    .0023585
       _cons |   .7362104    .004766   154.47   0.000     .7268133    .7456075
------------------------------------------------------------------------------
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   3,    201) =     280.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8637
                                                  Adj R-squared   =     0.8605
                                                  Within R-sq.    =     0.0227
Number of clusters (dma_code) =        202        Root MSE        =     0.1103

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |     .01908   .0011782    16.19   0.000     .0167569    .0214032
 post_merger |   .0144034    .000906    15.90   0.000     .0126169    .0161899
       trend |   .0010476   .0001553     6.75   0.000     .0007414    .0013537
       _cons |   .7449145   .0014386   517.81   0.000     .7420778    .7477511
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   1,    201) =     267.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8670
                                                  Adj R-squared   =     0.8638
                                                  Within R-sq.    =     0.0019
Number of clusters (dma_code) =        202        Root MSE        =     0.1090

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0193244   .0011819    16.35   0.000     .0169939    .0216548
       _cons |   .7615439   .0002194  3471.55   0.000     .7611114    .7619765
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     290.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8648
                                                  Adj R-squared   =     0.8616
                                                  Within R-sq.    =     0.0258
Number of clusters (dma_code) =        202        Root MSE        =     0.1098

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0190454   .0011776    16.17   0.000     .0167235    .0213674
 post_merger |   .0164281   .0009529    17.24   0.000     .0145491    .0183071
       trend |   .0011164   .0001549     7.21   0.000     .0008109     .001422
       _cons |   .7432984   .0014429   515.15   0.000     .7404533    .7461435
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   2,    201) =     401.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8654
                                                  Adj R-squared   =     0.8620
                                                  Within R-sq.    =     0.0043
Number of clusters (dma_code) =        202        Root MSE        =     0.1097

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0186369   .0011794    15.80   0.000     .0163113    .0209625
 post_merger |   .0147932   .0009161    16.15   0.000     .0129868    .0165997
       _cons |   .7544478   .0004203  1794.88   0.000      .753619    .7552766
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.8411e+05)

Linear regression                               Number of obs     =    284,105
                                                F(4, 203)         =    2727.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1582
                                                Root MSE          =     .27109

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4863962   .0049226   -98.81   0.000    -.4961022   -.4766903
 post_merger |    .394668   .0038426   102.71   0.000     .3870916    .4022445
post_merg~or |  -.4054776   .0042724   -94.91   0.000    -.4139015   -.3970537
       trend |   .0019277   .0001979     9.74   0.000     .0015375     .002318
       _cons |   .7363515   .0047579   154.77   0.000     .7269703    .7457326
------------------------------------------------------------------------------
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   4,    201) =     313.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8641
                                                  Adj R-squared   =     0.8609
                                                  Within R-sq.    =     0.0254
Number of clusters (dma_code) =        202        Root MSE        =     0.1101

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0451684   .0016486    27.40   0.000     .0419177    .0484191
 post_merger |  -.0113879   .0013441    -8.47   0.000    -.0140381   -.0087376
post_merg~or |   .0347008   .0013751    25.23   0.000     .0319893    .0374123
       trend |    .001016   .0001549     6.56   0.000     .0007106    .0013214
       _cons |     .74513    .001436   518.89   0.000     .7422984    .7479616
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   2,    201) =     415.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8674
                                                  Adj R-squared   =     0.8642
                                                  Within R-sq.    =     0.0049
Number of clusters (dma_code) =        202        Root MSE        =     0.1088

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0459345   .0016607    27.66   0.000     .0426599    .0492091
post_merg~or |   .0353928   .0013762    25.72   0.000     .0326791    .0381064
       _cons |   .7486218   .0005748  1302.36   0.000     .7474884    .7497553
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   4,    201) =     318.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8652
                                                  Adj R-squared   =     0.8620
                                                  Within R-sq.    =     0.0286
Number of clusters (dma_code) =        202        Root MSE        =     0.1097

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    .045136   .0016491    27.37   0.000     .0418843    .0483877
 post_merger |  -.0093599   .0013686    -6.84   0.000    -.0120586   -.0066613
post_merg~or |   .0347038   .0013753    25.23   0.000      .031992    .0374157
       trend |   .0010845   .0001546     7.02   0.000     .0007797    .0013892
       _cons |    .743515   .0014403   516.22   0.000      .740675    .7463551
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     421.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8658
                                                  Adj R-squared   =     0.8624
                                                  Within R-sq.    =     0.0071
Number of clusters (dma_code) =        202        Root MSE        =     0.1095

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0447988   .0016397    27.32   0.000     .0415656    .0480319
 post_merger |  -.0110595   .0013443    -8.23   0.000    -.0137103   -.0084088
post_merg~or |   .0347708   .0013741    25.30   0.000     .0320613    .0374803
       _cons |   .7543734   .0004236  1780.78   0.000     .7535381    .7552087
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.8352e+05)

Linear regression                               Number of obs     =    283,521
                                                F(3, 199)         =     213.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0049
                                                Root MSE          =     .29476

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -.0139318   .1755244    -0.08   0.937    -.3600582    .3321946
 post_merger |   .0229184    .010677     2.15   0.033     .0018638     .043973
       trend |   .0019138   .0001977     9.68   0.000     .0015239    .0023037
       _cons |   .7364156    .004748   155.10   0.000     .7270527    .7457785
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     265.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8636
                                                  Adj R-squared   =     0.8604
                                                  Within R-sq.    =     0.0224
Number of clusters (dma_code) =        198        Root MSE        =     0.1103

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3123464   .0700275     4.46   0.000     .1742467    .4504462
 post_merger |    .002715    .004144     0.66   0.513    -.0054573    .0108874
       trend |   .0010563   .0001555     6.79   0.000     .0007497     .001363
       _cons |    .744507   .0013632   546.16   0.000     .7418187    .7471953
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      19.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8668
                                                  Adj R-squared   =     0.8637
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        198        Root MSE        =     0.1090

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3138895    .070244     4.47   0.000     .1753629    .4524162
       _cons |   .7554916   .0020801   363.20   0.000     .7513895    .7595937
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     283.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8647
                                                  Adj R-squared   =     0.8615
                                                  Within R-sq.    =     0.0256
Number of clusters (dma_code) =        198        Root MSE        =     0.1099

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3127206     .07006     4.46   0.000     .1745567    .4508846
 post_merger |    .004733   .0041469     1.14   0.255     -.003445    .0129111
       trend |   .0011226   .0001552     7.24   0.000     .0008166    .0014286
       _cons |   .7429037   .0013672   543.39   0.000     .7402075    .7455999
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     341.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8651
                                                  Adj R-squared   =     0.8618
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1098

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .1158397   .0339578     3.41   0.001     .0488723    .1828072
 post_merger |   .0149097   .0021623     6.90   0.000     .0106455    .0191739
       _cons |   .7540911   .0004097  1840.45   0.000     .7532831    .7548991
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.8352e+05)

Linear regression                               Number of obs     =    283,521
                                                F(6, 199)         =     138.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0057
                                                Root MSE          =     .29464

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0287544   .0197688     1.45   0.147    -.0102289    .0677377
    post_hhi |   .0271953   .0808725     0.34   0.737    -.1322817    .1866723
        dhhi |   -.392661   .2461673    -1.60   0.112    -.8780922    .0927703
     np_dhhi |   .3468846    .094951     3.65   0.000     .1596455    .5341238
      np_HHI |  -.0591109   .0350016    -1.69   0.093    -.1281326    .0099108
       trend |   .0019128   .0001972     9.70   0.000     .0015239    .0023018
       _cons |   .7475877   .0483414    15.46   0.000     .6522606    .8429148
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   2.8352e+05)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =     181.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0052
                                                Root MSE          =     .29473

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0837283   .0153428     5.46   0.000      .053473    .1139837
    post_hhi |    .108469   .0648818     1.67   0.096    -.0194751    .2364131
      np_HHI |  -.1309576   .0325243    -4.03   0.000    -.1950941   -.0668211
       trend |   .0019184    .000198     9.69   0.000     .0015279    .0023089
       _cons |   .6853056   .0317736    21.57   0.000     .6226494    .7479618
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   2.8352e+05)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =     191.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0057
                                                Root MSE          =     .29465

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0026732   .0050089    -0.53   0.594    -.0125505     .007204
        dhhi |   -.419607   .2061112    -2.04   0.043    -.8260493   -.0131647
     np_dhhi |   .4056751   .0828633     4.90   0.000     .2422723     .569078
       trend |   .0019106   .0001969     9.70   0.000     .0015222     .002299
       _cons |   .7620522   .0117152    65.05   0.000     .7389503     .785154
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     200.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8636
                                                  Adj R-squared   =     0.8605
                                                  Within R-sq.    =     0.0225
Number of clusters (dma_code) =        198        Root MSE        =     0.1103

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0260019   .0173955     1.49   0.137    -.0083035    .0603073
     np_dhhi |   .2688898   .0832508     3.23   0.001     .1047127     .433067
      np_HHI |  -.0438233   .0299871    -1.46   0.145    -.1029602    .0153136
       trend |   .0010578   .0001555     6.80   0.000     .0007511    .0013646
       _cons |   .7445083    .001355   549.45   0.000     .7418361    .7471805
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     249.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8635
                                                  Adj R-squared   =     0.8603
                                                  Within R-sq.    =     0.0217
Number of clusters (dma_code) =        198        Root MSE        =     0.1104

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0685201   .0124933     5.48   0.000     .0438824    .0931579
      np_HHI |  -.0993372   .0262846    -3.78   0.000    -.1511724    -.047502
       trend |   .0010605   .0001556     6.81   0.000     .0007536    .0013674
       _cons |   .7444914   .0014003   531.66   0.000     .7417299    .7472529
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     265.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8636
                                                  Adj R-squared   =     0.8604
                                                  Within R-sq.    =     0.0224
Number of clusters (dma_code) =        198        Root MSE        =     0.1103

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .002715    .004144     0.66   0.513    -.0054573    .0108874
     np_dhhi |   .3123464   .0700275     4.46   0.000     .1742467    .4504462
       trend |   .0010563   .0001555     6.79   0.000     .0007497     .001363
       _cons |    .744507   .0013632   546.16   0.000     .7418187    .7471953
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =      13.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8669
                                                  Adj R-squared   =     0.8637
                                                  Within R-sq.    =     0.0017
Number of clusters (dma_code) =        198        Root MSE        =     0.1090

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .2700436   .0836182     3.23   0.001     .1051418    .4349453
      np_HHI |  -.0442165   .0303298    -1.46   0.146    -.1040293    .0155963
       _cons |   .7669559   .0086331    88.84   0.000     .7499308     .783981
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      14.17
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.8667
                                                  Adj R-squared   =     0.8636
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1090

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.0999693   .0265543    -3.76   0.000    -.1523366   -.0476021
       _cons |   .7877707   .0061052   129.03   0.000     .7757308    .7998106
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      19.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8668
                                                  Adj R-squared   =     0.8637
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        198        Root MSE        =     0.1090

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .3138895    .070244     4.47   0.000     .1753629    .4524162
       _cons |   .7554916   .0020801   363.20   0.000     .7513895    .7595937
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     214.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8647
                                                  Adj R-squared   =     0.8616
                                                  Within R-sq.    =     0.0257
Number of clusters (dma_code) =        198        Root MSE        =     0.1099

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0280877   .0173713     1.62   0.107    -.0061698    .0623452
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   .2691366   .0832484     3.23   0.001     .1049642    .4333091
      np_HHI |  -.0439518   .0299554    -1.47   0.144    -.1030262    .0151227
       trend |   .0011242   .0001552     7.24   0.000     .0008181    .0014302
       _cons |   .7429048   .0013592   546.57   0.000     .7402243    .7455852
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     230.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8651
                                                  Adj R-squared   =     0.8618
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1098

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .028206   .0101367     2.78   0.006     .0082156    .0481964
     np_dhhi |   .0910424   .0419307     2.17   0.031     .0083518     .173733
      np_HHI |  -.0250057   .0179302    -1.39   0.165    -.0603655    .0103541
       _cons |   .7540955   .0004068  1853.90   0.000     .7532933    .7548977
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     268.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8646
                                                  Adj R-squared   =     0.8614
                                                  Within R-sq.    =     0.0248
Number of clusters (dma_code) =        198        Root MSE        =     0.1099

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0706436   .0124855     5.66   0.000     .0460212     .095266
      np_HHI |  -.0995166    .026276    -3.79   0.000     -.151335   -.0476983
       trend |   .0011269   .0001553     7.26   0.000     .0008207    .0014331
       _cons |   .7428877   .0014049   528.79   0.000     .7401172    .7456583
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     336.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8651
                                                  Adj R-squared   =     0.8618
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1098

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0425898   .0072245     5.90   0.000     .0283426    .0568371
      np_HHI |  -.0437566   .0150766    -2.90   0.004    -.0734889   -.0140243
       _cons |   .7540936   .0004128  1826.80   0.000     .7532795    .7549077
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     283.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8647
                                                  Adj R-squared   =     0.8615
                                                  Within R-sq.    =     0.0256
Number of clusters (dma_code) =        198        Root MSE        =     0.1099

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .004733   .0041469     1.14   0.255     -.003445    .0129111
        dhhi |          0  (omitted)
     np_dhhi |   .3127206     .07006     4.46   0.000     .1745567    .4508846
       trend |   .0011226   .0001552     7.24   0.000     .0008166    .0014286
       _cons |   .7429037   .0013672   543.39   0.000     .7402075    .7455999
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     341.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8651
                                                  Adj R-squared   =     0.8618
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1098

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0149097   .0021623     6.90   0.000     .0106455    .0191739
     np_dhhi |   .1158397   .0339578     3.41   0.001     .0488723    .1828072
       _cons |   .7540911   .0004097  1840.45   0.000     .7532831    .7548991
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.8411e+05)

Linear regression                               Number of obs     =    284,105
                                                F(4, 203)         =    1849.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0499
                                                Root MSE          =     .28799

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.1843629    .002245   -82.12   0.000    -.1887894   -.1799363
 post_merger |   .0921974   .0014122    65.29   0.000     .0894131    .0949818
log_hhinc_~j |  -.0114642   .0148722    -0.77   0.442    -.0407879    .0178595
       trend |   .0019229   .0002049     9.38   0.000     .0015189    .0023269
       _cons |   .8533797   .1521671     5.61   0.000      .553349     1.15341
------------------------------------------------------------------------------
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   4,    201) =     213.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8637
                                                  Adj R-squared   =     0.8605
                                                  Within R-sq.    =     0.0227
Number of clusters (dma_code) =        202        Root MSE        =     0.1103

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    .019087   .0011785    16.20   0.000     .0167631    .0214108
 post_merger |     .01432   .0009018    15.88   0.000     .0125418    .0160982
log_hhinc_~j |  -.0079434   .0048603    -1.63   0.104    -.0175272    .0016404
       trend |   .0010226   .0001557     6.57   0.000     .0007157    .0013296
       _cons |    .826096   .0496942    16.62   0.000     .7281072    .9240849
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   2,    201) =     135.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8670
                                                  Adj R-squared   =     0.8638
                                                  Within R-sq.    =     0.0019
Number of clusters (dma_code) =        202        Root MSE        =     0.1090

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0193262   .0011818    16.35   0.000     .0169959    .0216565
log_hhinc_~j |  -.0044611   .0038855    -1.15   0.252    -.0121226    .0032005
       _cons |   .8069845   .0395908    20.38   0.000     .7289179    .8850511
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   4,    201) =     222.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8648
                                                  Adj R-squared   =     0.8616
                                                  Within R-sq.    =     0.0260
Number of clusters (dma_code) =        202        Root MSE        =     0.1098

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0190557    .001178    16.18   0.000     .0167329    .0213786
 post_merger |   .0162883   .0009473    17.19   0.000     .0144203    .0181563
log_hhinc_~j |  -.0115631   .0048897    -2.36   0.019    -.0212049   -.0019214
       trend |   .0010828   .0001551     6.98   0.000     .0007769    .0013886
       _cons |   .8614581   .0499784    17.24   0.000      .762909    .9600073
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     272.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8654
                                                  Adj R-squared   =     0.8621
                                                  Within R-sq.    =     0.0044
Number of clusters (dma_code) =        202        Root MSE        =     0.1097

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    .018637   .0011799    15.80   0.000     .0163105    .0209635
 post_merger |   .0146946    .000908    16.18   0.000     .0129041     .016485
log_hhinc_~j |  -.0093237   .0049365    -1.89   0.060    -.0190577    .0004103
       _cons |   .8494682   .0502943    16.89   0.000      .750296    .9486404
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.8411e+05)

Linear regression                               Number of obs     =    284,105
                                                F(5, 203)         =    2183.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1583
                                                Root MSE          =     .27107

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4865229   .0049203   -98.88   0.000    -.4962243   -.4768214
 post_merger |   .3945866   .0038595   102.24   0.000     .3869768    .4021964
post_merg~or |  -.4056126    .004274   -94.90   0.000    -.4140397   -.3971856
       trend |   .0018779   .0002003     9.38   0.000      .001483    .0022728
log_hhinc_~j |  -.0160767   .0147924    -1.09   0.278    -.0452432    .0130898
       _cons |   .9006626    .151333     5.95   0.000     .6022765    1.199049
------------------------------------------------------------------------------
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   5,    201) =     252.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8641
                                                  Adj R-squared   =     0.8609
                                                  Within R-sq.    =     0.0255
Number of clusters (dma_code) =        202        Root MSE        =     0.1101

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0452008   .0016505    27.39   0.000     .0419462    .0484554
 post_merger |  -.0114993   .0013424    -8.57   0.000    -.0141462   -.0088524
post_merg~or |   .0347344   .0013772    25.22   0.000     .0320188      .03745
       trend |   .0009901   .0001553     6.37   0.000     .0006838    .0012964
log_hhinc_~j |  -.0082416   .0048595    -1.70   0.091    -.0178238    .0013406
       _cons |   .8293592   .0496887    16.69   0.000     .7313811    .9273372
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     278.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8674
                                                  Adj R-squared   =     0.8642
                                                  Within R-sq.    =     0.0049
Number of clusters (dma_code) =        202        Root MSE        =     0.1088

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0459452   .0016606    27.67   0.000     .0426708    .0492196
post_merg~or |   .0354044   .0013766    25.72   0.000     .0326899    .0381188
log_hhinc_~j |   -.004653   .0038778    -1.20   0.232    -.0122993    .0029934
       _cons |    .796013   .0395091    20.15   0.000     .7181075    .8739184
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   5,    201) =     256.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8652
                                                  Adj R-squared   =     0.8620
                                                  Within R-sq.    =     0.0288
Number of clusters (dma_code) =        202        Root MSE        =     0.1097

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0451827   .0016513    27.36   0.000     .0419265    .0484388
 post_merger |   -.009539   .0013655    -6.99   0.000    -.0122315   -.0068465
post_merg~or |   .0347519   .0013777    25.22   0.000     .0320353    .0374685
log_hhinc_~j |  -.0118607   .0048886    -2.43   0.016    -.0215003   -.0022212
       trend |   .0010499   .0001547     6.78   0.000     .0007447     .001355
       _cons |   .8647164   .0499697    17.30   0.000     .7661844    .9632484
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 77 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   4,    201) =     318.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8658
                                                  Adj R-squared   =     0.8624
                                                  Within R-sq.    =     0.0072
Number of clusters (dma_code) =        202        Root MSE        =     0.1095

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0448105   .0016414    27.30   0.000     .0415739    .0480472
 post_merger |  -.0111714   .0013408    -8.33   0.000    -.0138152   -.0085276
post_merg~or |   .0347863   .0013757    25.29   0.000     .0320736    .0374991
log_hhinc_~j |  -.0094733   .0049504    -1.91   0.057    -.0192347    .0002882
       _cons |   .8509182   .0504354    16.87   0.000     .7514679    .9503685
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   2.8352e+05)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =     165.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0050
                                                Root MSE          =     .29476

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |  -.0080128   .1759923    -0.05   0.964    -.3550619    .3390362
 post_merger |   .0224245   .0107272     2.09   0.038      .001271    .0435779
       trend |   .0018824   .0002004     9.39   0.000     .0014872    .0022775
log_hhinc_~j |  -.0105128   .0151041    -0.70   0.487    -.0402974    .0192717
       _cons |   .8438562   .1546356     5.46   0.000     .5389215    1.148791
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     200.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8636
                                                  Adj R-squared   =     0.8604
                                                  Within R-sq.    =     0.0225
Number of clusters (dma_code) =        198        Root MSE        =     0.1103

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3093245   .0703103     4.40   0.000     .1706671     .447982
 post_merger |   .0028415     .00416     0.68   0.495    -.0053624    .0110454
       trend |   .0010392   .0001563     6.65   0.000      .000731    .0013474
log_hhinc_~j |  -.0055022   .0048136    -1.14   0.254     -.014995    .0039906
       _cons |   .8007391   .0492521    16.26   0.000     .7036101    .8978681
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =      10.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.8668
                                                  Adj R-squared   =     0.8637
                                                  Within R-sq.    =     0.0016
Number of clusters (dma_code) =        198        Root MSE        =     0.1090

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3128276   .0703634     4.45   0.000     .1740654    .4515899
log_hhinc_~j |  -.0019331   .0037362    -0.52   0.605    -.0093011     .005435
       _cons |   .7752139   .0382166    20.28   0.000     .6998477      .85058
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     214.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8647
                                                  Adj R-squared   =     0.8616
                                                  Within R-sq.    =     0.0257
Number of clusters (dma_code) =        198        Root MSE        =     0.1099

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |     .30771   .0704526     4.37   0.000     .1687719    .4466481
 post_merger |   .0049283   .0041711     1.18   0.239    -.0032974     .013154
       trend |   .0010963   .0001556     7.05   0.000     .0007894    .0014032
log_hhinc_~j |  -.0091258   .0048282    -1.89   0.060    -.0186473    .0003958
       _cons |   .8361559   .0493847    16.93   0.000     .7387654    .9335463
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     232.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8651
                                                  Adj R-squared   =     0.8618
                                                  Within R-sq.    =     0.0027
Number of clusters (dma_code) =        198        Root MSE        =     0.1098

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .1114646   .0330634     3.37   0.001     .0462609    .1766683
 post_merger |   .0150802   .0021065     7.16   0.000      .010926    .0192345
log_hhinc_~j |  -.0090695   .0049234    -1.84   0.067    -.0187789    .0006399
       _cons |    .846522   .0501629    16.88   0.000     .7475967    .9454473
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0310e+13)

Linear regression                               Number of obs     =    284,104
                                                F(3, 203)         =     372.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0092
                                                Root MSE          =     .19903

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0388803   .0014945   -26.02   0.000     -.041827   -.0359335
 post_merger |   .0376994   .0013155    28.66   0.000     .0351057    .0402931
       trend |   .0004085   .0001841     2.22   0.028     .0000456    .0007714
       _cons |   .7593987   .0045597   166.54   0.000     .7504081    .7683892
------------------------------------------------------------------------------
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   3,    201) =     172.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5868
                                                  Adj R-squared   =     0.5771
                                                  Within R-sq.    =     0.0115
Number of clusters (dma_code) =        202        Root MSE        =     0.1300

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0061094   .0011317     5.40   0.000     .0038779    .0083408
 post_merger |   .0220757   .0012058    18.31   0.000      .019698    .0244533
       trend |   .0003682   .0001657     2.22   0.027     .0000415     .000695
       _cons |   .7600175   .0014731   515.94   0.000     .7571129    .7629222
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   1,    201) =      29.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5943
                                                  Adj R-squared   =     0.5847
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        202        Root MSE        =     0.1288

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0062139    .001136     5.47   0.000      .003974    .0084539
       _cons |   .7740506   .0001846  4193.90   0.000     .7736867    .7744146
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     182.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5892
                                                  Adj R-squared   =     0.5795
                                                  Within R-sq.    =     0.0135
Number of clusters (dma_code) =        202        Root MSE        =     0.1296

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0061148   .0011308     5.41   0.000     .0038851    .0083445
 post_merger |   .0241241   .0012669    19.04   0.000     .0216259    .0266223
       trend |   .0004347   .0001659     2.62   0.009     .0001076    .0007618
       _cons |   .7584171   .0014796   512.58   0.000     .7554995    .7613346
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   2,    201) =     228.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5909
                                                  Adj R-squared   =     0.5806
                                                  Within R-sq.    =     0.0024
Number of clusters (dma_code) =        202        Root MSE        =     0.1295

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0059754   .0011623     5.14   0.000     .0036835    .0082674
 post_merger |   .0223363   .0012166    18.36   0.000     .0199375    .0247352
       _cons |   .7632823   .0005631  1355.44   0.000     .7621719    .7643927
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0310e+13)

Linear regression                               Number of obs     =    284,104
                                                F(4, 203)         =    3658.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0776
                                                Root MSE          =     .19203

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    -.44904   .0042487  -105.69   0.000    -.4574172   -.4406627
 post_merger |   .4477171   .0037425   119.63   0.000     .4403379    .4550963
post_merg~or |   -.430904   .0040165  -107.28   0.000    -.4388234   -.4229847
       trend |   .0004235   .0001836     2.31   0.022     .0000614    .0007856
       _cons |   .7593301   .0045636   166.39   0.000     .7503321    .7683281
------------------------------------------------------------------------------
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   4,    201) =     287.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5872
                                                  Adj R-squared   =     0.5774
                                                  Within R-sq.    =     0.0124
Number of clusters (dma_code) =        202        Root MSE        =     0.1300

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0479081   .0016475    29.08   0.000     .0446594    .0511567
 post_merger |  -.0196861   .0015955   -12.34   0.000    -.0228322     -.01654
post_merg~or |   .0438781   .0015437    28.42   0.000     .0408342    .0469219
       trend |   .0003643   .0001656     2.20   0.029     .0000379    .0006908
       _cons |   .7600459    .001472   516.33   0.000     .7571433    .7629484
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   2,    201) =     467.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5947
                                                  Adj R-squared   =     0.5851
                                                  Within R-sq.    =     0.0010
Number of clusters (dma_code) =        202        Root MSE        =     0.1288

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0480925   .0016616    28.94   0.000      .044816     .051369
post_merg~or |    .043962   .0015579    28.22   0.000     .0408899     .047034
       _cons |   .7537988   .0007016  1074.33   0.000     .7524153    .7551823
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   4,    201) =     286.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5896
                                                  Adj R-squared   =     0.5799
                                                  Within R-sq.    =     0.0144
Number of clusters (dma_code) =        202        Root MSE        =     0.1296

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0478718   .0016495    29.02   0.000     .0446193    .0511243
 post_merger |  -.0175974   .0016197   -10.86   0.000    -.0207911   -.0144037
post_merg~or |   .0438343   .0015463    28.35   0.000     .0407852    .0468833
       trend |   .0004309   .0001657     2.60   0.010     .0001041    .0007577
       _cons |   .7584454   .0014786   512.96   0.000     .7555299    .7613608
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     364.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5912
                                                  Adj R-squared   =     0.5810
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        202        Root MSE        =     0.1294

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0476572   .0016655    28.61   0.000      .044373    .0509413
 post_merger |  -.0193099   .0015951   -12.11   0.000    -.0224552   -.0161645
post_merg~or |   .0437557   .0015658    27.94   0.000     .0406682    .0468432
       _cons |   .7632754   .0005634  1354.69   0.000     .7621644    .7643864
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0113e+13)

Linear regression                               Number of obs     =    283,520
                                                F(3, 199)         =     169.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0050
                                                Root MSE          =     .19948

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .0815791   .1808934     0.45   0.652    -.2751349    .4382931
 post_merger |   .0197225   .0108429     1.82   0.070    -.0016592    .0411042
       trend |    .000355   .0001813     1.96   0.052    -2.44e-06    .0007124
       _cons |   .7596431    .004551   166.92   0.000     .7506688    .7686174
------------------------------------------------------------------------------
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     178.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5869
                                                  Adj R-squared   =     0.5772
                                                  Within R-sq.    =     0.0123
Number of clusters (dma_code) =        198        Root MSE        =     0.1300

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2750629   .0807717     3.41   0.001     .1157748     .434351
 post_merger |   .0074447   .0046776     1.59   0.113    -.0017799    .0166692
       trend |   .0003689   .0001657     2.23   0.027     .0000422    .0006956
       _cons |   .7597814   .0014115   538.30   0.000     .7569978    .7625649
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      11.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0008
                                                  R-squared       =     0.5944
                                                  Adj R-squared   =     0.5849
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        198        Root MSE        =     0.1288

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2759908    .081026     3.41   0.001     .1162012    .4357804
       _cons |   .7667158   .0023702   323.48   0.000     .7620415    .7713901
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     192.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5893
                                                  Adj R-squared   =     0.5797
                                                  Within R-sq.    =     0.0143
Number of clusters (dma_code) =        198        Root MSE        =     0.1296

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2762488   .0807759     3.42   0.001     .1169523    .4355453
 post_merger |   .0094498   .0046801     2.02   0.045     .0002203    .0186792
       trend |   .0004328   .0001658     2.61   0.010     .0001058    .0007598
       _cons |   .7581953   .0014173   534.95   0.000     .7554002    .7609903
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     226.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5906
                                                  Adj R-squared   =     0.5804
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1295

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .0901973    .051584     1.75   0.082    -.0115304    .1919251
 post_merger |   .0188892   .0031025     6.09   0.000     .0127707    .0250076
       _cons |   .7630354   .0005563  1371.54   0.000     .7619383    .7641325
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0113e+13)

Linear regression                               Number of obs     =    283,520
                                                F(6, 199)         =      91.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0058
                                                Root MSE          =      .1994

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0326527   .0204483     1.60   0.112    -.0076705     .072976
    post_hhi |   .0844572   .0775427     1.09   0.277    -.0684536    .2373679
        dhhi |  -.1456069   .2319839    -0.63   0.531     -.603069    .3118552
     np_dhhi |   .2609428   .1029975     2.53   0.012     .0578362    .4640493
      np_HHI |  -.0505924   .0347554    -1.46   0.147    -.1191286    .0179438
       trend |   .0003595   .0001814     1.98   0.049     1.83e-06    .0007172
       _cons |   .7286011   .0458245    15.90   0.000     .6382372    .8189649
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   8.0113e+13)

Linear regression                               Number of obs     =    283,520
                                                F(4, 199)         =     124.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0056
                                                Root MSE          =     .19943

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0737328   .0138603     5.32   0.000      .046401    .1010646
    post_hhi |   .1143983   .0619233     1.85   0.066    -.0077118    .2365084
      np_HHI |  -.1041033   .0291761    -3.57   0.000    -.1616373   -.0465693
       trend |   .0003622   .0001817     1.99   0.048     3.83e-06    .0007205
       _cons |   .7056128   .0299282    23.58   0.000     .6465958    .7646299
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   8.0113e+13)

Linear regression                               Number of obs     =    283,520
                                                F(4, 199)         =     130.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0055
                                                Root MSE          =     .19943

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0057298   .0050134     1.14   0.254    -.0041564    .0156159
        dhhi |  -.2302565   .1955458    -1.18   0.240    -.6158644    .1553514
     np_dhhi |   .3118354   .0862045     3.62   0.000     .1418439     .481827
       trend |   .0003558    .000181     1.97   0.051    -1.07e-06    .0007127
       _cons |   .7736242   .0112101    69.01   0.000     .7515183      .79573
------------------------------------------------------------------------------
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     136.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5869
                                                  Adj R-squared   =     0.5772
                                                  Within R-sq.    =     0.0123
Number of clusters (dma_code) =        198        Root MSE        =     0.1300

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0247125   .0197182     1.25   0.212    -.0141733    .0635984
     np_dhhi |   .2426801   .0972626     2.50   0.013     .0508705    .4344898
      np_HHI |  -.0324273   .0334057    -0.97   0.333     -.098306    .0334515
       trend |   .0003701   .0001658     2.23   0.027     .0000433     .000697
       _cons |   .7597786   .0014092   539.17   0.000     .7569996    .7625576
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     172.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5867
                                                  Adj R-squared   =     0.5770
                                                  Within R-sq.    =     0.0118
Number of clusters (dma_code) =        198        Root MSE        =     0.1301

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0629305   .0130629     4.82   0.000     .0371694    .0886916
      np_HHI |  -.0822275   .0273909    -3.00   0.003    -.1362445   -.0282105
       trend |    .000373   .0001659     2.25   0.026     .0000459    .0007002
       _cons |   .7597644   .0014483   524.58   0.000     .7569082    .7626206
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     178.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5869
                                                  Adj R-squared   =     0.5772
                                                  Within R-sq.    =     0.0123
Number of clusters (dma_code) =        198        Root MSE        =     0.1300

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0074447   .0046776     1.59   0.113    -.0017799    .0166692
     np_dhhi |   .2750629   .0807717     3.41   0.001     .1157748     .434351
       trend |   .0003689   .0001657     2.23   0.027     .0000422    .0006956
       _cons |   .7597814   .0014115   538.30   0.000     .7569978    .7625649
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =       7.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0005
                                                  R-squared       =     0.5944
                                                  Adj R-squared   =     0.5849
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        198        Root MSE        =     0.1288

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .2437209   .0976211     2.50   0.013     .0512043    .4362375
      np_HHI |  -.0323151   .0337124    -0.96   0.339    -.0987986    .0341685
       _cons |   .7750286   .0096941    79.95   0.000      .755911    .7941461
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =       8.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0033
                                                  R-squared       =     0.5942
                                                  Adj R-squared   =     0.5847
                                                  Within R-sq.    =     0.0004
Number of clusters (dma_code) =        198        Root MSE        =     0.1289

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |   -.082329   .0276424    -2.98   0.003    -.1368419    -.027816
       _cons |   .7935627   .0063032   125.90   0.000     .7811322    .8059932
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      11.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0008
                                                  R-squared       =     0.5944
                                                  Adj R-squared   =     0.5849
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        198        Root MSE        =     0.1288

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .2759908    .081026     3.41   0.001     .1162012    .4357804
       _cons |   .7667158   .0023702   323.48   0.000     .7620415    .7713901
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     146.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5893
                                                  Adj R-squared   =     0.5797
                                                  Within R-sq.    =     0.0144
Number of clusters (dma_code) =        198        Root MSE        =     0.1296

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0268022   .0197071     1.36   0.175    -.0120618    .0656662
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   .2437076   .0972119     2.51   0.013      .051998    .4354171
      np_HHI |   -.032586   .0333962    -0.98   0.330     -.098446     .033274
       trend |   .0004341   .0001659     2.62   0.010     .0001069    .0007613
       _cons |   .7581924   .0014151   535.80   0.000     .7554018    .7609831
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     157.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5906
                                                  Adj R-squared   =     0.5804
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1295

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0398998   .0132844     3.00   0.003     .0137019    .0660978
     np_dhhi |   .0508572   .0651667     0.78   0.436    -.0776567    .1793712
      np_HHI |  -.0394353   .0223191    -1.77   0.079    -.0834504    .0045797
       _cons |   .7630394   .0005509  1385.17   0.000     .7619531    .7641258
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     185.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5891
                                                  Adj R-squared   =     0.5795
                                                  Within R-sq.    =     0.0138
Number of clusters (dma_code) =        198        Root MSE        =     0.1297

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0651804   .0130837     4.98   0.000     .0393783    .0909825
      np_HHI |  -.0825969   .0274186    -3.01   0.003    -.1366685   -.0285254
       trend |    .000437   .0001661     2.63   0.009     .0001095    .0007645
       _cons |   .7581786   .0014547   521.21   0.000     .7553099    .7610473
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     228.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5906
                                                  Adj R-squared   =     0.5804
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1295

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0479003   .0083413     5.74   0.000     .0314505      .06435
      np_HHI |  -.0498428   .0173892    -2.87   0.005    -.0841357   -.0155499
       _cons |   .7630395   .0005517  1383.10   0.000     .7619516    .7641275
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     192.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5893
                                                  Adj R-squared   =     0.5797
                                                  Within R-sq.    =     0.0143
Number of clusters (dma_code) =        198        Root MSE        =     0.1296

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0094498   .0046801     2.02   0.045     .0002203    .0186792
        dhhi |          0  (omitted)
     np_dhhi |   .2762488   .0807759     3.42   0.001     .1169523    .4355453
       trend |   .0004328   .0001658     2.61   0.010     .0001058    .0007598
       _cons |   .7581953   .0014173   534.95   0.000     .7554002    .7609903
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     226.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5906
                                                  Adj R-squared   =     0.5804
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1295

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0188892   .0031025     6.09   0.000     .0127707    .0250076
     np_dhhi |   .0901973    .051584     1.75   0.082    -.0115304    .1919251
       _cons |   .7630354   .0005563  1371.54   0.000     .7619383    .7641325
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0310e+13)

Linear regression                               Number of obs     =    284,104
                                                F(4, 203)         =     283.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0097
                                                Root MSE          =     .19898

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0389388   .0014913   -26.11   0.000    -.0418792   -.0359985
 post_merger |   .0374869   .0013192    28.42   0.000     .0348859     .040088
log_hhinc_~j |  -.0211447   .0146763    -1.44   0.151    -.0500823    .0077929
       trend |   .0003429   .0001877     1.83   0.069    -.0000272    .0007131
       _cons |   .9754306   .1498977     6.51   0.000     .6798745    1.270987
------------------------------------------------------------------------------
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   4,    201) =     129.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5868
                                                  Adj R-squared   =     0.5771
                                                  Within R-sq.    =     0.0116
Number of clusters (dma_code) =        202        Root MSE        =     0.1300

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0061219   .0011321     5.41   0.000     .0038897    .0083542
 post_merger |    .021994    .001202    18.30   0.000     .0196239    .0243641
log_hhinc_~j |  -.0083931   .0050379    -1.67   0.097    -.0183269    .0015408
       trend |   .0003419   .0001657     2.06   0.040     .0000151    .0006687
       _cons |    .845764    .051459    16.44   0.000     .7442953    .9472326
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   2,    201) =      15.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5943
                                                  Adj R-squared   =     0.5848
                                                  Within R-sq.    =     0.0002
Number of clusters (dma_code) =        202        Root MSE        =     0.1288

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0062203   .0011357     5.48   0.000     .0039808    .0084597
log_hhinc_~j |  -.0048041   .0041742    -1.15   0.251     -.013035    .0034268
       _cons |   .8229703   .0425069    19.36   0.000     .7391536    .9067869
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   4,    201) =     138.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5893
                                                  Adj R-squared   =     0.5796
                                                  Within R-sq.    =     0.0137
Number of clusters (dma_code) =        202        Root MSE        =     0.1296

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0061331    .001131     5.42   0.000      .003903    .0083632
 post_merger |   .0239881   .0012626    19.00   0.000     .0214985    .0264776
log_hhinc_~j |  -.0121182   .0050759    -2.39   0.018    -.0221272   -.0021093
       trend |   .0003994   .0001655     2.41   0.017      .000073    .0007258
       _cons |    .882205   .0518311    17.02   0.000     .7800026    .9844075
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     154.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5909
                                                  Adj R-squared   =     0.5806
                                                  Within R-sq.    =     0.0024
Number of clusters (dma_code) =        202        Root MSE        =     0.1295

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0059773   .0011627     5.14   0.000     .0036847      .00827
 post_merger |   .0222401   .0012091    18.39   0.000     .0198559    .0246242
log_hhinc_~j |  -.0098697   .0051859    -1.90   0.058    -.0200955     .000356
       _cons |   .8638335   .0527878    16.36   0.000     .7597447    .9679223
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0310e+13)

Linear regression                               Number of obs     =    284,104
                                                F(5, 203)         =    2890.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0781
                                                Root MSE          =     .19198

                             (Std. Err. adjusted for 204 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4492806   .0042457  -105.82   0.000     -.457652   -.4409092
 post_merger |   .4476709   .0037737   118.63   0.000     .4402303    .4551115
post_merg~or |  -.4310917   .0040151  -107.37   0.000    -.4390084   -.4231751
       trend |   .0003541   .0001875     1.89   0.060    -.0000155    .0007238
log_hhinc_~j |  -.0223741   .0146341    -1.53   0.128    -.0512283    .0064802
       _cons |   .9879223   .1494633     6.61   0.000     .6932227    1.282622
------------------------------------------------------------------------------
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   5,    201) =     230.11
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5872
                                                  Adj R-squared   =     0.5775
                                                  Within R-sq.    =     0.0124
Number of clusters (dma_code) =        202        Root MSE        =     0.1300

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0479343    .001648    29.09   0.000     .0446847    .0511838
 post_merger |  -.0197817   .0015889   -12.45   0.000    -.0229148   -.0166487
post_merg~or |   .0438923   .0015438    28.43   0.000     .0408483    .0469364
       trend |   .0003379   .0001656     2.04   0.043     .0000114    .0006643
log_hhinc_~j |   -.008434   .0050358    -1.67   0.096    -.0183637    .0014958
       _cons |   .8462099   .0514377    16.45   0.000     .7447832    .9476365
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   3,    201) =     312.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5947
                                                  Adj R-squared   =     0.5851
                                                  Within R-sq.    =     0.0010
Number of clusters (dma_code) =        202        Root MSE        =     0.1288

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0481059   .0016617    28.95   0.000     .0448292    .0513826
post_merg~or |   .0439693   .0015583    28.22   0.000     .0408966    .0470419
log_hhinc_~j |  -.0048418   .0041714    -1.16   0.247    -.0130672    .0033836
       _cons |   .8030991   .0424477    18.92   0.000     .7193991     .886799
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   5,    201) =     229.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5896
                                                  Adj R-squared   =     0.5800
                                                  Within R-sq.    =     0.0145
Number of clusters (dma_code) =        202        Root MSE        =     0.1296

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0479097   .0016497    29.04   0.000     .0446568    .0511626
 post_merger |  -.0177534   .0016112   -11.02   0.000    -.0209304   -.0145764
post_merg~or |   .0438548   .0015465    28.36   0.000     .0408054    .0469042
log_hhinc_~j |  -.0121592   .0050742    -2.40   0.017    -.0221646   -.0021538
       trend |   .0003955   .0001654     2.39   0.018     .0000694    .0007215
       _cons |   .8826516   .0518133    17.04   0.000     .7804843     .984819
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 76 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 2 HDFE groups                           F(   4,    201) =     273.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5912
                                                  Adj R-squared   =     0.5810
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        202        Root MSE        =     0.1294

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0476593   .0016657    28.61   0.000     .0443748    .0509439
 post_merger |  -.0194064   .0015852   -12.24   0.000    -.0225321   -.0162808
post_merg~or |    .043756   .0015663    27.94   0.000     .0406676    .0468444
log_hhinc_~j |  -.0098706   .0051873    -1.90   0.058     -.020099    .0003578
       _cons |   .8638354   .0528012    16.36   0.000     .7597201    .9679508
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       202         202           0    *|
 dma_code#c.trend |       202           0         202    ?|
   entity_effects |      6536        6536           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   8.0113e+13)

Linear regression                               Number of obs     =    283,520
                                                F(4, 199)         =     128.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0055
                                                Root MSE          =     .19944

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .0943904    .180001     0.52   0.601    -.2605638    .4493446
 post_merger |   .0186925      .0108     1.73   0.085    -.0026045    .0399896
       trend |   .0002916   .0001853     1.57   0.117    -.0000738    .0006571
log_hhinc_~j |  -.0212413   .0147677    -1.44   0.152    -.0503627      .00788
       _cons |   .9766507   .1509084     6.47   0.000      .679066    1.274235
------------------------------------------------------------------------------
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     134.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5869
                                                  Adj R-squared   =     0.5772
                                                  Within R-sq.    =     0.0123
Number of clusters (dma_code) =        198        Root MSE        =     0.1300

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2715694   .0809259     3.36   0.001     .1119771    .4311617
 post_merger |   .0075969   .0046911     1.62   0.107    -.0016543    .0168481
       trend |   .0003497    .000166     2.11   0.036     .0000223     .000677
log_hhinc_~j |  -.0062078   .0049765    -1.25   0.214    -.0160217    .0036062
       _cons |   .8232012   .0508739    16.18   0.000      .722874    .9235285
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =       5.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0032
                                                  R-squared       =     0.5944
                                                  Adj R-squared   =     0.5849
                                                  Within R-sq.    =     0.0009
Number of clusters (dma_code) =        198        Root MSE        =     0.1288

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2745853   .0810216     3.39   0.001     .1148044    .4343663
log_hhinc_~j |  -.0025119   .0040188    -0.63   0.533    -.0104374    .0054135
       _cons |   .7923366   .0409685    19.34   0.000     .7115435    .8731298
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     144.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5893
                                                  Adj R-squared   =     0.5797
                                                  Within R-sq.    =     0.0144
Number of clusters (dma_code) =        198        Root MSE        =     0.1296

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2706658   .0810292     3.34   0.001     .1108698    .4304618
 post_merger |   .0096783   .0047027     2.06   0.041     .0004042    .0189523
       trend |   .0004043   .0001657     2.44   0.016     .0000774    .0007311
log_hhinc_~j |  -.0099308   .0050037    -1.98   0.049    -.0197985   -.0000632
       _cons |   .8596377   .0511348    16.81   0.000     .7587959    .9604795
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 64 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     153.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5906
                                                  Adj R-squared   =     0.5804
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1295

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .0852311    .050699     1.68   0.094    -.0147514    .1852136
 post_merger |    .019097   .0030525     6.26   0.000     .0130772    .0251167
log_hhinc_~j |  -.0096501    .005177    -1.86   0.064    -.0198596    .0005594
       _cons |   .8613502   .0527046    16.34   0.000     .7574127    .9652877
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(3, 199)         =     942.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0442
                                                Root MSE          =     .29255

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.1771809   .0040936   -43.28   0.000    -.1852534   -.1691084
 post_merger |   .0901042   .0024451    36.85   0.000     .0852825    .0949259
       trend |   .0016835   .0003068     5.49   0.000     .0010786    .0022884
       _cons |   .7307537   .0061956   117.95   0.000     .7185362    .7429712
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     122.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8440
                                                  Adj R-squared   =     0.8404
                                                  Within R-sq.    =     0.0222
Number of clusters (dma_code) =        198        Root MSE        =     0.1194

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0270704   .0036321     7.45   0.000     .0199076    .0342331
 post_merger |    .013298   .0009735    13.66   0.000     .0113781    .0152178
       trend |   .0009754   .0002809     3.47   0.001     .0004216    .0015293
       _cons |   .7375311   .0025404   290.32   0.000     .7325213     .742541
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      55.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8474
                                                  Adj R-squared   =     0.8438
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        198        Root MSE        =     0.1181

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0273184   .0036549     7.47   0.000     .0201107    .0345261
       _cons |   .7527986   .0006582  1143.71   0.000     .7515006    .7540966
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     122.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8453
                                                  Adj R-squared   =     0.8417
                                                  Within R-sq.    =     0.0252
Number of clusters (dma_code) =        198        Root MSE        =     0.1189

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0270222   .0036122     7.48   0.000     .0198987    .0341456
 post_merger |   .0154632    .001031    15.00   0.000       .01343    .0174965
       trend |   .0010529   .0002767     3.81   0.000     .0005072    .0015986
       _cons |   .7357888   .0025358   290.16   0.000      .730788    .7407897
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     128.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8415
                                                  Within R-sq.    =     0.0055
Number of clusters (dma_code) =        198        Root MSE        =     0.1190

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0266297   .0036222     7.35   0.000     .0194864    .0337731
 post_merger |   .0134989   .0009504    14.20   0.000     .0116247     .015373
       _cons |   .7464144   .0007945   939.44   0.000     .7448475    .7479812
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =     926.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1458
                                                Root MSE          =     .27656

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4642333   .0104428   -44.45   0.000    -.4848261   -.4436405
 post_merger |    .377137   .0073674    51.19   0.000     .3626089    .3916652
post_merg~or |  -.3919884   .0093028   -42.14   0.000    -.4103332   -.3736435
       trend |   .0016856   .0002959     5.70   0.000      .001102    .0022691
       _cons |   .7307443   .0062006   117.85   0.000      .718517    .7429715
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     176.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8445
                                                  Adj R-squared   =     0.8408
                                                  Within R-sq.    =     0.0250
Number of clusters (dma_code) =        198        Root MSE        =     0.1192

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    .054424   .0035443    15.36   0.000     .0474343    .0614137
 post_merger |  -.0137488   .0018042    -7.62   0.000    -.0173068   -.0101908
post_merg~or |   .0371299   .0023078    16.09   0.000     .0325787     .041681
       trend |   .0009429    .000281     3.36   0.001     .0003888    .0014971
       _cons |   .7377283   .0025389   290.57   0.000     .7327213    .7427352
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     209.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8479
                                                  Adj R-squared   =     0.8443
                                                  Within R-sq.    =     0.0063
Number of clusters (dma_code) =        198        Root MSE        =     0.1179

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0551678   .0035645    15.48   0.000     .0481384    .0621973
post_merg~or |   .0377997   .0022831    16.56   0.000     .0332973    .0423021
       _cons |   .7394216    .000903   818.87   0.000     .7376408    .7412023
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     187.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8457
                                                  Adj R-squared   =     0.8421
                                                  Within R-sq.    =     0.0281
Number of clusters (dma_code) =        198        Root MSE        =     0.1187

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    .054388   .0035333    15.39   0.000       .04742     .061356
 post_merger |  -.0115902   .0019428    -5.97   0.000    -.0154215    -.007759
post_merg~or |   .0371465   .0023055    16.11   0.000     .0325998    .0416931
       trend |     .00102   .0002768     3.69   0.000     .0004742    .0015659
       _cons |   .7359871   .0025347   290.37   0.000     .7309885    .7409857
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     167.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8420
                                                  Within R-sq.    =     0.0084
Number of clusters (dma_code) =        198        Root MSE        =     0.1188

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0538282   .0036054    14.93   0.000     .0467181    .0609383
 post_merger |  -.0133877   .0017717    -7.56   0.000    -.0168817   -.0098937
post_merg~or |   .0369071   .0022473    16.42   0.000     .0324753    .0413389
       _cons |    .746315    .000816   914.55   0.000     .7447057    .7479243
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(3, 199)         =      87.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0048
                                                Root MSE          =     .29853

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2190327   .3675831     0.60   0.552    -.5058252    .9438907
 post_merger |   .0107494   .0217492     0.49   0.622    -.0321391    .0536379
       trend |   .0017365    .000305     5.69   0.000      .001135     .002338
       _cons |   .7305112   .0061618   118.56   0.000     .7183605    .7426619
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =      80.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8437
                                                  Adj R-squared   =     0.8400
                                                  Within R-sq.    =     0.0199
Number of clusters (dma_code) =        198        Root MSE        =     0.1195

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3300661   .0948767     3.48   0.001     .1429619    .5171704
 post_merger |   .0043921   .0053698     0.82   0.414    -.0061976    .0149818
       trend |   .0009868   .0002818     3.50   0.001     .0004311    .0015425
       _cons |   .7373875   .0025701   286.91   0.000     .7323191    .7424559
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      12.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0006
                                                  R-squared       =     0.8470
                                                  Adj R-squared   =     0.8435
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1182

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3328761   .0952847     3.49   0.001      .144967    .5207851
       _cons |   .7484308   .0026585   281.52   0.000     .7431879    .7536736
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =      77.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8413
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        198        Root MSE        =     0.1191

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3307263   .0948415     3.49   0.001     .1436913    .5177613
 post_merger |   .0065114   .0054063     1.20   0.230    -.0041502     .017173
       trend |   .0010636   .0002776     3.83   0.000     .0005162    .0016111
       _cons |   .7356458   .0025655   286.74   0.000     .7305864    .7407052
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     111.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8411
                                                  Within R-sq.    =     0.0025
Number of clusters (dma_code) =        198        Root MSE        =     0.1192

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .1564956   .0476771     3.28   0.001     .0624726    .2505187
 post_merger |     .01449   .0032202     4.50   0.000     .0081394    .0208405
       _cons |   .7463659   .0007824   953.91   0.000     .7448228    .7479089
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(6, 199)         =      82.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0050
                                                Root MSE          =     .29849

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0529102     .01697     3.12   0.002      .019446    .0863744
    post_hhi |   .0364766    .076131     0.48   0.632    -.1136503    .1866036
        dhhi |  -.1713975   .4564678    -0.38   0.708    -1.071532    .7287371
     np_dhhi |   .3210722   .1093695     2.94   0.004     .1054003    .5367442
      np_HHI |  -.1110931   .0318461    -3.49   0.001    -.1738923    -.048294
       trend |   .0017359   .0003044     5.70   0.000     .0011356    .0023362
       _cons |   .7246981   .0517271    14.01   0.000     .6226945    .8267018
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =     106.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0049
                                                Root MSE          =     .29851

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0835963    .012296     6.80   0.000     .0593492    .1078435
    post_hhi |   .0512208   .0603878     0.85   0.397    -.0678614    .1703029
      np_HHI |  -.1389612   .0284847    -4.88   0.000    -.1951317   -.0827907
       trend |   .0017354    .000304     5.71   0.000     .0011359    .0023349
       _cons |   .7083671   .0264115    26.82   0.000     .6562847    .7604495
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =      65.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0049
                                                Root MSE          =     .29851

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |  -.0011265   .0070232    -0.16   0.873    -.0149761     .012723
        dhhi |  -.2045028    .426218    -0.48   0.632    -1.044986    .6359806
     np_dhhi |   .4235354   .1238238     3.42   0.001     .1793602    .6677106
       trend |   .0017359   .0003053     5.69   0.000     .0011339     .002338
       _cons |   .7423949   .0234209    31.70   0.000       .69621    .7885798
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     111.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8438
                                                  Adj R-squared   =     0.8401
                                                  Within R-sq.    =     0.0206
Number of clusters (dma_code) =        198        Root MSE        =     0.1195

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0514614   .0169249     3.04   0.003     .0180841    .0848386
     np_dhhi |    .241104   .0882562     2.73   0.007     .0670557    .4151522
      np_HHI |   -.096818   .0321513    -3.01   0.003    -.1602229    -.033413
       trend |    .000986   .0002816     3.50   0.001     .0004307    .0015414
       _cons |   .7374051   .0023722   310.85   0.000     .7327269    .7420833
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =     140.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8437
                                                  Adj R-squared   =     0.8400
                                                  Within R-sq.    =     0.0202
Number of clusters (dma_code) =        198        Root MSE        =     0.1195

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0745087   .0120012     6.21   0.000     .0508414     .098176
      np_HHI |  -.1177609   .0272339    -4.32   0.000    -.1714684   -.0640534
       trend |   .0009855   .0002815     3.50   0.001     .0004304    .0015405
       _cons |   .7373997   .0023353   315.76   0.000     .7327943    .7420051
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   3,    197) =      80.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8437
                                                  Adj R-squared   =     0.8400
                                                  Within R-sq.    =     0.0199
Number of clusters (dma_code) =        198        Root MSE        =     0.1195

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0043921   .0053698     0.82   0.414    -.0061976    .0149818
     np_dhhi |   .3300661   .0948767     3.48   0.001     .1429619    .5171704
       trend |   .0009868   .0002818     3.50   0.001     .0004311    .0015425
       _cons |   .7373875   .0025701   286.91   0.000     .7323191    .7424559
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =      16.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8471
                                                  Adj R-squared   =     0.8436
                                                  Within R-sq.    =     0.0015
Number of clusters (dma_code) =        198        Root MSE        =     0.1182

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .2430052    .088483     2.75   0.007     .0685096    .4175007
      np_HHI |  -.0978083   .0322185    -3.04   0.003    -.1613458   -.0342708
       _cons |   .7713677   .0082007    94.06   0.000     .7551952    .7875401
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      18.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8471
                                                  Adj R-squared   =     0.8435
                                                  Within R-sq.    =     0.0011
Number of clusters (dma_code) =        198        Root MSE        =     0.1182

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |  -.1189162   .0273005    -4.36   0.000    -.1727548   -.0650775
       _cons |   .7825566   .0057023   137.24   0.000     .7713112     .793802
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   1,    197) =      12.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0006
                                                  R-squared       =     0.8470
                                                  Adj R-squared   =     0.8435
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1182

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .3328761   .0952847     3.49   0.001      .144967    .5207851
       _cons |   .7484308   .0026585   281.52   0.000     .7431879    .7536736
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     107.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8450
                                                  Adj R-squared   =     0.8414
                                                  Within R-sq.    =     0.0236
Number of clusters (dma_code) =        198        Root MSE        =     0.1190

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |    .053619   .0170293     3.15   0.002     .0200359    .0872021
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   .2416911   .0882657     2.74   0.007     .0676243     .415758
      np_HHI |  -.0968974   .0322478    -3.00   0.003    -.1604927   -.0333022
       trend |   .0010629   .0002774     3.83   0.000     .0005158    .0016101
       _cons |   .7356632   .0023629   311.34   0.000     .7310033    .7403231
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     165.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8411
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1192

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0369716   .0180638     2.05   0.042     .0013484    .0725947
     np_dhhi |   .1140267   .0653556     1.74   0.083    -.0148596    .2429131
      np_HHI |  -.0462542   .0324001    -1.43   0.155    -.1101497    .0176414
       _cons |   .7463728     .00068  1097.57   0.000     .7450317    .7477139
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     142.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8450
                                                  Adj R-squared   =     0.8413
                                                  Within R-sq.    =     0.0233
Number of clusters (dma_code) =        198        Root MSE        =     0.1190

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0767218   .0120991     6.34   0.000     .0528614    .1005822
      np_HHI |  -.1178914   .0273225    -4.31   0.000    -.1717736   -.0640092
       trend |   .0010624   .0002773     3.83   0.000     .0005156    .0016093
       _cons |   .7356579   .0023253   316.37   0.000     .7310722    .7402435
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     235.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8411
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1192

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0478671   .0140481     3.41   0.001     .0201631    .0755711
      np_HHI |  -.0561511   .0299852    -1.87   0.063    -.1152843    .0029822
       _cons |   .7463683   .0006897  1082.11   0.000     .7450081    .7477285
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =      77.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8413
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        198        Root MSE        =     0.1191

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0065114   .0054063     1.20   0.230    -.0041502     .017173
        dhhi |          0  (omitted)
     np_dhhi |   .3307263   .0948415     3.49   0.001     .1436913    .5177613
       trend |   .0010636   .0002776     3.83   0.000     .0005162    .0016111
       _cons |   .7356458   .0025655   286.74   0.000     .7305864    .7407052
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =     111.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8411
                                                  Within R-sq.    =     0.0025
Number of clusters (dma_code) =        198        Root MSE        =     0.1192

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |     .01449   .0032202     4.50   0.000     .0081394    .0208405
     np_dhhi |   .1564956   .0476771     3.28   0.001     .0624726    .2505187
       _cons |   .7463659   .0007824   953.91   0.000     .7448228    .7479089
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =     772.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0443
                                                Root MSE          =     .29254

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.1772031   .0041025   -43.19   0.000    -.1852931   -.1691131
 post_merger |   .0899647   .0023907    37.63   0.000     .0852503    .0946791
log_hhinc_~j |  -.0132183   .0206333    -0.64   0.522    -.0539062    .0274696
       trend |   .0016242   .0003109     5.22   0.000     .0010111    .0022372
       _cons |   .8672259   .2114005     4.10   0.000     .4503534    1.284098
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =     100.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8440
                                                  Adj R-squared   =     0.8404
                                                  Within R-sq.    =     0.0222
Number of clusters (dma_code) =        198        Root MSE        =     0.1194

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0270704   .0036334     7.45   0.000      .019905    .0342358
 post_merger |   .0132549   .0009691    13.68   0.000     .0113437     .015166
log_hhinc_~j |  -.0042557   .0081541    -0.52   0.602    -.0203363    .0118249
       trend |   .0009563   .0002636     3.63   0.000     .0004365    .0014762
       _cons |   .7814669   .0827502     9.44   0.000      .618277    .9446568
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =      27.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8474
                                                  Adj R-squared   =     0.8438
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        198        Root MSE        =     0.1181

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0273204   .0036549     7.47   0.000     .0201126    .0345282
log_hhinc_~j |   .0022859   .0073601     0.31   0.756    -.0122288    .0168006
       _cons |   .7293037   .0756993     9.63   0.000     .5800188    .8785887
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     100.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8453
                                                  Adj R-squared   =     0.8417
                                                  Within R-sq.    =     0.0253
Number of clusters (dma_code) =        198        Root MSE        =     0.1189

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0270223   .0036144     7.48   0.000     .0198943    .0341503
 post_merger |   .0153706   .0010112    15.20   0.000     .0133765    .0173646
log_hhinc_~j |  -.0073811   .0083601    -0.88   0.378    -.0238679    .0091058
       trend |   .0010218   .0002596     3.94   0.000     .0005099    .0015336
       _cons |   .8119813   .0848323     9.57   0.000     .6446853    .9792772
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     103.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8454
                                                  Adj R-squared   =     0.8415
                                                  Within R-sq.    =     0.0056
Number of clusters (dma_code) =        198        Root MSE        =     0.1190

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0266353   .0036257     7.35   0.000     .0194852    .0337854
 post_merger |   .0133937    .000894    14.98   0.000     .0116306    .0151568
log_hhinc_~j |   -.010008    .009071    -1.10   0.271    -.0278967    .0078808
       _cons |   .8493273   .0928612     9.15   0.000     .6661977    1.032457
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(5, 199)         =     775.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1460
                                                Root MSE          =     .27654

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4643196   .0104697   -44.35   0.000    -.4849654   -.4436738
 post_merger |   .3770285   .0073375    51.38   0.000     .3625591    .3914978
post_merg~or |  -.3920696   .0093303   -42.02   0.000    -.4104686   -.3736707
       trend |   .0016141    .000302     5.34   0.000     .0010184    .0022097
log_hhinc_~j |  -.0159324   .0205022    -0.78   0.438    -.0563618    .0244969
       _cons |   .8952384   .2100149     4.26   0.000     .4810982    1.309379
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   5,    197) =     141.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8445
                                                  Adj R-squared   =     0.8408
                                                  Within R-sq.    =     0.0251
Number of clusters (dma_code) =        198        Root MSE        =     0.1192

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0544272   .0035444    15.36   0.000     .0474374     .061417
 post_merger |  -.0137957   .0017774    -7.76   0.000    -.0173008   -.0102906
post_merg~or |   .0371342   .0023074    16.09   0.000     .0325838    .0416846
       trend |   .0009235    .000264     3.50   0.001     .0004028    .0014442
log_hhinc_~j |  -.0043243   .0080854    -0.53   0.593    -.0202692    .0116207
       _cons |   .7823722   .0820518     9.54   0.000     .6205597    .9441848
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     147.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8479
                                                  Adj R-squared   =     0.8443
                                                  Within R-sq.    =     0.0063
Number of clusters (dma_code) =        198        Root MSE        =     0.1179

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0551719    .003567    15.47   0.000     .0481376    .0622063
post_merg~or |   .0378025   .0022837    16.55   0.000     .0332988    .0423062
log_hhinc_~j |   .0023731   .0072959     0.33   0.745     -.012015    .0167612
       _cons |   .7150291    .075219     9.51   0.000     .5666913    .8633669
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   5,    197) =     150.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8457
                                                  Adj R-squared   =     0.8421
                                                  Within R-sq.    =     0.0282
Number of clusters (dma_code) =        198        Root MSE        =     0.1187

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0543936   .0035326    15.40   0.000     .0474271    .0613602
 post_merger |  -.0116891   .0019079    -6.13   0.000    -.0154517   -.0079266
post_merg~or |   .0371539   .0023069    16.11   0.000     .0326045    .0417033
log_hhinc_~j |  -.0074501   .0082881    -0.90   0.370     -.023795    .0088948
       trend |   .0009886   .0002599     3.80   0.000      .000476    .0015011
       _cons |   .8128922   .0840989     9.67   0.000     .6470425    .9787419
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =     136.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8458
                                                  Adj R-squared   =     0.8420
                                                  Within R-sq.    =     0.0085
Number of clusters (dma_code) =        198        Root MSE        =     0.1188

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0538434   .0036077    14.92   0.000     .0467287    .0609581
 post_merger |  -.0135036   .0017387    -7.77   0.000    -.0169325   -.0100746
post_merg~or |   .0369202   .0022465    16.43   0.000       .03249    .0413504
log_hhinc_~j |  -.0101172   .0090387    -1.12   0.264    -.0279423    .0077078
       _cons |   .8503516   .0925186     9.19   0.000     .6678977    1.032806
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   5.9087e+12)

Linear regression                               Number of obs     =    283,521
                                                F(4, 199)         =      62.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0049
                                                Root MSE          =     .29851

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2386443   .3578334     0.67   0.506    -.4669875    .9442761
 post_merger |   .0094576   .0210619     0.45   0.654    -.0320756    .0509907
       trend |    .001674   .0003087     5.42   0.000     .0010652    .0022828
log_hhinc_~j |  -.0139453   .0195081    -0.71   0.476    -.0524144    .0245239
       _cons |   .8744882   .2000553     4.37   0.000     .4799879    1.268989
------------------------------------------------------------------------------
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 1 HDFE group                            F(   4,    197) =      83.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8437
                                                  Adj R-squared   =     0.8400
                                                  Within R-sq.    =     0.0199
Number of clusters (dma_code) =        198        Root MSE        =     0.1195

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3281157   .0944107     3.48   0.001     .1419303    .5143012
 post_merger |   .0044762   .0053846     0.83   0.407    -.0061426    .0150949
       trend |   .0009739   .0002637     3.69   0.000     .0004539    .0014939
log_hhinc_~j |  -.0028674   .0082796    -0.35   0.729    -.0191954    .0134606
       _cons |   .7669901   .0839138     9.14   0.000     .6015054    .9324748
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   2,    197) =       6.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0022
                                                  R-squared       =     0.8470
                                                  Adj R-squared   =     0.8435
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1182

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3353999   .0951607     3.52   0.001     .1477356    .5230643
log_hhinc_~j |   .0036973    .007508     0.49   0.623    -.0111091    .0185036
       _cons |   .7103593   .0772755     9.19   0.000     .5579659    .8627526
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6463        6463           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   4,    197) =      82.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8413
                                                  Within R-sq.    =     0.0230
Number of clusters (dma_code) =        198        Root MSE        =     0.1191

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .3266509   .0944287     3.46   0.001     .1404301    .5128718
 post_merger |   .0066725   .0054453     1.23   0.222    -.0040661    .0174111
       trend |   .0010383   .0002597     4.00   0.000     .0005263    .0015504
log_hhinc_~j |  -.0059924   .0084688    -0.71   0.480    -.0226936    .0107088
       _cons |   .7975032   .0858204     9.29   0.000     .6282586    .9667477
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6463        6463           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 65 singleton observations)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    283,456
Absorbing 2 HDFE groups                           F(   3,    197) =     100.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8449
                                                  Adj R-squared   =     0.8411
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1191

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .1549323   .0428397     3.62   0.000      .070449    .2394157
 post_merger |   .0144787   .0029174     4.96   0.000     .0087255     .020232
log_hhinc_~j |  -.0098938    .009018    -1.10   0.274     -.027678    .0078904
       _cons |   .8481045   .0922769     9.19   0.000     .6661272    1.030082
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6463        6463           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(3, 199)         =      93.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0082
                                                Root MSE          =     .20822

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0389015   .0074262    -5.24   0.000    -.0535456   -.0242573
 post_merger |   .0409444   .0029981    13.66   0.000     .0350323    .0468564
       trend |  -.0000165   .0002884    -0.06   0.954    -.0005853    .0005523
       _cons |   .7482807   .0075319    99.35   0.000     .7334281    .7631333
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   3,    197) =      48.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5208
                                                  Adj R-squared   =     0.5098
                                                  Within R-sq.    =     0.0094
Number of clusters (dma_code) =        198        Root MSE        =     0.1464

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0060896   .0031877     1.91   0.058    -.0001967     .012376
 post_merger |   .0257583   .0023463    10.98   0.000     .0211312    .0303853
       trend |   .0000331   .0002735     0.12   0.904    -.0005063    .0005726
       _cons |   .7481092   .0025105   298.00   0.000     .7431583      .75306
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   1,    197) =       3.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0522
                                                  R-squared       =     0.5288
                                                  Adj R-squared   =     0.5180
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        198        Root MSE        =     0.1452

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0062609   .0032052     1.95   0.052      -.00006    .0125818
       _cons |   .7607039   .0004976  1528.87   0.000     .7597227    .7616852
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =      42.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5236
                                                  Adj R-squared   =     0.5126
                                                  Within R-sq.    =     0.0112
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0060971   .0031897     1.91   0.057    -.0001933    .0123876
 post_merger |   .0281174   .0028058    10.02   0.000     .0225841    .0336507
       trend |   .0000974   .0002742     0.36   0.723    -.0004433     .000638
       _cons |   .7463966   .0024848   300.38   0.000     .7414964    .7512969
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =      60.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5123
                                                  Within R-sq.    =     0.0025
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0079594   .0019072     4.17   0.000     .0041984    .0117205
 post_merger |   .0252323    .002295    10.99   0.000     .0207065    .0297581
       _cons |   .7483714   .0012518   597.84   0.000     .7459028    .7508401
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(4, 199)         =    1018.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0667
                                                Root MSE          =     .20199

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4161711    .013781   -30.20   0.000    -.4433468   -.3889955
 post_merger |   .4181259   .0096954    43.13   0.000     .3990071    .4372447
post_merg~or |  -.3982627   .0112227   -35.49   0.000    -.4203933   -.3761321
       trend |  -7.20e-06   .0002881    -0.02   0.980    -.0005752    .0005608
       _cons |   .7482383   .0075421    99.21   0.000     .7333655     .763111
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   4,    197) =      94.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5211
                                                  Adj R-squared   =     0.5101
                                                  Within R-sq.    =     0.0100
Number of clusters (dma_code) =        198        Root MSE        =     0.1463

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0445913   .0029284    15.23   0.000     .0388163    .0503663
 post_merger |  -.0127173   .0031154    -4.08   0.000    -.0188611   -.0065734
post_merg~or |   .0406256   .0029602    13.72   0.000     .0347879    .0464632
       trend |   .0000304   .0002736     0.11   0.912    -.0005091    .0005699
       _cons |   .7481273   .0025316   295.51   0.000     .7431347    .7531199
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =     152.10
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5291
                                                  Adj R-squared   =     0.5183
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0450633   .0029578    15.24   0.000     .0392304    .0508963
post_merg~or |   .0409431   .0029836    13.72   0.000     .0350591     .046827
       _cons |   .7421501     .00117   634.30   0.000     .7398427    .7444574
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   4,    197) =      95.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5129
                                                  Within R-sq.    =     0.0118
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0446138   .0029254    15.25   0.000     .0388446     .050383
 post_merger |  -.0103739   .0035091    -2.96   0.003    -.0172941   -.0034537
post_merg~or |   .0406415   .0029743    13.66   0.000     .0347759     .046507
       trend |   .0000947   .0002741     0.35   0.730     -.000446    .0006353
       _cons |   .7464147   .0025066   297.78   0.000     .7414715    .7513579
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =     166.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5243
                                                  Adj R-squared   =     0.5127
                                                  Within R-sq.    =     0.0032
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0489051   .0022878    21.38   0.000     .0443934    .0534168
 post_merger |  -.0157217   .0027454    -5.73   0.000    -.0211358   -.0103076
post_merg~or |   .0432564   .0022846    18.93   0.000      .038751    .0477619
       _cons |   .7483655   .0012896   580.32   0.000     .7458224    .7509087
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(3, 199)         =      41.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0054
                                                Root MSE          =     .20851

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .4527413   .4241465     1.07   0.287    -.3836572     1.28914
 post_merger |   .0020237   .0249275     0.08   0.935    -.0471322    .0511796
       trend |  -8.94e-07   .0002876    -0.00   0.998    -.0005681    .0005663
       _cons |   .7482096   .0075265    99.41   0.000     .7333676    .7630516
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   3,    197) =      41.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5209
                                                  Adj R-squared   =     0.5099
                                                  Within R-sq.    =     0.0096
Number of clusters (dma_code) =        198        Root MSE        =     0.1464

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2511297   .1066421     2.35   0.020     .0408231    .4614363
 post_merger |   .0132199   .0060956     2.17   0.031      .001199    .0252408
       trend |   .0000339   .0002735     0.12   0.902    -.0005054    .0005731
       _cons |   .7481079   .0025193   296.94   0.000     .7431395    .7530762
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   1,    197) =       5.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0187
                                                  R-squared       =     0.5289
                                                  Adj R-squared   =     0.5181
                                                  Within R-sq.    =     0.0003
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2541424   .1071978     2.37   0.019     .0427398     .465545
       _cons |   .7546555   .0029612   254.85   0.000     .7488157    .7604952
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =      36.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5237
                                                  Adj R-squared   =     0.5127
                                                  Within R-sq.    =     0.0114
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |    .253032   .1066464     2.37   0.019     .0427168    .4633472
 post_merger |   .0154718   .0062838     2.46   0.015     .0030797     .027864
       trend |   .0000982   .0002741     0.36   0.721    -.0004423    .0006387
       _cons |   .7463946   .0024927   299.43   0.000     .7414787    .7513105
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =      60.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5123
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .1515628   .0589873     2.57   0.011     .0352351    .2678905
 post_merger |   .0190709   .0040685     4.69   0.000     .0110475    .0270944
       _cons |   .7483673   .0012192   613.83   0.000      .745963    .7507716
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(6, 199)         =      51.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0150
                                                Root MSE          =     .20751

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0641247   .0205491     3.12   0.002     .0236027    .1046467
    post_hhi |  -.2681225   .0827131    -3.24   0.001    -.4312291   -.1050159
        dhhi |  -.0613069    .560696    -0.11   0.913    -1.166975    1.044361
     np_dhhi |   .1741566   .1148282     1.52   0.131    -.0522797    .4005929
      np_HHI |  -.1060563   .0371954    -2.85   0.005    -.1794039   -.0327086
       trend |  -1.09e-06   .0002889    -0.00   0.997    -.0005709    .0005687
       _cons |   .8678142   .0586824    14.79   0.000      .752095    .9835334
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(4, 199)         =      81.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0149
                                                Root MSE          =     .20751

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0806647   .0138898     5.81   0.000     .0532746    .1080548
    post_hhi |  -.2629224   .0637618    -4.12   0.000     -.388658   -.1371869
      np_HHI |  -.1209955   .0311752    -3.88   0.000    -.1824716   -.0595194
       trend |  -1.24e-06   .0002889    -0.00   0.997     -.000571    .0005685
       _cons |   .8620121   .0271673    31.73   0.000     .8084394    .9155848
------------------------------------------------------------------------------
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(4, 199)         =      32.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0056
                                                Root MSE          =     .20849

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0122076   .0071064     1.72   0.087     -.001806    .0262212
        dhhi |   .1756982    .466781     0.38   0.707    -.7447736     1.09617
     np_dhhi |    .277043   .1246073     2.22   0.027     .0313227    .5227632
       trend |  -1.35e-06   .0002878    -0.00   0.996    -.0005689    .0005662
       _cons |    .738032    .025398    29.06   0.000     .6879482    .7881158
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   4,    197) =      55.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5211
                                                  Adj R-squared   =     0.5101
                                                  Within R-sq.    =     0.0101
Number of clusters (dma_code) =        198        Root MSE        =     0.1463

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0618905   .0205513     3.01   0.003     .0213618    .1024193
     np_dhhi |   .1610764   .1014534     1.59   0.114    -.0389978    .3611505
      np_HHI |  -.1004682   .0380972    -2.64   0.009    -.1755989   -.0253374
       trend |   .0000381   .0002737     0.14   0.890    -.0005016    .0005777
       _cons |   .7480926   .0023555   317.59   0.000     .7434474    .7527378
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   3,    197) =      74.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5211
                                                  Adj R-squared   =     0.5101
                                                  Within R-sq.    =     0.0099
Number of clusters (dma_code) =        198        Root MSE        =     0.1463

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0771747   .0143414     5.38   0.000     .0488922    .1054571
      np_HHI |  -.1142489   .0319921    -3.57   0.000    -.1773399   -.0511579
       trend |    .000038   .0002735     0.14   0.890    -.0005014    .0005774
       _cons |   .7480871   .0023248   321.79   0.000     .7435025    .7526717
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   3,    197) =      41.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5209
                                                  Adj R-squared   =     0.5099
                                                  Within R-sq.    =     0.0096
Number of clusters (dma_code) =        198        Root MSE        =     0.1464

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0132199   .0060956     2.17   0.031      .001199    .0252408
     np_dhhi |   .2511297   .1066421     2.35   0.020     .0408231    .4614363
       trend |   .0000339   .0002735     0.12   0.902    -.0005054    .0005731
       _cons |   .7481079   .0025193   296.94   0.000     .7431395    .7530762
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =      10.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.5292
                                                  Adj R-squared   =     0.5183
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .1632051    .102074     1.60   0.111    -.0380929    .3645031
      np_HHI |  -.1014573    .038609    -2.63   0.009    -.1775974   -.0253173
       _cons |    .778187    .009863    78.90   0.000     .7587365    .7976376
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   1,    197) =      12.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0005
                                                  R-squared       =     0.5291
                                                  Adj R-squared   =     0.5183
                                                  Within R-sq.    =     0.0007
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      np_HHI |    -.11542   .0324268    -3.56   0.000    -.1793683   -.0514718
       _cons |   .7855881   .0067181   116.94   0.000     .7723396    .7988367
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   1,    197) =       5.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0187
                                                  R-squared       =     0.5289
                                                  Adj R-squared   =     0.5181
                                                  Within R-sq.    =     0.0003
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     np_dhhi |   .2541424   .1071978     2.37   0.019     .0427398     .465545
       _cons |   .7546555   .0029612   254.85   0.000     .7488157    .7604952
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   4,    197) =      47.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5130
                                                  Within R-sq.    =     0.0119
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0644562   .0209618     3.07   0.002     .0231179    .1057945
    post_hhi |          0  (omitted)
        dhhi |          0  (omitted)
     np_dhhi |   .1624068   .1014356     1.60   0.111    -.0376321    .3624458
      np_HHI |  -.1011074   .0384554    -2.63   0.009    -.1769445   -.0252702
       trend |   .0001022   .0002741     0.37   0.710    -.0004383    .0006427
       _cons |   .7463787   .0023237   321.21   0.000     .7417963    .7509612
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =     120.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5123
                                                  Within R-sq.    =     0.0024
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0548018   .0249337     2.20   0.029     .0056305    .1039731
     np_dhhi |   .0857487   .0834107     1.03   0.305    -.0787439    .2502412
      np_HHI |  -.0737638   .0455816    -1.62   0.107    -.1636543    .0161267
       _cons |   .7483771   .0010036   745.72   0.000      .746398    .7503562
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
note: post_hhi is probably collinear with the fixed effects (all partialled-out
>  values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: post_hhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =      65.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5238
                                                  Adj R-squared   =     0.5129
                                                  Within R-sq.    =     0.0117
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    post_hhi |          0  (omitted)
 post_merger |   .0798667   .0147848     5.40   0.000     .0507098    .1090235
      np_HHI |  -.1150018   .0323382    -3.56   0.000    -.1787754   -.0512283
       trend |   .0001021   .0002739     0.37   0.710    -.0004381    .0006423
       _cons |   .7463736   .0022929   325.52   0.000     .7418519    .7508953
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =     179.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5123
                                                  Within R-sq.    =     0.0024
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0629207   .0197535     3.19   0.002     .0239652    .1018761
      np_HHI |  -.0810592   .0417343    -1.94   0.054    -.1633625    .0012441
       _cons |   .7483739   .0010007   747.84   0.000     .7464004    .7503474
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
note: dhhi is probably collinear with the fixed effects (all partialled-out val
> ues are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 4 iterations)
note: dhhi omitted because of collinearity

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =      36.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5237
                                                  Adj R-squared   =     0.5127
                                                  Within R-sq.    =     0.0114
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0154718   .0062838     2.46   0.015     .0030797     .027864
        dhhi |          0  (omitted)
     np_dhhi |    .253032   .1066464     2.37   0.019     .0427168    .4633472
       trend |   .0000982   .0002741     0.36   0.721    -.0004423    .0006387
       _cons |   .7463946   .0024927   299.43   0.000     .7414787    .7513105
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =      60.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5123
                                                  Within R-sq.    =     0.0023
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 post_merger |   .0190709   .0040685     4.69   0.000     .0110475    .0270944
     np_dhhi |   .1515628   .0589873     2.57   0.011     .0352351    .2678905
       _cons |   .7483673   .0012192   613.83   0.000      .745963    .7507716
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(4, 199)         =      76.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0087
                                                Root MSE          =     .20816

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.0390805   .0073601    -5.31   0.000    -.0535943   -.0245666
 post_merger |   .0412904   .0030103    13.72   0.000     .0353542    .0472265
log_hhinc_~j |   .0240015   .0262507     0.91   0.362    -.0277638    .0757667
       trend |   .0000873   .0003493     0.25   0.803    -.0006015    .0007761
       _cons |   .5005268   .2700373     1.85   0.065    -.0319749    1.033029
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   4,    197) =      46.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5208
                                                  Adj R-squared   =     0.5098
                                                  Within R-sq.    =     0.0094
Number of clusters (dma_code) =        198        Root MSE        =     0.1464

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0059948   .0031692     1.89   0.060    -.0002551    .0122447
 post_merger |   .0257029   .0023362    11.00   0.000     .0210958    .0303101
log_hhinc_~j |  -.0080759    .009776    -0.83   0.410    -.0273549    .0112031
       trend |  -1.90e-06   .0002621    -0.01   0.994    -.0005187    .0005149
       _cons |   .8314681   .0995888     8.35   0.000     .6350711    1.027865
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =       4.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0183
                                                  R-squared       =     0.5288
                                                  Adj R-squared   =     0.5180
                                                  Within R-sq.    =     0.0001
Number of clusters (dma_code) =        198        Root MSE        =     0.1452

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0062621   .0031341     2.00   0.047     .0000815    .0124428
log_hhinc_~j |   .0001039   .0080245     0.01   0.990    -.0157211    .0159289
       _cons |   .7596357   .0821261     9.25   0.000     .5976765    .9215948
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   4,    197) =      41.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5236
                                                  Adj R-squared   =     0.5127
                                                  Within R-sq.    =     0.0113
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0059631   .0031911     1.87   0.063    -.0003299    .0122561
 post_merger |   .0280118   .0027972    10.01   0.000     .0224955    .0335281
log_hhinc_~j |  -.0114061   .0099818    -1.14   0.255    -.0310909    .0082787
       trend |   .0000509   .0002648     0.19   0.848    -.0004713    .0005732
       _cons |   .8641152   .1017098     8.50   0.000     .6635354    1.064695
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =      60.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5240
                                                  Adj R-squared   =     0.5124
                                                  Within R-sq.    =     0.0026
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0079621   .0019131     4.16   0.000     .0041892     .011735
 post_merger |    .025099   .0022428    11.19   0.000      .020676    .0295221
log_hhinc_~j |  -.0122808   .0106405    -1.15   0.250    -.0332647    .0087032
       _cons |   .8746496   .1086016     8.05   0.000     .6604787     1.08882
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(5, 199)         =     927.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0670
                                                Root MSE          =     .20195

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |  -.4155438   .0137792   -30.16   0.000    -.4427158   -.3883718
 post_merger |   .4176196   .0095979    43.51   0.000      .398693    .4365461
post_merg~or |  -.3974636   .0111421   -35.67   0.000    -.4194354   -.3754918
       trend |   .0000679   .0003383     0.20   0.841    -.0005992     .000735
log_hhinc_~j |   .0173747   .0251109     0.69   0.490     -.032143    .0668924
       _cons |   .5688893   .2581363     2.20   0.029     .0598556    1.077923
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   5,    197) =      78.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5211
                                                  Adj R-squared   =     0.5102
                                                  Within R-sq.    =     0.0101
Number of clusters (dma_code) =        198        Root MSE        =     0.1463

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0445375   .0028908    15.41   0.000     .0388367    .0502384
 post_merger |  -.0128158   .0030965    -4.14   0.000    -.0189223   -.0067094
post_merg~or |   .0406704   .0029443    13.81   0.000     .0348639    .0464769
       trend |  -5.15e-06    .000262    -0.02   0.984    -.0005217    .0005114
log_hhinc_~j |  -.0081887   .0097077    -0.84   0.400    -.0273331    .0109556
       _cons |   .8326509    .098864     8.42   0.000     .6376833    1.027618
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =     103.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5291
                                                  Adj R-squared   =     0.5183
                                                  Within R-sq.    =     0.0008
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0450633   .0029426    15.31   0.000     .0392603    .0508662
post_merg~or |   .0409431   .0029621    13.82   0.000     .0351016    .0467847
log_hhinc_~j |  -7.76e-06   .0079502    -0.00   0.999    -.0156861    .0156706
       _cons |   .7422298   .0820788     9.04   0.000      .580364    .9040956
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   5,    197) =      79.90
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5130
                                                  Within R-sq.    =     0.0119
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0445387   .0028795    15.47   0.000     .0388602    .0502172
 post_merger |  -.0105407   .0035019    -3.01   0.003    -.0174466   -.0036348
post_merg~or |    .040705   .0029603    13.75   0.000     .0348671     .046543
log_hhinc_~j |  -.0115205   .0099131    -1.16   0.247    -.0310698    .0080289
       trend |   .0000478   .0002646     0.18   0.857    -.0004741    .0005697
       _cons |   .8653134   .1009808     8.57   0.000     .6661712    1.064456
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   4,    197) =     130.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5243
                                                  Adj R-squared   =     0.5127
                                                  Within R-sq.    =     0.0033
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |   .0489146   .0022815    21.44   0.000     .0444154    .0534138
 post_merger |  -.0158619   .0026664    -5.95   0.000    -.0211203   -.0106036
post_merg~or |   .0432636   .0022679    19.08   0.000     .0387911    .0477361
log_hhinc_~j |  -.0122963   .0106303    -1.16   0.249    -.0332602    .0086675
       _cons |   .8748039   .1084698     8.06   0.000     .6608929    1.088715
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(sum of wgt is   4.4825e+11)

Linear regression                               Number of obs     =    282,796
                                                F(4, 199)         =      35.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0059
                                                Root MSE          =     .20847

                             (Std. Err. adjusted for 200 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .4212787   .4140236     1.02   0.310    -.3951577    1.237715
 post_merger |   .0040877   .0242414     0.17   0.866    -.0437153    .0518907
       trend |   .0000876   .0003452     0.25   0.800    -.0005932    .0007684
log_hhinc_~j |   .0204905   .0252093     0.81   0.417    -.0292212    .0702021
       _cons |   .5366985      .2596     2.07   0.040     .0247785    1.048618
------------------------------------------------------------------------------
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 1 HDFE group                            F(   4,    197) =      53.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5209
                                                  Adj R-squared   =     0.5099
                                                  Within R-sq.    =     0.0096
Number of clusters (dma_code) =        198        Root MSE        =     0.1464

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2462535    .105391     2.34   0.020     .0384142    .4540928
 post_merger |    .013424   .0061588     2.18   0.030     .0012783    .0255697
       trend |   2.21e-06   .0002616     0.01   0.993    -.0005137    .0005182
log_hhinc_~j |  -.0072941   .0098118    -0.74   0.458    -.0266438    .0120557
       _cons |   .8233968   .0998841     8.24   0.000     .6264175    1.020376
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   2,    197) =       2.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0613
                                                  R-squared       =     0.5289
                                                  Adj R-squared   =     0.5181
                                                  Within R-sq.    =     0.0003
Number of clusters (dma_code) =        198        Root MSE        =     0.1451

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2547759   .1071159     2.38   0.018     .0435348    .4660171
log_hhinc_~j |   .0009472   .0080617     0.12   0.907    -.0149512    .0168455
       _cons |   .7449037   .0829423     8.98   0.000      .581335    .9084724
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6333        6333           0    *|
   time_effects |        19           0          19     |
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   4,    197) =      47.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5237
                                                  Adj R-squared   =     0.5128
                                                  Within R-sq.    =     0.0115
Number of clusters (dma_code) =        198        Root MSE        =     0.1459

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .2459388   .1054622     2.33   0.021      .037959    .4539186
 post_merger |   .0157431   .0063881     2.46   0.015     .0031454    .0283409
       trend |   .0000549   .0002644     0.21   0.836    -.0004665    .0005763
log_hhinc_~j |  -.0106226   .0100105    -1.06   0.290    -.0303642     .009119
       _cons |   .8560264   .1019315     8.40   0.000     .6550094    1.057043
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
  time_calendar |         4           0           4     |
 entity_effects |      6333        6333           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout
(dropped 26 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    282,770
Absorbing 2 HDFE groups                           F(   3,    197) =      62.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5239
                                                  Adj R-squared   =     0.5123
                                                  Within R-sq.    =     0.0024
Number of clusters (dma_code) =        198        Root MSE        =     0.1460

                             (Std. Err. adjusted for 198 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~i |   .1517883   .0568213     2.67   0.008     .0397321    .2638444
 post_merger |   .0189255   .0038422     4.93   0.000     .0113483    .0265027
log_hhinc_~j |  -.0122791   .0106286    -1.16   0.249    -.0332396    .0086814
       _cons |   .8746283   .1084561     8.06   0.000     .6607442    1.088512
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------+
      Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------+---------------------------------------|
         dma_code |       198         198           0    *|
 dma_code#c.trend |       198           0         198    ?|
   entity_effects |      6333        6333           0    *|
----------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
dir : seeout

. 
. reghdfe lprice post_merger_merging post_merger trend, abs(entity_effects) vce
> (cluster dma_code)
(dropped 77 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   3,    201) =     280.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8637
                                                  Adj R-squared   =     0.8605
                                                  Within R-sq.    =     0.0227
Number of clusters (dma_code) =        202        Root MSE        =     0.1103

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |     .01908   .0011782    16.19   0.000     .0167569    .0214032
 post_merger |   .0144034    .000906    15.90   0.000     .0126169    .0161899
       trend |   .0010476   .0001553     6.75   0.000     .0007414    .0013537
       _cons |   .7449145   .0014386   517.81   0.000     .7420778    .7477511
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl1

. 
. reghdfe lprice post_merger_merging post_merger log_hhinc_per_person_adj trend
> , abs(entity_effects) vce(cluster dma_code)
(dropped 77 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,028
Absorbing 1 HDFE group                            F(   4,    201) =     213.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8637
                                                  Adj R-squared   =     0.8605
                                                  Within R-sq.    =     0.0227
Number of clusters (dma_code) =        202        Root MSE        =     0.1103

                             (Std. Err. adjusted for 202 clusters in dma_code)
------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
post_merge~g |    .019087   .0011785    16.20   0.000     .0167631    .0214108
 post_merger |     .01432   .0009018    15.88   0.000     .0125418    .0160982
log_hhinc_~j |  -.0079434   .0048603    -1.63   0.104    -.0175272    .0016404
       trend |   .0010226   .0001557     6.57   0.000     .0007157    .0013296
       _cons |    .826096   .0496942    16.62   0.000     .7281072    .9240849
------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------+
    Absorbed FE | Categories  - Redundant  = Num. Coefs |
----------------+---------------------------------------|
 entity_effects |      6536        6536           0    *|
--------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est sto tabl2

. 
. esttab tabl1 tabl2 using `2'/brandlevel_did_stata_table_`3'.tex, replace se r
> 2 ar2 title("Reduced Form Price Effects") mtitles("DMA/Product FE" "DMA/Produ
> ct, Demographics") addnote("Data frequency: `3'.")
(note: file ../output//brandlevel_did_stata_table_quarter.tex not found)
(output written to ../output//brandlevel_did_stata_table_quarter.tex)

. 
. 
. est clear

. 
. 
. 
. 
. exit, STATA clear
